Repository: CudaText-addons/CudaText-translations
Catalog: translation.*/langpy/*/LC_MESSAGES/cuda_find_*_files.po
Languages: de_at

source: Use folder of current file. Shift+Click or Ctrl+Shift+C - Prepare search in the current file. Ctrl+Click - Prepare search in all tabs. Shift+Ctrl+Click - Prepare search in the current tab.
de_at: Verzeichnis der aktuellen Datei verwenden. Shift+Klick oder Strg+Shift+C - Suche in aktueller Datei vorbereiten. Strg+Klick - Suche in allen Dateireitern vorbereiten. Strg+Shift+Klick - Suche im aktuellen Dateireiter vorbereiten.

source: Advanced search options
de_at: Erweiterte Suchoptionen

source: Output report to tab/file
de_at: Bericht in Dateireiter/Datei schreiben

source: Advanced tab report options
de_at: Erweiterte Optionen für Bericht in Dateireiter

source: Local menu Ctrl+Click - Adjust vertical alignments...
de_at: Kontextmenü Strg+Klick - Senkrechte Ausrichtungen justieren...

source: M[, F] Stop after M fragments will be found. Search only inside F first proper files. Note: If Sort is on then steps are - Collect all proper files - Sort the list - Use first F files to search
de_at: M[, F] Stoppt nach M Suchtreffern. Sucht nur innerhalb der ersten F betreffenden Dateien. Hinweis: Schritte, wenn "Sortieren" eingeschaltet ist: - Sammle alle betreffenden Dateien ein - Sortiere die Liste - Verwende die ersten F zu durchsuchenden Dateien

source: hour(s)
de_at: Stunde(n)

source: day(s)
de_at: Tag(e)

source: week(s)
de_at: Woche(n)

source: month(s)
de_at: Monat(e)

source: year(s)
de_at: Jahr(e)

source: "N" or "<N" or ">N". Skip files if the age less or more then N. "N" and "<N" are equal. "0" to all ages.
de_at: "N" oder "<N" oder ">N". Wenn Alter < N oder Alter > N, dann Dateien überspringen. "N" und "<N" sind gleichbedeutend. "0" für jedes Alter.

source: Format of the reported tree structure. Compact - report all found line with full file info: path(r[:c:l]):line path/(r[:c:l]):line Tree schemes +Search for "*" <full_path(row[:col:len])>: line with ALL marked fragments +Search for "*" <full_path>: #count <(row[:col:len])>: line with ALL marked fragments Sparse - report separated folders and fragments: dir/file(r[:c:l]):line dir/file/(r[:c:l]):line Tree schemes +Search for "*" <root>: #count <dir>: #count <file.ext(row[:col:len])>: line with ONE marked fragment +Search for "*" <root>: #count <dir>: #count <file.ext>: #count <(row[:col:len])>: line with ONE marked fragment For sorted files and for search in tabs In folder={} only Compact options are used. When a conflict occurs, "Tree type" is automatically changed.
de_at: Format der Baumstruktur im Bericht. Kompakt - Bericht enthält alle gefundenen Zeilen mit kompletter Dateiinfo: Pfad(r[:m:l]):Zeile Pfad/(r[:m:l]):Zeile Baumschemata +Suchen nach "*" <Voller_Pfad(Reihe[:Spalte:Länge])>: Zeile, ALLE Treffer ausgewählt +Suchen nach "*" <Voller_Pfad>: #Anzahl <(Reihe[:Spalte:Länge])>: Zeile, ALLE Treffer ausgewählt Spärlich - Berichtet Verzeichnisse und Fragmente getrennt: Verzeichnis/Datei(r[:m:l]):Zeile Verzeichnis/Datei/(r[:m:l]):Zeile Baumschemata +Suchen nach "*" <Root>: #Anzahl <Verzeichnis>: #Anzahl <Datei.ext(Reihe[:Spalte:Länge])>: Zeile, nur EIN Treffer ausgewählt +Suchen nach "*" <Root>: #Anzahl <Verzeichnis>: #Anzahl <Datei.ext>: #Anzahl <(Reihe[:Spalte:Länge])>: Zeile, nur EIN Treffer ausgewählt Für sortierte Dateien und für die Suche in Dateireitern In Verzeichnis={} werden nur "Kompakt"-Optionen verwendet. In Konfliktfällen wird der "Baumtyp" automatisch gewechselt.

source: Conte&xt -{}+{}
de_at: Konte&xt -{}+{}

source: Show result line and both its nearest lines, above and below result.
de_at: Zeigt die Ergebniszeile mitsamt ihren Kontextzeilen darüber und darunter an.

source: Align columns (filenames/numbers) by widest cell width
de_at: Richtet Spalten (Dateinamen/Zahlen) nach der größten Zellenbreite aus

source: Start search. Shift+Click - Put report to new tab. It is like pressing Find with option "Show in: {}". Ctrl+Click - Append result to existing report. It is like pressing Find with option "[x]Append results".
de_at: Startet die Suche. Shift+Klick - Schreibt den Bericht in neuen Dateireiter. Gleich wie [Suchen] drücken mit Option "Anzeigen in: {}". Strg+Klick - Hängt das Ergebnis an den vorhandenen Bericht an. Gleich wie [Suchen] drücken mit Option "[x]Ergebnis anhängen".

source: Start search and replacement. Shift+Click - Run without question "Do you want to replace...?"
de_at: Startet das Suchen und Ersetzen. Shift+Klick - Ohne Bestätigung "Möchten Sie ... ersetzen?"

source: Count matches only. Shift+Click or Ctrl+T - Find file names only. Note: Alt+T and Ctrl+T works if button is hidden.
de_at: Nur Treffer zählen. Shift+Klick or Strg+T - Sucht nur Dateinamen. Hinweis: Alt+T und Strg+T funktionieren auch bei ausgeblendetem Schalter.

source: Save options for future. Restore saved options. Shift+Click - Show presets list in applying history order. Ctrl+Click - Apply last used preset. Note: Alt+S works if button is hidden. Ctrl+1 - Apply first preset. Ctrl+2 - Apply second preset. Ctrl+3 - Apply third preset.
de_at: Optionen für künfigen Gebrauch speichern bzw. wiederherstellen. Shift+Klick - Liste der Voreinstellungen, sortiert nach Verlauf. Strg+Klick - Wendet die zuletzt verwendete Voreinstellung an. Hinweis: Alt+S funktioniert auch bei ausgeblendetem Schalter. Strg+1 - Wendet die 1. Voreinstellung an. Strg+2 - Wendet die 2. Voreinstellung an. Strg+3 - Wendet die 3. Voreinstellung an.

source: In which encodings try to read files. First suitable will be used. "{}" is slow. Default encoding: {}
de_at: Mit welchen Kodierungen Dateien gelesen werden. Die erste passende wird verwendet. "{}" ist langsam. Standardkodierung: {}

source: [Clear fixed files]
de_at: [Behandelte Dateien leeren]

source: [Add fixed file]
de_at: [Behandelte Datei hinzufügen]

source: (no results)
de_at: (kein Ergebnis)

source: sorted
de_at: sortiert

source: age
de_at: Alter

source: first "
de_at: erste "

source: append to
de_at: anhängen an

source: Report:
de_at: Bericht an:

source: aligned
de_at: ausgerichtet

source: context-{}+{}
de_at: Kontext-{}+{}

source: Search:
de_at: Suchen:

source: S&kip files:
de_at: Dateien &überspringen:

source: S&ort file list:
de_at: Dateiliste s&ortieren:

source: A&ge (0=all):
de_at: Alter (0=alle):

source: &Firsts (0=all):
de_at: Die &ersten (0=alle)

source: &Encodings:
de_at: &Kodierungen:

source: Clear all fixed files ({}) for "{}"?
de_at: Alle behandelten Dateien ({}) für "{}" leeren?

source: Report to
de_at: Bericht an

source: &Report to:
de_at: Be&richt an:

source: Appen&d results
de_at: Er&gebnis anhängen

source: &Tree type:
de_at: &Baumtyp:

source: &Align (r:c:l)
de_at: &Ausrichten (r:m:l)

source: Add conte&xt lines
de_at: Inklusive Konte&xtzeilen

source: &Before:
de_at: &Darüber:

source: A&fter:
de_at: Dar&unter:

source: <{}> (search setting)
de_at: <{}> (Sucheinstellung)

source: Source encoding
de_at: Quellzeichensatz

source: <ERROR. See "Source encoding" in menu>
de_at: <FEHLER. Siehe "Quellkodierung" im Menü>

source: (no source)
de_at: (keine Quelle)

source: Fill the "{}" field
de_at: Feld "{}" ausfüllen

source: Do you want to replace in {}?
de_at: Möchten Sie in {} ersetzen?

source: current tab
de_at: im aktuellen Dateireiter

source: all tabs
de_at: in allen Dateireitern

source: all found files
de_at: in allen gefundenen Dateien

source: Fix quotes in the "{}" field
de_at: Anführungszeichen im Feld "{}" reparieren

source: Set correct "{}" reg.ex. Error: {}
de_at: Korrekten "{}"-Regex definieren. Fehler: {}

source: Set existing folder in "{}" or use "{}" or use "{}". =/Presets can help.
de_at: Vorhandenes Verzeichnis in "{}" festlegen oder "{}" verwenden oder "{}" verwenden. =/Presets kann helfen.

source: tab
de_at: Dateireiter

source: file
de_at: Datei

source: Search stopped
de_at: Suche gestoppt

source: No {}s picked
de_at: Keine {}en gesammelt

source: No matches found (in {} {})
de_at: Keine Treffer gefunden (in {} {})

source: Found {} {} in {}({}) {}
de_at: {} {} in {}({}) {} gefunden

source: Remove "{}"?
de_at: "{}" entfernen?

source: Name to save dialog and controls positions
de_at: Name zum Speichern der Dialog- und Schalterpositionen

source: Name "{}" already used. Overwrite?
de_at: Name "{}" bereits vorhanden. Überschreiben?

source: Apply layout: {}
de_at: Layout anwenden: {}

source: Open fragment
de_at: Suchtreffer öffnen

source: Go to fragment
de_at: Geh zum Suchtreffer

source: Fold branch
de_at: Faltungszweig

source: Copy Results to tab
de_at: Ergebnis in Dateireiter kopieren

source: Count matches only
de_at: Nur Treffer zählen

source: Find file names only
de_at: Nur Dateinamen suchen

source: Find and replace
de_at: Suchen und ersetzen

source: Find and replace (without question) [Shift+"{}"]
de_at: Suchen und ersetzen (ohne Bestätigung) [Shift+"{}"]

source: Find
de_at: Suchen

source: Find and put report to new tab [Shift+"{}"]
de_at: Suchen und Bericht in neuen Dateireiter schreiben [Shift+"{}"]

source: Find and append result to existing report [Ctrl+"{}"]
de_at: Suchen und Ergebnis an vorhandenen Bericht anhängen [Strg+"{}"]

source: Use folder of current file
de_at: Verzeichnis der aktuellen Datei verwenden

source: Prepare search in the current file [Shift+"{}"]
de_at: Suche in aktueller Datei vorbereiten [Shift+"{}"]

source: Prepare search in all tabs [Ctrl+"{}"]
de_at: Suche in allen Dateireitern vorbereiten [Strg+"{}"]

source: Prepare search in the current tab [Shift+Ctrl+"{}"]
de_at: Suche im aktuellen Dateireiter vorbereiten [Shift+Strg+"{}"]

source: Fill "{}" to find in project folders
de_at: Feld "{}" ausfüllen für die Suche in Projektordnern

source: Fill "{}" to find in tabs
de_at: Feld "{}" ausfüllen für die Suche in Dateireitern

source: Choose folder…
de_at: Verzeichnis auswählen…

source: Choose file to find in it…
de_at: Datei zum Durchsuchen auswählen…

source: Apply "Onl&y" [Ctrl+Num0]
de_at: "Nur Startverzeichnis" anwenden [Strg+Num0]

source: Apply "+1 level" [Ctrl+Num1]
de_at: "+1 Ebene" anwenden [Strg+Num1]

source: Apply "+A&ll" [Ctrl+Num9]
de_at: "+A&lle Unterverzeichnisse" anwenden [Strg+Num9]

source: Options for report t&o tab…
de_at: &Optionen für Bericht in Dateireiter…

source: Extra options for s&earch…
de_at: &Extra-Suchoptionen…

source: &View and edit engine options…
de_at: Engine-Optionen &bearbeiten…

source: &Configure navigation with double-click in tab report…
de_at: Navigation per Doppelklick im Dateireiterbericht &konfigurieren…

source: Source encod&ing{}…
de_at: &Quellzeichensatz{}…

source: Show "{}"
de_at: "{}" anzeigen

source: Show "{}" and "{}"
de_at: "{}" und "{}" anzeigen

source: &Save preset as…
de_at: Voreinstellung &speichern unter…

source: Presets [{}]…
de_at: &Voreinstellungen [{}]…

source: Set Results o&ver Source
de_at: Ergebnis über dem Quellenpaneel anzeigen

source: &Save dialog and controls positions...
de_at: Dialog- und Kontrollobjekt-Positionen &speichern...

source: &{}: Restore "{}"
de_at: &{}: "{}" wiederherstellen

source: &Forget
de_at: &Vergessen

source: &Find
de_at: &Suchen

source: Sco&pe
de_at: &Bereich

source: &Browse
de_at: Durchsuchen

source: &Depth
de_at: &Tiefe

source: Pre&sets
de_at: Vorein&stellungen

source: &Help…
de_at: &Hilfe…

source: *&Find what:
de_at: *Suchen &nach:

source: &Replace with:
de_at: E&rsetzen durch:

source: *&In files:
de_at: &In Dateien:

source: Not in files:
de_at: Nicht in Dateien:

source: *I&n folder:
de_at: In &Verzeichnis:

source: &Current
de_at: A&ktuell

source: For s&earch…
de_at: Für die S&uche…

source: Sen&d
de_at: Sen&den

source: t&o…
de_at: an…

source: Re&place
de_at: Erse&tzen

source: Send the report to the address
de_at: Senden Sie den Bericht an die Adresse

source: or post it on
de_at: oder posten Sie ihn auf

source: Close
de_at: Schließen

source: &Save
de_at: &Speichern

source: Apply the fittings to controls of all dialogs.Ctrl+Click - Show data to mail report.
de_at: Justierungen auf Kontrollobjekte aller Dialoge anwenden. Strg+Klick - Daten anzeigen, um den Bericht zu mailen.

source: Adjust vertical alignments
de_at: Senkrechte Ausrichtung justieren

source: Win only: Encode operand according to the ANSI codepage (CP_ACP)
de_at: Nur Win: Operand kodieren laut ANSI-Codepage (CP_ACP)

source: Russian
de_at: Russisch

source: Bulgarian, Belarusian, Macedonian, Russian, Serbian
de_at: Bulgarisch, Belarusisch, Makedonisch, Russisch, Serbisch

source: English
de_at: Englisch

source: Hebrew
de_at: Hebräisch

source: Western Europe
de_at: Westeuropäisch

source: Greek
de_at: Griechisch

source: Baltic languages
de_at: Baltische Sprachen

source: Central and Eastern Europe
de_at: Mittel- und Osteuropäisch

source: Turkish
de_at: Türkisch

source: Portuguese
de_at: Portugisisch

source: Icelandic
de_at: Isländisch

source: Canadian
de_at: Kanadisch

source: Danish, Norwegian
de_at: Dänisch, Norwegisch

source: Win only: Windows UTF-8 (CP_UTF8)
de_at: Nur Win: Windows-UTF-8 (CP_UTF8)

source: West Europe
de_at: Westeuropäisch

source: Esperanto, Maltese
de_at: Esperanto, Maltesisch

source: Nordic languages
de_at: Nordische Sprachen

source: Celtic languages
de_at: Keltische Sprachen

source: South-Eastern Europe
de_at: Südosteuropa

source: Ukrainian
de_at: Ukrainisch

source: Kazakh
de_at: Kasachisch

source: all languages
de_at: Alle Sprachen
