Repository: CudaText-addons/CudaText-translations
Catalog: translation.*/langpy/*/LC_MESSAGES/cuda_find_*_files4.po
Languages: de_at, ru_ru

source: Some of the search parameters slightly decrease the search speed. Others reduce the speed dramatically. To perform optimal search, you need to consider these notes. 1. The parameters .* {reex} aA {case} "w" {word} do not reduce the speed at all. 2. Using non-trivial setttings of "Sort collected files" or "Age of files" does not reduce the speed, in practice. 3. Appending context lines to Results ("-?+?") slightly decrease the speed. 4. Multi-line pattern ("+") markedly decrease the speed. 5. Inappropriate "Encoding plan" can greatly reduce the speed if too many files need to be read. 6. The slowest search (the slowdown in dozens of times) occurs if - any of "Syntax elements" is turned on, - option "Show lexer path for all fragments" is turned on, - lexer path filter is included in the "{incl}" or "{excl}" fields, - styles are copied from disk file source lines to Results (search in tabs is also slowed but not too much). 7. If engine option "copy_styles" is on and Results has a lot of lines then value of engine option "copy_styles_max_lines" is important. Extra time is directly proportional to the value of the option. So default value 100 (coloring only the first 100 lines) is one of compromise values. ———————————————————————————————————————————————————————————————————————————————————————————— Special cases. If pattern is regular expresion (".*" is checked) then it can be indirectly multi-line. So in this case, to avoid guessing, plugin sees single-line or multi-line state, to detect which search is needed. If pattern includes "|" or "&" (options "any_all_parts" is on) then plugin sees newline in pattern ("§" for single-line state) to detect which search is needed: no newline - search into each line separately, with newline - search in whole file. Huge files can also be involved in the search. For optimal memory usage you need: - Turn off the appending context lines ("-N+M"). - Turn off the multi-line pattern ("+") and remove newline character "§". - Turn off all "Syntax elements". - Turn off "Show lexer path for all fragments". - Ensure no lexer path filters are used. - Turn off engine option "copy_styles". Hint. Start "Fast search" (Shift+F2) to ignore all these options (except lexer path filters) without turn them off. Also see engine options - skip_file_size_more(Kb), - dont_show_file_size_more(Kb).
ru_ru: Некоторые параметры поиска дают небольшое торможение. Есть такие, которые замедляют поиск очень значительно. Чтобы получить оптимальные и по содержимому, и по времени результаты, учитывайте следующие замечания. 1. Параметры .* {reex} aA {case} "w" {word} не влияют на скорость поиска. 2. При использовании опций "Сортировать найденные файлы" или "Возраст файлов" замедление будет почти не заметно. 3. Дополнение Результатов соседними строками ("-?+?") дает небольшую задержку. 4. Поиск многострочного шаблона ("+") так же будет с небольшой задержкой. 5. Неточно настроенный "План кодировок" может сильно замедлить поиск, если нужно будет прочитать много файлов. 6. Значительное замедление (время увеличивается в десятки раз) происходит, если - включена любая из опций "Синтаксические элементы", - включена опция "Показывать лексер-пути для всех фрагментов", - в полях "{incl}" или "{excl}" есть фильтры по лексер-путям, - копируются стили из исходных файлов в Результаты (при поиске по табам замедление есть, но незначительное). 7. Так как копирование стилей (глубокая опция "copy_styles") выполняется долго, есть дополнительная глубокая опция "copy_styles_max_lines", которая останавливает это копирование, начиная с указанной строки. Умолчательное значение 100 - это компромис между пользой от копирования стилей и потерями времени. ———————————————————————————————————————————————————————————————————————————————————————————— Особые случаи. Если ищется регулярное выражение (включена ".*"), то оно может неявно содержать многострочный шаблон. Чтобы избежать ошибок при угадывании, плагин полагается не на текст шаблона, а на состояние поля с шаблоном. Если поле многострочное, то будет выполняться многострочный замедленный поиск. Если шаблон содержит "|" или "&" (выключена ".*", включена глубокая опция "any_all_parts"), то плагин анализирует шаблон - ищет разрывы строк ("§" в однострочном поле): нет разрывов - выполняется быстрый поиск по отдельным строкам, есть разрывы - выполняется замедленный поиск по всему тексту. Можно искать в больших и даже огромных файлах. Для оптимального по памяти поиска нужно: - Выключить добавление соседних строк ("-N+M"). - Выключить многострочный шаблон ("+"), а также удалить из шаблона "§". - Выключить все "Синтаксические элементы". - Выключить "Показывать лексер-пути для всех фрагментов". - Удалить из полей "{incl}" и "{excl}" все фильтры по лексер-путям. - Выключить глубокую опцию "copy_styles". Подсказка. Команда "Быстрый поиск" (Shift+F2) игнорирует все эти опции (кроме фильтров по лексер-путям). См. также глубокие опции - skip_file_size_more(Kb), - dont_show_file_size_more(Kb).

source: DLG_HELP_TRICKS
ru_ru: Как выполнить замены в нескольких файлах? Используете плагин "Find in Files". Этот плагин будет поддерживаться в будущем. В нем есть почти все те же поисковые параметры, за исключением - многострочного шаблона, - фильтров "Синтаксические элементы", - "Плана кодировок" (частично), - фильтров по лексер-путям. ———————————————————————————————————————————————————————————————————————————————————————————— Shift+F2 запускает "быстрый" поиск, который игнорирует замедляющие параметры: - "Добавление соседних строк", - "Синтаксические элементы", - "Показывать лексер-пути для всех фрагментов", - "copy_styles" (глубокая опция). ———————————————————————————————————————————————————————————————————————————————————————————— Удерживайте Shift при клике на ".*" ("Регулярное выражение"), чтобы переключить опцию и еще выполнить [раз]экранирование символов в шаблоне. Это позволит получить такие же Результаты при новом значении опции ".*". ———————————————————————————————————————————————————————————————————————————————————————————— Если добавить в поле "{excl}" строку " /. " то стартовая папка(и) не будет участвовать в поиске. ———————————————————————————————————————————————————————————————————————————————————————————— В поле "{fold}" можно указать несколько стартовых папок. Плагин проверит, что никакие две из них не вложены друг в друга. Можно совмещать поиск по папкам и по табам, то есть указывать и папку(и), и {tabs}. ———————————————————————————————————————————————————————————————————————————————————————————— Строка \§ в шаблоне указывает, что нужно искать символ §. Замечание. Многострочное поле показывает шаблон с дополнительной пустой строкой в конце - это будет исправлено в будущем. ———————————————————————————————————————————————————————————————————————————————————————————— Хоткеи Ctrl+1, ..., Ctrl+9 применяют пресеты №1, ..., №9. А еще пресеты могут хранить значения отдельных (или нескольких) опций. Это дает возможность организовать быстрое (без меню) включение/выключение чего-нибудь. Пример. Создадим пресет №1, в котором оставим только одну сохраняемую опцию [x]3 ' ' (нет Дополнительных опций поиска). Создадим пресет №2, в котором оставим только одну сохраняемую опцию [x]3 '?/**/?' ("Вне комментариев"). Теперь можно через Ctrl+1 быстро выключать доп. опции поиска. А через Ctrl+2 быстро включать "Вне комментариев". ———————————————————————————————————————————————————————————————————————————————————————————— Можно использовать макросы во всех редактируемых полях. Например, "~ {{t}}" будет перед поиском заменяться на "~ {tabs}". Чтобы искать выражение в фигурных скобках, такое как "{{t}}", добавьте обратные слеши "\{{t\}}" (достаточно одного "\{{t}}", если нет окружающих фигурных скобок). Глубокая опция "use_selection_on_start" позволяет при вызове диалога заполнять поле с шаблоном выделенным в табе текстом. Для нее есть замена через макрос {{ed:SelectedText}}. Макрос позволяет гибко применять выделенный текст, например, не только при начальном поиске. Макрос {{ed:CurrentWord}} позволяет добавить в шаблон часть текста из таба, даже если нем нет выделения. ———————————————————————————————————————————————————————————————————————————————————————————— Если поиск завершился и вы не можете закрыть диалог обычным способом (появляется запрос "Остановить?") то удерживайте Shift и кликните по "x" титуле диалога.

source: How to replace found fragments in many files? Use plugin "Find in Files". It is not died and will be supported permanently. The plugin has almost all search options of "Find in Files 4". There are not - multi-line pattern, - "Syntax elements" filters, - "Encoding plan" (partially), - "Lexer path" filter. ———————————————————————————————————————————————————————————————————————————————————————————— Shift+F2 starts the single search, which ignores slowing down options: - "Extra context lines", - "Syntax elements", - "Show lexer path for all fragments", - "copy_styles" (engine). ———————————————————————————————————————————————————————————————————————————————————————————— Hold Shift-key when clicking ".*" ("Regular Expression") to toggle the option and also escape/unescape all non-word characters in the pattern. It is guaranteed that search results will not change because of that. ———————————————————————————————————————————————————————————————————————————————————————————— If field "{excl}" contains " /. " then the root folder(s) will be skipped. ———————————————————————————————————————————————————————————————————————————————————————————— The field "{fold}" can contain many folders to search. Folder names must be independent, ie not included into each other. The field can also contains both folder mask(s) and {tabs}. ———————————————————————————————————————————————————————————————————————————————————————————— Use \§ to find the character §. Note. Multi-line control shows a pattern with extra newline (known bug). So if pattern ends with a newline, this newline will be stripped from actual search string. ———————————————————————————————————————————————————————————————————————————————————————————— Hotkeys Ctrl+1, ..., Ctrl+9 apply presets #1, ..., #9. Preset can store need options values. So you can use presets to quickly turn on/off the single option instead of using the menu. Example. Create preset #1 with only check on [x]3 ' ' (No extra search options). Create preset #2 with only check on [x]3 '?/**/?' ("Syntax elements/Outside of comments"). Use Ctrl+1 to quickly clear extra search options without changing others search settings. Use Ctrl+2 to quickly set only "Outside of comments". ———————————————————————————————————————————————————————————————————————————————————————————— You can use macros in any editable fields. For ex, "~ {{t}}" will be auto-replaced to "~ {tabs}". To use the expression with brackets like "{{t}}", escape brackets with backslashes like "\{{t\}}" (or like "\{{t}}", if field doesn't have the outer bracket pair). Engine option "use_selection_on_start" uses selected text from document for the field "Find what". Instead of this option, you can use macro variable {{ed:SelectedText}}. This way you can use selected text many times, not only at start. The macro {{ed:CurrentWord}} allows to use part of document text without selection at all. ———————————————————————————————————————————————————————————————————————————————————————————— If search is finished and you cannot close dialog in usual way ("Stop?" message appears) then hold Shift and click on "x" in titlebar.
ru_ru: Как выполнить замены в нескольких файлах? Используете плагин "Find in Files". Этот плагин будет поддерживаться в будущем. В нем есть почти все те же поисковые параметры, за исключением - многострочного шаблона, - фильтров "Синтаксические элементы", - "Плана кодировок" (частично), - фильтров по лексер-путям. ———————————————————————————————————————————————————————————————————————————————————————————— Shift+F2 запускает "быстрый" поиск, который игнорирует замедляющие параметры: - "Добавление соседних строк", - "Синтаксические элементы", - "Показывать лексер-пути для всех фрагментов", - "copy_styles" (глубокая опция). ———————————————————————————————————————————————————————————————————————————————————————————— Удерживайте Shift при клике на ".*" ("Регулярное выражение"), чтобы переключить опцию и еще выполнить [раз]экранирование символов в шаблоне. Это позволит получить такие же Результаты при новом значении опции ".*". ———————————————————————————————————————————————————————————————————————————————————————————— Если добавить в поле "{excl}" строку " /. " то стартовая папка(и) не будет участвовать в поиске. ———————————————————————————————————————————————————————————————————————————————————————————— В поле "{fold}" можно указать несколько стартовых папок. Плагин проверит, что никакие две из них не вложены друг в друга. Можно совмещать поиск по папкам и по табам, то есть указывать и папку(и), и {tabs}. ———————————————————————————————————————————————————————————————————————————————————————————— Строка \§ в шаблоне указывает, что нужно искать символ §. Замечание. Многострочное поле показывает шаблон с дополнительной пустой строкой в конце - это будет исправлено в будущем. ———————————————————————————————————————————————————————————————————————————————————————————— Хоткеи Ctrl+1, ..., Ctrl+9 применяют пресеты №1, ..., №9. А еще пресеты могут хранить значения отдельных (или нескольких) опций. Это дает возможность организовать быстрое (без меню) включение/выключение чего-нибудь. Пример. Создадим пресет №1, в котором оставим только одну сохраняемую опцию [x]3 ' ' (нет Дополнительных опций поиска). Создадим пресет №2, в котором оставим только одну сохраняемую опцию [x]3 '?/**/?' ("Вне комментариев"). Теперь можно через Ctrl+1 быстро выключать доп. опции поиска. А через Ctrl+2 быстро включать "Вне комментариев". ———————————————————————————————————————————————————————————————————————————————————————————— Можно использовать макросы во всех редактируемых полях. Например, "~ {{t}}" будет перед поиском заменяться на "~ {tabs}". Чтобы искать выражение в фигурных скобках, такое как "{{t}}", добавьте обратные слеши "\{{t\}}" (достаточно одного "\{{t}}", если нет окружающих фигурных скобок). Глубокая опция "use_selection_on_start" позволяет при вызове диалога заполнять поле с шаблоном выделенным в табе текстом. Для нее есть замена через макрос {{ed:SelectedText}}. Макрос позволяет гибко применять выделенный текст, например, не только при начальном поиске. Макрос {{ed:CurrentWord}} позволяет добавить в шаблон часть текста из таба, даже если нем нет выделения. ———————————————————————————————————————————————————————————————————————————————————————————— Если поиск завершился и вы не можете закрыть диалог обычным способом (появляется запрос "Остановить?") то удерживайте Shift и кликните по "x" титуле диалога.
