Repository: CudaText-addons/CudaText-translations
Catalog: translation.*/langpy/*/LC_MESSAGES/cuda_find_*_files4.po
Languages: de_at, ru_ru

source: String to find (pattern) can be multi-line. Button "+" sets single-line or multi-line control. In single-line control the newlines are shown as §. ———————————————————————————————————————————————————————————————————————————————————————————— Some search options can be changed only via menu. · Sort collected files before reading text. · Age of files. · Skip hidden/binary files. · Filter by "Syntax elements" (comments or literal strings). · Encoding plan Warning! Be careful with filtering "Syntax elements" in long search. The filters significantly slow down the search. There is infobar to the left of "Find" button. The infobar shows not trivial values of "{OTH4FND}". ↓↓ Start with the newest files. ↑↑ Start with the oldest files. <5h Skip file older than 5 hours. <4d Skip file older than 4 days. <3w Skip file older than 3 weeks. <2m Skip file older than 2 months. <1y Skip file older than 1 year. -h Skip hidden files. -b Skip binary files. /*?*/ Search only inside comments. ?/**/? Search only outside of comments. "?" Search only inside literal strings. ?""? Search only outside of literal strings. /*?*/ "?" Search only inside comments OR literal strings. ?/**/? ?""? Search only outside of comments AND literal strings. Also infobar shows other settings: <>> Show lexer path for all fragments. (2:cp866) Encodings masks. utf8 First step encoding from "Encoding plan". Right-click on the infobar shows local menu with "{OTH4FND}". Double-click on the infobar clears all values except encoding. ———————————————————————————————————————————————————————————————————————————————————————————— Set special value "{tabs}" for field "{fold}" to search in tabs (opened documents). Fields "{incl}" and "{excl}" will be used to filter tab titles, in this case. To search in all tabs fill "{incl}" with "*". See also: Items of submenu "Scope". Hotkey Ctrl+Shift+U. ———————————————————————————————————————————————————————————————————————————————————————————— Values in fields "{incl}" and "{excl}" can contain ? for any single char, * for any substring (may be empty), [seq] any character in seq, [!seq] any character not in seq. Double-quote value, which needs space char. Note: * matches all names, *.* doesn't match all. Also the values can filter subfolder names if they start with "/". Example. {incl:12}: /a* *.txt {excl:12}: /ab* {fold:12}: c:/root Depth : All Search will consider all *.txt files in folder c:/root and in all subfolders a* except ab*. Also the values can filter lexer path if they are embraced with "[:" and ":]". The filter is path-like string with elements > path separator. Ex: "a>b>c" - node "c" is subnode of "b" and "b" is subnode of "a". >> recursive descent. Ex: "a>>c" - node "c" appears in branch "a". word name of a node. *word partial name of a node. word* partial name of a node. Blanks around all "<" are not important. So "a>>b>c" and "a > > b > c" are same. Lexer path is matched with a filter if some start segments of path are compatible with all segments of the filter. Path "aa>bb>cc>dd" is matched with filters "aa" "*a" "*>b*" ">>cc" ">>cc>*d" and isnot matched with "bb" "*>b" ">>c>dd" Example. {incl:12}: *.py [:def main:] {excl:12}: [:def main>>class*:] {fold:12}: <tabs> Search will consider all "*.py" open files and will search in module function "main" except searching in all classes defined inside the function. Warning! Be careful with filtering lexer path in long search. The filters significantly slow down the search. ———————————————————————————————————————————————————————————————————————————————————————————— ".*" - Option "Regular Expression". It allows to use in the field "{find}" such special symbols: . any character \d digit character (0..9) \w word-like character (digits, letters, "_") See engine option "re_verbose" to use complex reg-exp. See full documentation on the page docs.python.org/3/library/re.html If "Regular Expression" option is off, pattern still can supports some special symbols: | to separate the pattern to parts to find any of them & to separate the pattern to parts to find all of them See engine option "any_all_parts", how to turn those special symbols on/off. Symbols "|" are applied first, and "&" symbols are applied next (to make more parts between "|" symbols, if "|" is present). To include symbols as is, escape them with a backslash: "\|", "\&". Example. Find: abc|xyz Found: "abc cba", "zyx xyz", "_abc_xyz_" Find: abc&xyz Found: "abc xyz", "_xyz_abc_" Note. Option "w" (whole word) applies to all parts, after splitting by "|" and "&". If any of final part has a non-word character, "w" option is ignored. ———————————————————————————————————————————————————————————————————————————————————————————— Long-term searches can be interrupted by ESC.
ru_ru: Строка для поиска (шаблон) может быть многострочной. Кнопка "+" переключает поле для шаблона из однострочного в многострочный и обратно. В однострочном поле разрывы строк отображаются как §. ———————————————————————————————————————————————————————————————————————————————————————————— Некоторые опции поиска доступны через меню. · Сортировка файлов по дате модификации. · Пропуск старых файлов. · Пропуск скрытых/двоичных файлы. · Фильтры по "Синтаксическим элементам" (комментарии или литеральные строки). · План применения кодировок Внимание! Нужна осторожность при настройке фильтров "Синтаксические элементы". Эти фильтры значительно замедляют поиск. Текущие нетривиальные настройки поиска отображаются в инфобаре (левее кнопки "Поиск"). ↓↓ Искать, начиная с новейших файлов. ↑↑ Искать, начиная с старейших файлов. <4д Пропускать файлы старше 4 дней. <3нед Пропускать файлы старше 3 недель. <2мес Пропускать файлы старше 2 месяцев. <1г Пропускать файлы старше 1 года. -h Пропускать скрытые файлы. -b Пропускать двоичные файлы. /*?*/ Искать только в комментариях. ?/**/? Искать только вне комментариев. "?" Искать только в литеральных строках. ?""? Искать только вне литеральных строк. /*?*/ "?" Искать только в комментариях ИЛИ в литеральных строках. ?/**/? ?""? Искать только вне комментариев И вне литеральных строк. Кроме того инфобар показывает другие настройки: <>> Добавлять лексер-пути для всех найденных фрагментов. (2:cp866) Какие кодировки заданы масками файлов. utf8 Кодировка первого шага из "Плана кодировок". Клик ПКМ на инфобаре показывает локальное меню "{OTH4FND}". Двойной клик на инфобаре сбрасывает настройки поиска. ———————————————————————————————————————————————————————————————————————————————————————————— Строка "{tabs}" в поле "{fold}" позволяет искать по табам (открытым документам). В этом случае в полях "{incl}" и "{excl}" задаются фильтры на имена табов. Для поиска по всем табам в поле "{incl}" задайте "*". См. также: Команды из подменю "Место поиска". Хоткей Ctrl+Shift+U. ———————————————————————————————————————————————————————————————————————————————————————————— В полях "{incl}" и "{excl}" могут применяться следующие специальные строки ? для обозначения любого символа, * для обозначения любой подстроки (может быть даже пустой), [seq] любой символ из перечисленных в seq, [!seq] любой символ, кроме перечисленных в seq. Двойные кавычки позволяют задать значение, содержащее пробел(ы). Замечание: * задает все имена файлов, *.* задает не все имена файлов (только с точкой внутри). Еще в этих полях могут указываться имена подпапок. Для этого имя должно начинаться с "/". Пример. {incl:12}: /a* *.txt {excl:12}: /ab* {fold:12}: c:/root Глубина : Все подпапки Поиск будет идти в файлах "*.txt" из папки c:/root во всех ее подпапках a* кроме ab*. Еще в этих полях могут быть фильтры на лексер-пути. Каждый такой фильтр окружен "[:" и ":]". Тело фильтра - это строка похожая на путь. Элементы фильтра: > разделитель узлов пути. Пример: "a>b>c" - узел "c" лежит в "b", "b" лежит в "a". >> глубокое вхождение. Пример: "a>>c" - узел "c" лежит в ветке "a". word имя узла. *word частичное имя узла. word* частичное имя узла. Пробелы вокруг ">" игнорируются. Поэтому "a>>b>c" и "a > > b > c" действуют одинаково. Лексер-путь очередного фрагмента подходит для фильтра, если его начальные сегменты совпадают со всеми сегментами фильтра. Например, путь "aa>bb>cc>dd" подходит для фильтров "aa" "*a" "*>b*" ">>cc" ">>cc>*d" и не подходит для фильтров "bb" "*>b" ">>c>dd" Пример. {incl:12}: *.py [:def main:] {excl:12}: [:def main>>class*:] {fold:12}: <tabs> Поиск будет идти в открытых файлах "*.py" и будет искать только внутри глобальной функции "main", но не в классах, определенных внутри нее. Внимание! Нужна осторожность при использовании фильтров по лексер-путям. Эти фильтры значительно замедляют поиск. ———————————————————————————————————————————————————————————————————————————————————————————— ".*" - опция "Регулярное выражение". Она позволяет применять в поле "{find}" специальные символы. В частности, такие: . любой символ \d цифра (0..9) \w символ слова (цифра, буква, "_") См. глубокая опция "re_verbose" для работы со сложными рег. выражениями. См. полную документацию о применяемой версии рег. выражений (по-английски) docs.python.org/3/library/re.html Если опция ".*" выключена, шаблон может содержать следующие специальные символы: | деление шаблона на части для поиска одной из них & деление шаблона на части для поиска их всех См. глубокую опцию "any_all_parts", которая позволяет включить это поведение. Символы "|" применяются первыми, а "&" - вторыми. Чтобы искать сами спец. символы, дополните их обратными слешами: "\|", "\&". Пример. Искать: abc|xyz Найдутся: "abc cba", "zyx xyz", "_abc_xyz_" Искать: abc&xyz Найдутся: "abc xyz", "_xyz_abc_" Замечание. Опция "w" (полное слово) относится к каждой из частей, на которые "|" и "&" поделят шаблон. Если одна из этих частей будет содержать символы, не встречающиеся в словах, то опция "w" будет игнорироваться целиком. ———————————————————————————————————————————————————————————————————————————————————————————— Долгий поиск можно прервать с помощью ESC.

source: DLG_HELP_RESULTS
ru_ru: Только следующие опции "-N+M" (добавлять строки над/под) "Показывать лексер-пути для всех фрагментов" нужно задавать до начала поиска. Остальные опции сразу меняют вид Результатов. Опции для Результатов: ┌────────────────────────────────────┬──────────────────────────────────────────────────┐ │ Option │ Comment │ ╞════════════════════════════════════╪══════════════════════════════════════════════════╡ │ "-N/+M" (добавлять строки над/под) │ Кнопка "-N+M" включает/выключает опцию. │ │ │ При включении показывается диалог для │ │ │ редактирования чисел "до" и "после". │ ├────────────────────────────────────┼──────────────────────────────────────────────────┤ │ Показывать относительные пути │ Переключает вид Результатов между │ │ │ <c:/dir1/search-root/dir2>: #NN │ │ │ <c:/dir1/search-root/dir2/filename.ext>: #NN │ │ │ и │ │ │ <dir2>: #NN │ │ │ <dir2/filename.ext>: #NN │ ├────────────────────────────────────┼──────────────────────────────────────────────────┤ │ Показывать время модификации │ Если имена файлов располагаются в отдельных │ │ │ строках (тип дерева не "<path:r>:line"), то │ │ │ вид Результатов переключается между │ │ │ <...filename.ext>: #NN │ │ │ и │ │ │ <...filename.ext (1999.12.31 23:59)>: #NN │ ├────────────────────────────────────┼──────────────────────────────────────────────────┤ │ Тип дерева Результатов │ Вся информация о каждом найденном фрагменте │ │ <path:r>:line │ помещается в одну строку. │ │ │ Пример │ │ │ <dir1/dir2/filename1.ext:12>: строка фрагмента │ │ │ <dir1/dir3/filename2.ext:21>: строка фрагмента │ ├────────────────────────────────────┼──────────────────────────────────────────────────┤ │ Тип дерева Результатов │ Путь и имя каждого файла в отдельной строке. │ │ <path>#N/<r>:line │ Пример │ │ │ <dir1/dir2/filename1.ext>: #1 │ │ │ <12>: строка фрагмента │ │ │ <dir1/dir3/filename2.ext>: #1 │ │ │ <21>: строка фрагмента │ ├────────────────────────────────────┼──────────────────────────────────────────────────┤ │ Тип дерева Результатов │ Путь и имя каждой папки в отдельной строке. │ │ <dir>#N/<file:r>:line │ Пример │ │ │ <dir1/dir2>: #1 │ │ │ <filename1.ext:12>: строка фрагмента │ │ │ <dir1/dir3>: #1 │ │ │ <filename2.ext:21>: строка фрагмента │ ├────────────────────────────────────┼──────────────────────────────────────────────────┤ │ Показывать лексер-пути для всех │ Результаты дополнены строками о лексер-путях. │ │ фрагментов │ Пример │ │ │ <filename.ext>: #1 │ │ │ < >: path > to > fragment │ │ │ <12>: строка фрагмента │ ├────────────────────────────────────┼──────────────────────────────────────────────────┤ │ Добавлять лексер-путь в статусбар │ При перемещении каретки в Результатах (руками и │ │ │ командами "К след/пред найденному фрагменту"), │ │ │ в статусбаре всегда показывается путь к файлу. │ │ │ Эта опция позволяет дополнять его лексер-путем. │ └────────────────────────────────────┴──────────────────────────────────────────────────┘ Можно изменить маркировку найденных фрагментов через диалог "Глубокие настройки" (Ctrl+E). См. "mark_style" в секции "Результаты". При поиске по сортированным файлам вид Результатов не всегда следует указанному "типу", так как файлы из разных папок могут оказаться рядом, и значит показывать "по папкам" невозможно. Для типа "<path:r>: line" последовательность не важна. Для остальных типов строки "про папки" и "про файлы" адаптируются (через слияния папок) так, чтобы показывать корректно. В крайних случаях, возможен и автоматический переход на тип "<path:r>: line".

source: Only the options "-N+M" (with lines above/below) "Show lexer path for all fragments" needs to be set before start of search. All other options immediately change the Results view. Results options: ┌────────────────────────────────────┬──────────────────────────────────────────────────┐ │ Option │ Comment │ ╞════════════════════════════════════╪══════════════════════════════════════════════════╡ │ "-N/+M" (with lines above/below) │ See check-button "-N+M" near the search pattern. │ │ │ Turn option on to show config dialog. │ ├────────────────────────────────────┼──────────────────────────────────────────────────┤ │ Show relative paths │ The option immediately toggles between │ │ │ <c:/dir1/search-root/dir2>: #NN │ │ │ <c:/dir1/search-root/dir2/filename.ext>: #NN │ │ │ and │ │ │ <dir2>: #NN │ │ │ <dir2/filename.ext>: #NN │ ├────────────────────────────────────┼──────────────────────────────────────────────────┤ │ Show modification time │ If files are shown on separate lines │ │ │ (tree format is not "<path:r>:line") │ │ │ the option immediately toggles between │ │ │ <...filename.ext>: #NN │ │ │ and │ │ │ <...filename.ext (1999.12.31 23:59)>: #NN │ ├────────────────────────────────────┼──────────────────────────────────────────────────┤ │ Format for Result tree │ Full info about each fragment in one line. │ │ <path:r>:line │ Example │ │ │ <dir1/dir2/filename1.ext:12>: fragment line │ │ │ <dir1/dir3/filename2.ext:21>: fragment line │ ├────────────────────────────────────┼──────────────────────────────────────────────────┤ │ Format for Result tree │ Separate line per each file. │ │ <path>#N/<r>:line │ Example │ │ │ <dir1/dir2/filename1.ext>: #1 │ │ │ <12>: fragment line │ │ │ <dir1/dir3/filename2.ext>: #1 │ │ │ <21>: fragment line │ ├────────────────────────────────────┼──────────────────────────────────────────────────┤ │ Format for Result tree │ Separate line per each folder with files. │ │ <dir>#N/<file:r>:line │ Example │ │ │ <dir1/dir2>: #1 │ │ │ <filename1.ext:12>: fragment line │ │ │ <dir1/dir3>: #1 │ │ │ <filename2.ext:21>: fragment line │ ├────────────────────────────────────┼──────────────────────────────────────────────────┤ │ Show lexer path for all fragments │ Results include lines with lexer path. │ │ │ Example │ │ │ <filename.ext>: #1 │ │ │ < >: path > to > fragment │ │ │ <12>: fragment line │ ├────────────────────────────────────┼──────────────────────────────────────────────────┤ │ Add lexer path to the statusbar │ When you move caret in Results, or use commands │ │ │ "Go to next/prev found fragment", statusbar │ │ │ shows the path to current fragment’s file. │ │ │ If the option is on, then statusbar shows also │ │ │ the path in the document. │ └────────────────────────────────────┴──────────────────────────────────────────────────┘ To set the mark style of found fragmets, use the engine options dialog (Ctrl+E). See "mark_style" in section "Results". How Results are shown, when files were sorted? Found fragments are always shown by the found order. If tree format is "<path:r>: line", no problems. For other formats content of "folder lines" and "file lines" adapts (via folder merging) to show correct data. In extreme cases format automatically sets to "<path:r>: line".
ru_ru: Только следующие опции "-N+M" (добавлять строки над/под) "Показывать лексер-пути для всех фрагментов" нужно задавать до начала поиска. Остальные опции сразу меняют вид Результатов. Опции для Результатов: ┌────────────────────────────────────┬──────────────────────────────────────────────────┐ │ Option │ Comment │ ╞════════════════════════════════════╪══════════════════════════════════════════════════╡ │ "-N/+M" (добавлять строки над/под) │ Кнопка "-N+M" включает/выключает опцию. │ │ │ При включении показывается диалог для │ │ │ редактирования чисел "до" и "после". │ ├────────────────────────────────────┼──────────────────────────────────────────────────┤ │ Показывать относительные пути │ Переключает вид Результатов между │ │ │ <c:/dir1/search-root/dir2>: #NN │ │ │ <c:/dir1/search-root/dir2/filename.ext>: #NN │ │ │ и │ │ │ <dir2>: #NN │ │ │ <dir2/filename.ext>: #NN │ ├────────────────────────────────────┼──────────────────────────────────────────────────┤ │ Показывать время модификации │ Если имена файлов располагаются в отдельных │ │ │ строках (тип дерева не "<path:r>:line"), то │ │ │ вид Результатов переключается между │ │ │ <...filename.ext>: #NN │ │ │ и │ │ │ <...filename.ext (1999.12.31 23:59)>: #NN │ ├────────────────────────────────────┼──────────────────────────────────────────────────┤ │ Тип дерева Результатов │ Вся информация о каждом найденном фрагменте │ │ <path:r>:line │ помещается в одну строку. │ │ │ Пример │ │ │ <dir1/dir2/filename1.ext:12>: строка фрагмента │ │ │ <dir1/dir3/filename2.ext:21>: строка фрагмента │ ├────────────────────────────────────┼──────────────────────────────────────────────────┤ │ Тип дерева Результатов │ Путь и имя каждого файла в отдельной строке. │ │ <path>#N/<r>:line │ Пример │ │ │ <dir1/dir2/filename1.ext>: #1 │ │ │ <12>: строка фрагмента │ │ │ <dir1/dir3/filename2.ext>: #1 │ │ │ <21>: строка фрагмента │ ├────────────────────────────────────┼──────────────────────────────────────────────────┤ │ Тип дерева Результатов │ Путь и имя каждой папки в отдельной строке. │ │ <dir>#N/<file:r>:line │ Пример │ │ │ <dir1/dir2>: #1 │ │ │ <filename1.ext:12>: строка фрагмента │ │ │ <dir1/dir3>: #1 │ │ │ <filename2.ext:21>: строка фрагмента │ ├────────────────────────────────────┼──────────────────────────────────────────────────┤ │ Показывать лексер-пути для всех │ Результаты дополнены строками о лексер-путях. │ │ фрагментов │ Пример │ │ │ <filename.ext>: #1 │ │ │ < >: path > to > fragment │ │ │ <12>: строка фрагмента │ ├────────────────────────────────────┼──────────────────────────────────────────────────┤ │ Добавлять лексер-путь в статусбар │ При перемещении каретки в Результатах (руками и │ │ │ командами "К след/пред найденному фрагменту"), │ │ │ в статусбаре всегда показывается путь к файлу. │ │ │ Эта опция позволяет дополнять его лексер-путем. │ └────────────────────────────────────┴──────────────────────────────────────────────────┘ Можно изменить маркировку найденных фрагментов через диалог "Глубокие настройки" (Ctrl+E). См. "mark_style" в секции "Результаты". При поиске по сортированным файлам вид Результатов не всегда следует указанному "типу", так как файлы из разных папок могут оказаться рядом, и значит показывать "по папкам" невозможно. Для типа "<path:r>: line" последовательность не важна. Для остальных типов строки "про папки" и "про файлы" адаптируются (через слияния папок) так, чтобы показывать корректно. В крайних случаях, возможен и автоматический переход на тип "<path:r>: line".

source: DLG_HELP_SPEED
ru_ru: Некоторые параметры поиска дают небольшое торможение. Есть такие, которые замедляют поиск очень значительно. Чтобы получить оптимальные и по содержимому, и по времени результаты, учитывайте следующие замечания. 1. Параметры .* {reex} aA {case} "w" {word} не влияют на скорость поиска. 2. При использовании опций "Сортировать найденные файлы" или "Возраст файлов" замедление будет почти не заметно. 3. Дополнение Результатов соседними строками ("-?+?") дает небольшую задержку. 4. Поиск многострочного шаблона ("+") так же будет с небольшой задержкой. 5. Неточно настроенный "План кодировок" может сильно замедлить поиск, если нужно будет прочитать много файлов. 6. Значительное замедление (время увеличивается в десятки раз) происходит, если - включена любая из опций "Синтаксические элементы", - включена опция "Показывать лексер-пути для всех фрагментов", - в полях "{incl}" или "{excl}" есть фильтры по лексер-путям, - копируются стили из исходных файлов в Результаты (при поиске по табам замедление есть, но незначительное). 7. Так как копирование стилей (глубокая опция "copy_styles") выполняется долго, есть дополнительная глубокая опция "copy_styles_max_lines", которая останавливает это копирование, начиная с указанной строки. Умолчательное значение 100 - это компромис между пользой от копирования стилей и потерями времени. ———————————————————————————————————————————————————————————————————————————————————————————— Особые случаи. Если ищется регулярное выражение (включена ".*"), то оно может неявно содержать многострочный шаблон. Чтобы избежать ошибок при угадывании, плагин полагается не на текст шаблона, а на состояние поля с шаблоном. Если поле многострочное, то будет выполняться многострочный замедленный поиск. Если шаблон содержит "|" или "&" (выключена ".*", включена глубокая опция "any_all_parts"), то плагин анализирует шаблон - ищет разрывы строк ("§" в однострочном поле): нет разрывов - выполняется быстрый поиск по отдельным строкам, есть разрывы - выполняется замедленный поиск по всему тексту. Можно искать в больших и даже огромных файлах. Для оптимального по памяти поиска нужно: - Выключить добавление соседних строк ("-N+M"). - Выключить многострочный шаблон ("+"), а также удалить из шаблона "§". - Выключить все "Синтаксические элементы". - Выключить "Показывать лексер-пути для всех фрагментов". - Удалить из полей "{incl}" и "{excl}" все фильтры по лексер-путям. - Выключить глубокую опцию "copy_styles". Подсказка. Команда "Быстрый поиск" (Shift+F2) игнорирует все эти опции (кроме фильтров по лексер-путям). См. также глубокие опции - skip_file_size_more(Kb), - dont_show_file_size_more(Kb).
