Repository: CudaText-addons/CudaText-translations
Catalog: translation.*/langpy/*/LC_MESSAGES/cuda_ext.po
Languages: de_at, ru_ru

source: Align by margin value:
de_at: Ausrichten am Randwert:

source: Joined line with next line
de_at: Zeile mit nächster Zeile verbunden

source: Joined selected lines
de_at: Ausgewählte Zeilen verbunden

source: No duplicate spaces
de_at: Keine doppelten Leerzeichen
ru_ru: Нет двойных пробелов

source: Deleted spaces: {}
de_at: Gelöschte Leerzeichen: {}
ru_ru: Удалено пробелов: {}

source: Margin value:
de_at: Randwert:

source: Incorrect margin value:
de_at: Ungültiger Randwert:

source: Need lexer active
de_at: Brauche einen aktiven Lexer
ru_ru: Требуется выбрать лексер

source: Need lexer with line-comment chars
de_at: Brauche einen Lexer mit Zeilenkommentarzeichen
ru_ru: Требуется лексер, поддерживающий строковые комментарии

source: Current line is not line-comment
de_at: Die aktuelle Zeile ist kein Zeilenkommentar
ru_ru: Текущая строка не внутри строкового комментария

source: Set the margin via "Plugins / Cuda-Ext / Paragraph / Align: Configure..."
de_at: Setzen Sie den Rand via "Plug-ins / Cuda-Erweiterung / Paragraph / Ausrichten: Konfigurieren..."

source: Re-wrap lines
de_at: Zeilen neu umbrechen
ru_ru: Изменить переносы в строках

source: &Margin:
de_at: &Rand:
ru_ru: &Граница:

source: &Comment sign:
de_at: &Kommentarzeichen:
ru_ru: &Символ комментария:

source: &Keep indent
de_at: &Einzug beibehalten
ru_ru: &Сохранять сдвиги

source: Not digit margin
de_at: Kein Randwert

source: Separator char:
de_at: Trennzeichen:

source: Wrong separator char
de_at: Falsches Trennzeichen

source: No selection
de_at: Keine Auswahl

source: Replaced {} line(s)
de_at: {} Zeile(n) ersetzt

source: Command does only work with multi-carets
de_at: Der Befehl funktioniert nur mit Multi-Cursor

source: This command cannot handle selection(s)
de_at: Dieser Befehl kann keine Auswahl(en) behandeln

source: Align comments
de_at: Kommentare ausrichten

source: Minimal allowed column pos:
de_at: Kleinste erlaubte Spaltenposition:

source: Incorrect number(s) entered:
de_at: Ungültige Nummer(n) eingegeben:

source: Aligned comments:
de_at: Ausgerichtete Kommentare:

source: No yet other activated tab
de_at: Noch kein anderer aktivierter Dateireiter
ru_ru: Еще нет ранее активного таба

source: Switcher
de_at: Umschalter
ru_ru: Переключатель табов

source: New position (max={gr_cnt})
de_at: Neue Position (max={gr_cnt})

source: Find tab by title
de_at: Dateireiter nach Titel suchen

source: Cannot arrange tabs with single group
de_at: Kann keine Dateireiter mit Einzelgruppe anordnen

source: Arranged {} tab(s) across {} group(s)
de_at: {} Dateireiter über {} Gruppe(n) hinweg angeordnet

source: What tab number to activate? Input: [group:]number
de_at: Welchen Dateireiter aktivieren? Eingabe: [Gruppe:]Nummer

source: No tab "{}"
de_at: Kein Dateireiter "{}"
ru_ru: Нет таба "{}"

source: No files in group
de_at: Keine Dateien in der Gruppe
ru_ru: Нет файлов в группе

source: Closed {} untitled tab(s)
de_at: {} unbenannte Dateireiter geschlossen

source: Not a paired ui-tab
de_at: Kein paarweiser UI-Dateireiter

source: Paired ui-tab has modified file(s)
de_at: Paarweiser UI-Dateireiter enthält geänderte Datei(en)

source: No items in Code Tree
de_at: Keine Einträge im Syntaxbaum
ru_ru: Нет элементов в Дереве Кода

source: Code Tree symbols
de_at: Syntaxbaumsymbole
ru_ru: Элементы Дерева Кода

source: <Update Code Tree>
de_at: <Syntaxbaum auffrischen>
ru_ru: <Обновить Дерево Кода>

source: <All levels>
de_at: <Alle Ebenen>
ru_ru: <Все уровни>

source: <Only 1 up level>
de_at: <Nur 1 Ebene höher>
ru_ru: <Только 1 верхний уровень>

source: <Only 2 up levels>
de_at: <Nur 2 Ebenen höher>
ru_ru: <Только 2 верхних уровня>

source: <Only 3 up levels>
de_at: <Nur 3 Ebenen höher>
ru_ru: <Только 3 верхних уровня>

source: Search starts on Enter. • A found node after current one will be selected. • All found nodes are remembered and dialog can jump over them by [Shift+]Enter or by menu commands. • If option "O" (wrapped search) is tuned on: - Search continues from the start, when end of the tree is reached - Jumps to previous/next nodes are looped too • Option ".*" (regular expression) allows to use Python reg.ex. See "docs.python.org/3/library/re.html". • Option "w" (whole words) is ignored if entered string contains not a word. • If option "Close on success" (in menu) is tuned on, dialog will close after successful search. • Option "Show full tree path" (in menu) shows in the statusbar the path of the found node (names of all parents). • Command "Restore initial selection" (in menu) restores only first of initial carets.
de_at: Die Suche startet mit [Enter]. • Ein hinter dem aktuellen Knoten gefundener Knoten wird ausgewählt. • Alle gefundenen Knoten werden gemerkt und der Dialog kann sie per (Shift+)Enter oder per Menübefehle durchlaufen. • Wenn Option "O" (Umlaufend suchen) eingeschaltet ist: - Wenn das Baum-Ende erreicht ist, wird vom Baum-Anfang weitergesucht. - Sprünge zu vorigen/nächsten Knoten werden ebenfalls durchlaufen. • Option ".*" (Regulärer Ausdruck) erlaubt die Verwendung von Python regex. Vgl. "docs.python.org/3/library/re.html". • Option "w" (Nur ganzes Wort) wird ignoriert, wenn der eingegebene String kein Wort enthält. • Wenn Option "Bei Erfolg schließen" (im Menü) eingeschaltet ist, wird der Dialog nach erfolgreicher Suche geschlossen. • Option "Vollständigen Baumpfad anzeigen" (im Menü) zeigt in der Statusleiste den Pfad des gefundenen Knotens (die Namen aller Eltern) an. • Der Befehl "Anfangsauswahl wiederherstellen" (im Menü) stellt nur den ersten der anfänglichen Cursor wieder her.
ru_ru: Поиск начинается по Ввод. • Выделяется найденный элемент ниже текущего. • Все найденные фрагменты запоминаются и по ним можно перемещаться с помощью [Shift+]Enter или командами меню. • Если включено "O" (циклический поиск): - Поиск продолжается с начала Дерево после достижения конца. - Переходы следующий/предыдущий тоже выполняются по циклу. • Опция ".*" (регулярное выражение) позволяет применять специальный язык. См. "docs.python.org/3/library/re.html". • Опция "w" (целое слово) игнорируется, если задано не слово. • Если включена опция "Закрывать при успехе" (в меню), диалог сам закрывается после нахождения элемента. • Опция "Показывать путь" (в меню) позволяет показывать путь по Дереву к найденному элементу. • Команда "Восстановить исходное выделение" (Shift+Esc) восстанавливает только первую из кареток.

source: No CodeTree
de_at: Kein Syntaxbaum
ru_ru: Нет Дерева Кода

source: No suitable nodes
de_at: Keine passenden Knoten
ru_ru: Нет подходящих элементов

source: Error
de_at: Fehler

source: &Options
de_at: &Optionen
ru_ru: &Опции

source: Show full tree path
de_at: Vollständigen Baumpfad anzeigen
ru_ru: Показывать путь

source: Close on success
de_at: Bei Erfolg schließen
ru_ru: Закрывать при успехе

source: Restore initial selection and close dialog &=
de_at: Anfangsauswahl wiederherstellen und Dialog schließen &=
ru_ru: Восстановить исходное выделение и закрыть диалог &=

source: Find tree node
de_at: Baumknoten suchen
ru_ru: Поиск в Дереве

source: Wrapped search
de_at: Umlaufend suchen
ru_ru: Циклический поиск

source: Fail. Use only for python file.
de_at: Gescheitert. Nur für eine Python-Datei verwenden.

source: Apply the tunings to controls of all dialogs.
de_at: Die Justierungen auf Kontrollobjekte aller Dialoge anwenden.

source: Tuning text vertical alignment for control pairs
de_at: Senkrechte Textausrichtung für Kontrollobjekt-Paare justieren

source: {} works when no selection
ru_ru: {} работает только без выделения

source: Need update CudaText
ru_ru: Обновите CudaText

source: Text modified. Save it? Yes - Save and rename No - Lost and rename Cancel - Nothing
ru_ru: Текст изменен. Сохранить? Yes - Сохранить и переименовать No - Потерять изменения и переименовать Cancel - Отмена

source: No files in history
ru_ru: Нет файлов в Истории

source: Command is for Windows only.
ru_ru: Команда работает только под Windows.

source: No file to open.
ru_ru: Нет файлов для открытия

source: No tags
ru_ru: Нет тегов

source: Stripping is done. Removed tags: {}
ru_ru: Удаление выполнено. Удалено тегов: {}

source: Stripping is done. Removed comments: {}, removed tags: {}
ru_ru: Удаление выполнено. Удалено комментариев: {}, удалено тегов: {}

source: To find: >{} signs in the left, ENTER for the right
ru_ru: Старт: >{} символов слева, ВВОД справа

source: Left &minimum signs to find: {}...
ru_ru: Минимальное число символов для поиска: {}...

source: Do not hide on &ESC (close dialog)
ru_ru: Не скрывать по &ESC (требуется перевызов)

source: Need update application
ru_ru: Обновите приложение

source: No tab with "{}" in title
ru_ru: Нет таба с "{}" в имени
