Repository: CudaText-addons/CudaText-translations
Catalog: translation.*/langpy/*/LC_MESSAGES/cuda_find_*_files4.po
Languages: de_at, ru_ru

source: Copy styles (color+bold/italic) from source lines to Results. Warning! The setting significantly slows down the search.
de_at: Stile (Farbe+fett/kursiv) von Quellcodezeilen ins Ergebnis kopieren. Warnung! Diese Einstellung verlangsamt die Suche erheblich.
ru_ru: Копировать стили (цвета и жирный/наклонный) для строк исходников в Результатах Внимание! Приводит к значительной задержке поиска.

source: Maximum lines to copy styles from source lines to Results (0 - all). Warning! The big value significantly slows down the search.
de_at: Max. Anzahl Zeilen, um Stile von Quellcodezeilen ins Ergebnis zu kopieren (0 - alle). Warnung! Ein großer Wert verlangsamt die Suche erheblich.
ru_ru: Максимальное число строк, для которых будет выполнено копирование стилей из исходника в Результаты. Внимание! Большое значение приводит к значительной задержке поиска.

source: Show first N fragments while search is in progress (min 10).
de_at: Die ersten N Fragmente während des Suchvorgangs anzeigen (min. 10).
ru_ru: Показывать первые N найденных фрагментов, пока идет поиск (минимум 10).

source: Auto select first found fragment.
de_at: Erstes gefundenes Fragment automatisch auswählen.
ru_ru: Автоматически переходить на первый найденный фрагмент.

source: If N>0, do not show all files, which sizes are bigger than this N (in Kb).
de_at: Wenn N>0, dann keine Datei größer N (KB) anzeigen.

source: Height of dialog grid cell (min 25).
de_at: Höhe der Dialograster-Zelle (min. 25)
ru_ru: Вертикальный отступ между контролами в диалоге (минимум 25).

source: Width of button "=" (min 15).
de_at: Breite des Schalters "=" (min. 15).
ru_ru: Ширина кнопки "=" (минимум 15).

source: Width of button to switch regex/case/words (min 30).
de_at: Breite des Schalters für den Wechsel zw. Regex/Schreibung/Wort (min. 30)
ru_ru: Ширина кнопок ".*"/"aA"/"w" (минимум 30).

source: Minimal width of fields to set files/folders (min 150).
de_at: Minimale Feldbreiten für die Definition von Dateien/Ordnern (min. 150).
ru_ru: Минимальная ширина полей для файлов и папок (минимум 150).

source: Statusbar height.
de_at: Höhe der Statusleiste.
ru_ru: Высота статусбара.

source: Styles of statusbar fields.
de_at: Stile der Statusleistenfelder.
ru_ru: Стили полей статусбара.

source: Sub-dialog "Replace" x-shift
de_at: x-Versatz des "Ersetzen"-Paneels.

source: Sub-dialog "Replace" y-shift
de_at: y-Versatz des "Ersetzen"-Paneels.

source: Dialog title style
de_at: Stil der Dialogüberschrift

source: Full file path of log file (requires app restart).
de_at: Vollständiger Dateipfad der Protokolldatei (erfordert App-Neustart).

source: Logging
de_at: Protokoll

source: Extra search options
de_at: Extra-Suchoptionen
ru_ru: Дополнительные опции поиска

source: Options to view Results
de_at: Optionen für die Ergebnisanzeige
ru_ru: Опции для показа Результатов

source: F3/{u}F3 - next/prev fragment, ^F3/^{u}F3 - next/prev file fragment, Enter|DblClick - open.
de_at: F3/{u}F3 - nächstes/voriges Fragment, ^F3/^{u}F3 - nächstes/voriges Dateifragment, Enter|Doppelklick - Öffnen.

source: Results.
de_at: Ergebnis.
ru_ru: Результаты.

source: Source.
de_at: Quelle.
ru_ru: Исходник.

source: Alt+Down - pattern history
de_at: Alt+Ab - Musterverlauf
ru_ru: Alt+ВНИЗ - история шаблонов

source: Regular expression
de_at: Regulärer Ausdruck
ru_ru: Регулярное выражение

source: Case sensitive
de_at: Groß-/Kleinschreibung
ru_ru: Учет регистра

source: Whole words
de_at: Ganzes Wort
ru_ru: Полное слово

source: Use multi-line input field
de_at: Mehrzeiliges Eingabefeld verwenden
ru_ru: Использовать многострочный ввод

source: Sort picked files by modification time. ↓↓ from newest. ↑↑ from oldest.
de_at: Gesammelte Dateien nach Änderungsdatum sortieren. ↓↓ absteigend. ↑↑ aufsteigend.
ru_ru: Сортировать найденные файлы по дате модификации. ↓↓ начиная с новых. ↑↑ начиная со старых.

source: Fin&d
de_at: &Suchen
ru_ru: Поиск

source: Start search (F2) Shift+Click Start fast search (Shift+F2)
de_at: Suche starten (F2) Shift+Klick Schnellsuche starten (Shift+F2)
ru_ru: Начать поиск (F2) Shift+Click Начать быстрый поиск (Shift+F2)

source: Space-separated file or folder masks. Folder mask starts with "/". Double-quote mask, which needs space char. Use "?" for any character and "*" for any fragment. Note: "*" matches all names, "*.*" doesn't match all.
de_at: Datei- oder Verzeichnismasken (leerzeichengetrennt). Verzeichnismasken beginnen mit Slash "/". Masken mit Leerzeichen unter Anführungszeichen stellen. "?" für jedes Zeichen, "*" für jedes Fragment. Hinweis: "*" findet alle Namen, "*.*" findet nicht alle.
ru_ru: Список масок для файлов или папок (разделитель - пробел). Маски папок начинаются на "/". Двойные кавычки позволяют задать маску с пробелами. Используйте: "?" - любой символ, "*" - любая строка. Важно: "*" все имена файлов, "*.*" только имена с точками.

source: Exclude file[s]/folder[s]
de_at: Datei(en)/Verzeichnis(se) ausschließen
ru_ru: Исключить файл[ы]/папку[и]

source: Always excluded: {} See engine option "always_not_in_files" to change.
de_at: Immer ausgeschlossen: {} Vgl. zum Wechseln die Engine-Option "always_not_in_files".
ru_ru: Всегда исключать: {} См. опцию "always_not_in_files" в глубоких настройках.

source: Start folder(s). Space-separated folders. Double-quote folder, which needs space char. "~" is user home folder. {} or {{t}} to search in tabs. Ctrl+Shift+Up - cut last folder segment.
de_at: Startverzeichnis(se). Leerzeichengetrennte Verzeichnisse. Verzeichnisse mit Leerzeichen unter Anführungszeichen stellen. "~" ist das Benutzer-Stammverzeichnis. {} oder {{t}} für die Suche in Dateireitern. Strg+Shift+Auf - Letztes Verzeichnissegment abschneiden.

source: Depth - how many folder levels to search. Use Ctrl+↑/↓ to change this option.
de_at: Tiefe - Anzahl der Verzeichnisebenen für die Suche. Strg+↑/↓ wechselt diese Option.

source: Click or Ctrl+B Choose folder. Shift+Click or Ctrl+Shift+B Choose file to find in it.
de_at: Klick oder Strg+B Verzeichnis auswählen. Shift+Klick oder Strg+Shift+B Datei zum Durchsuchen auswählen.
ru_ru: Клик или Ctrl+B Выбор папки. Shift+Клик или Ctrl+Shift+B Выбор файла.

source: All a&ges
de_at: &Jedes Alter
ru_ru: Все возрасты

source: Show result line with its adjacent lines (above/below). "-N+M" - N lines above and M lines below. Turn option on to show config dialog.
de_at: Ergebniszeile mit Kontextzeilen (darüber/darunter) anzeigen. "-N+M" - N Zeilen darüber und M Zeilen darunter. Option einschalten, um den Einstellungsdialog einzublenden.
ru_ru: Дополнять результаты строками над/под найденными фрагментами. "-N+M" - N строк над и M строк под. Включите опцию, чтобы вызывать диалог для задания чисел N/M.

source: {OTH4FND}. Use popup menu to change.
de_at: {OTH4FND}. Wechseln via Popup-Menü.
ru_ru: {OTH4FND}. Доступно локальное меню для изменений.

source: &Find:
de_at: Suchen &nach:
ru_ru: Искать:

source: F&iles:
de_at: &Dateien:
ru_ru: Файлы:

source: Skip&:
de_at: Exkl.&:

source: F&rom:
de_at: &Von:
ru_ru: Из:

source: Pattern to find. It can be multi-line. Newline is shown as "§". Use Shift+Enter to append "§" at pattern end. Or switch to multi-line mode ("+") to see/insert natural newlines.
de_at: Suchmuster. Darf mehrzeilig sein. Die Zeilenschaltung wird als "§" angezeigt. Shift+Enter hängt "§" ans Ende des Suchmusters an. Im Mehrzeilenmodus ("+") kann man normale Zeilenschaltungen sehen/einfügen.
ru_ru: Шаблон для поиска. Может быть многострочным. Разрывы строк отображаются как "§". Используйте Shift+ВВОД для добавления "§" в конец шаблона. Или переключитесь в многострочный режим ("+"), чтобы видеть и вводить обычные разрывы строк.

source: To search in tabs
de_at: In Dateireitern zu suchen
ru_ru: Для поиска в табах

source: Folder(s) of the loaded project
de_at: Verzeichnis(se) des geladenen Projekts

source: Full path
de_at: Vollständiger Pfad
ru_ru: Полный путь

source: File folder path
de_at: Dateipfad
ru_ru: Полный путь

source: File name only, without folder path
de_at: Dateiname ohne Pfad
ru_ru: Имя файла без папки

source: File name without extension and path
de_at: Dateiname ohne Typ und Pfad
ru_ru: Имя файла без папки и расширения

source: File extension
de_at: Dateityp
ru_ru: Расширение файла

source: Text of current line
de_at: Text der aktuellen Zeile
ru_ru: Текст текущей строки

source: Selected text
de_at: Ausgewählter Text
ru_ru: Выделенный текст

source: Text of current word
de_at: Text des aktuellen Wortes
ru_ru: Текст текущего слова

source: ┌───────────────────────────────────────┬────────────────────┬────────────────────────────────────┐ │ Command │ Hotkey │ Comment │ ╞═══════════════════════════════════════╪════════════════════╪════════════════════════════════════╡ │ Find │ Alt+D │ │ │ Find │ Enter │ If focus not in controls: │ │ │ │ multi-line Find, Results, Source │ │ Find │ F2 │ │ │ Find as fast as posible │ Shift+F2 │ Skips all slow options │ │ Replace │ F4 │ │ │ Emulate Replace │ Shift+F4 │ Show replace report but no changes │ ├───────────────────────────────────────┼────────────────────┼────────────────────────────────────┤ │ Go to next found fragment │ F3 │ │ │ Go to prev found fragment │ Shift+F3 │ │ │ Go to next file(tab) found fragment │ Ctrl+F3 │ │ │ Go to prev file(tab) found fragment │ Ctrl+Shift+F3 │ │ │ Open found fragment in tab │ Enter │ If focus in Results/Source │ │ Open found fragment and close dialog │ Shift+Enter │ If focus in Results/Source │ │ Copy Results to new tab │ Ctrl+Shift+Enter │ │ ├───────────────────────────────────────┼────────────────────┼────────────────────────────────────┤ │ Put focus to Results │ Ctrl+Enter │ If focus not in Results/Source │ │ Move focus: Results >> Source >> Find │ Tab │ │ │ Move focus: Results << Source << Find │ Shift+Tab │ │ ├───────────────────────────────────────┼────────────────────┼────────────────────────────────────┤ │ Show history of search patterns │ Alt+↓ │ If focus in Find │ │ Loop over all Depth values │ Ctrl+↓/↑ │ │ ├───────────────────────────────────────┼────────────────────┼────────────────────────────────────┤ │ Choose folder │ Ctrl+B │ │ │ Choose file │ Ctrl+Shift+B │ │ │ Use folder of the current file │ Ctrl+U │ │ │ To search in the current tab │ Ctrl+Shift+U │ │ │ To search in the current Source │ F11 │ │ │ To search in the current Source and │ │ │ │ current lexer path │ Shift+F11 │ │ │ Append newline char "§" to "Find" │ Shift+Enter │ If focus in sigle-line Find │ ├───────────────────────────────────────┼────────────────────┼────────────────────────────────────┤ │ Fold/Unfold the caret branch │ Ctrl+= │ If focus in Results │ │ Fold/Unfold all branches │ Ctrl+Shift+= │ By state of the branch under caret │ ├───────────────────────────────────────┼────────────────────┼────────────────────────────────────┤ │ Load preset #1/#2/../#9 │ Ctrl+1/2/../9 │ All presets are available via menu │ │ Create new preset │ Ctrl+S │ │ │ Choose preset to apply │ Alt+S │ │ │ Restore prev/next executed parameters │ Alt+←/→ │ │ ├───────────────────────────────────────┼────────────────────┼────────────────────────────────────┤ │ Append macro-var to current field │ Ctrl+A │ If focus in editable field │ │ Show fields after vars substitution │ Ctrl+Shift+A │ │ ├───────────────────────────────────────┼────────────────────┼────────────────────────────────────┤ │ Expand/Shrink Results height │ Ctrl+Alt+↓/↑ │ │ │ Expand/Shrink dialog height │ Shift+Alt+↓/↑ │ │ │ Expand/Shrink dialog width │ Shift+Alt+→/← │ │ │ Expand/Shrink height of │ │ │ │ multi-line "Find" │ Shift+Ctrl+Alt+↓/↑ │ If multi-line Find is visible │ ├───────────────────────────────────────┼────────────────────┼────────────────────────────────────┤ │ Show engine options │ Ctrl+E │ │ │ Show dialog "Help" │ Ctrl+H │ │ ├───────────────────────────────────────┼────────────────────┼────────────────────────────────────┤ │ Call CudaText's "Find" dialog │ Ctrl+F │ Pattern and search options │ │ Call CudaText's "Replace" dialog │ Ctrl+R │ will be copied │ └───────────────────────────────────────┴────────────────────┴────────────────────────────────────┘
de_at: ┌───────────────────────────────────────────┬──────────────────────┬──────────────────────────────────────┐ │ Befehl │ Tastenkürzel │ Kommentar │ ╞═══════════════════════════════════════════╪══════════════════════╪══════════════════════════════════════╡ │ Suchen │ Alt+D │ │ │ Suchen │ Enter │ Wenn Fokus nicht auf den Feldern: │ │ │ │ mehrzeilige Suche, Ergebnis, Quelle │ │ Suchen │ F2 │ │ │ Suchen so schnell als möglich │ Shift+F2 │ Ignoriert die langsamen Optionen. │ │ Ersetzen │ F4 │ │ │ Ersetzen simulieren │ Shift+F4 │ Nur Bericht anzeigen, nichts ersetzen│ ├───────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ Geh zum nächsten gefundenen Fragment │ F3 │ │ │ Geh zum vorigen gefundenen Fragment │ Shift+F3 │ │ │ Geh zum nächsten Datei(reiter)-Fragment │ Strg+F3 │ │ │ Geh zum vorigen Datei(reiter)-Fragment │ Strg+Shift+F3 │ │ │ Gefundenes Fragment in Reiter öffnen │ Enter │ Wenn Fokus auf Ergebnis/Quelle. │ │ Gefundenes Fragment in Reiter öffnen und │ Shift+Enter │ Wenn Fokus auf Ergebnis/Quelle. │ │ Dialog schließen │ │ │ │ Ergebnis in neuen Dateireiter kopieren │ Strg+Shift+Enter │ │ ├───────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ Fokus aufs Ergebnispaneel legen │ Strg+Enter │ Wenn Fokus nicht auf Ergebnis/Quelle.│ │ Fokuswechsel: Ergebnis >> Quelle >> Suche │ Tab │ │ │ Fokuswechsel: Ergebnis << Quelle << Suche │ Shift+Тab │ │ ├───────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ Verlauf der Suchmuster anzeigen │ Alt+↓ │ Wenn Fokus auf "Suchen nach"-Feld. │ │ Alle Werte für Tiefe durchlaufen │ Strg+↓/↑ │ │ ├───────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ Verzeichnis auswählen │ Strg+B │ │ │ Datei auswählen │ Strg+Shift+B │ │ │ Verzeichnis der aktuellen Datei verwenden │ Ctrl+U │ │ │ Im aktuellen Dateireiter suchen │ Strg+Shift+U │ │ │ In aktueller Quelle suchen │ F11 │ │ │ In aktueller Quelle und im aktuellen │ │ │ │ Lexerpfad suchen │ Shift+F11 │ │ │ Zeichenschaltung "§" an "Suchen nach" │ Shift+Enter │ Wenn Fokus auf einzeiligem │ │ anhängen │ │ "Suchen nach"-Feld. │ ├───────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ Cursor-Zweig ein-/ausklappen │ Strg+= │ Wenn Fokus auf Ergebnisanzeige. │ │ Alle Zweige ein-/ausklappen │ Strg+Shift+= │ Gemäß Status des Cursor-Zweigs. │ ├───────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ Voreinstellung #1/#2/../#9 laden │ Strg+1/2/../9 │ Alle via Menü verfügbaren Voreinst. │ │ Neue Voreinstellung erstellen │ Strg+S │ │ │ Voreinstellung zum Anwenden auswählen │ Alt+S │ │ │ Vorher/Nachher ausgeführte Parameter │ Alt+←/→ │ │ │ wiederherstellen │ │ │ ├───────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ Makrovar an aktuelles Feld anhängen │ Strg+A │ Wenn Fokus auf dem Eingabefeld liegt.│ │ Felder nach Variablenersetzung anzeigen │ Strg+Shift+A │ │ ├───────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ Ergebnishöhe vergrößern/verkleinern │ Strg+Alt+↓/↑ │ │ │ Dialoghöhe vergrößern/verkleinern │ Shift+Alt+↓/↑ │ │ │ Dialogbreite vergrößern/verkleinern │ Shift+Alt+→/← │ │ │ Höhe des mehrzeiligen "Suchen nach" │ │ Wenn mehrzeiliges "Suchen nach" │ │ vergrößern/verkleinern │ Strg+Shift+Alt+↓/↑ │ sichtbar ist. │ ├───────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ Engine-Optionen anzeigen │ Strg+E │ │ │ Dialog "Hilfe" anzeigen │ Strg+H │ │ ├───────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ CudaTexts "Suchen"-Dialog aufrufen │ Strg+F │ Suchmuster und -optionen werden │ │ CudaTexts "Ersetzen"-Dialog aufrufen │ Strg+R │ kopiert. │ └───────────────────────────────────────────┴──────────────────────┴──────────────────────────────────────┘
