Repository: CudaText-addons/CudaText-translations
Catalog: translation.*/langpy/*/LC_MESSAGES/cuda_ext.po
Languages: de_at, ru_ru

source: {} doesn't work with multi-carets
de_at: {} funktioniert nicht mit Multi-Cursor
ru_ru: {} не работает с несколькими каретками

source: {} doesn't work with selection
de_at: {} funktioniert nur ohne Auswahl

source: Cannot find matching bracket for '{}'
de_at: Kann passende Klammer zu '{}' nicht finden
ru_ru: Не найдена парная скобка для '{}'

source: Cannot open: {}
de_at: Kann nicht öffnen: {}
ru_ru: Невозможно открыть: {}

source: Need to update CudaText
de_at: CudaText-Update erforderlich

source: Copy {}
de_at: Kopieren {}
ru_ru: Копировать {}

source: No clip
de_at: Kein Schnipsel
ru_ru: Нет клипа

source: Replace {} with clip
de_at: {} ersetzen durch Schnipsel
ru_ru: Заменить {} клипом

source: Command doesn't work with multi-carets
de_at: Der Befehl funktioniert nicht mit Multi-Cursor
ru_ru: Команда не работает с несколькими каретками

source: Command works when no selection
de_at: Der Befehl funktioniert auch ohne Auswahl
ru_ru: Команда работает только без выделения

source: Command
de_at: Befehl
ru_ru: Команда

source: Not found lines by status
de_at: Keine nach Status gesuchten Zeilen
ru_ru: Не найдены строки по статусу

source: No line number in clipboard
de_at: Keine Zeilennummer in der Zwischenablage
ru_ru: Нет номера в клипе

source: No line #{}
de_at: Keine Zeile #{}
ru_ru: Нет строки #{}

source: No staple to jump
de_at: Keine Codefaltung zum Anspringen
ru_ru: Нет скрепки для перехода

source: No fold-ranges to jump to
de_at: Keine Faltungsbereiche zum Anspringen

source: No bookmarks
de_at: Keine Lesezeichen
ru_ru: Нет закладок

source: Tab bookmarks: {}
de_at: Lesezeichen in Dateireitern: {}

source: No numbered bookmarks in tabs
de_at: Keine nummerierten Lesezeichen in Dateireitern
ru_ru: Нет закладок в табах

source: No bookmarks in tabs
de_at: Keine Lesezeichen in Dateireitern
ru_ru: Нет закладок в табах

source: All tabs bookmarks: {}
de_at: Lesezeichen aller Dateireiter: {}

source: Align paragraphs - options (default values)
de_at: Paragraphen ausrichten - Optionen (Standardwerte)
ru_ru: Выровнять параграфы - настройки (умолчательные значения)

source: Paragraph right margin ({})
de_at: Paragraph: Rechter Rand ({})
ru_ru: Правый край параграфа ({})

source: Indent of first line (0)
de_at: Einzug der ersten Zeile (0)
ru_ru: Сдвиг первой строки (0)

source: Indent of other lines (0)
de_at: Einzug der anderen Zeilen (0)
ru_ru: Сдвиг остальных строк (0)

source: Only for saved file
de_at: Nur für die gespeicherte Datei
ru_ru: Только для сохраненного файла

source: In output no errors or no current file:
de_at: Keine aktuelle Datei oder keine Fehler in der Ausgabe:

source: No text selected
de_at: Kein Text ausgewählt

source: Indented {n2-n1+1} lines
de_at: {n2-n1+1} Zeilen eingerückt

source: Empty clip
de_at: Leeres Schnipsel
ru_ru: Пустой клип

source: No text in clip
de_at: Kein Text im Schnipsel
ru_ru: Нет текста в клипе

source: Command works only if no selection
de_at: Der Befehl funktioniert nur ohne Auswahl
ru_ru: Команда работает только без выделения

source: Clipboard has no text
de_at: Die Zwischenablage enthält keinen Text
ru_ru: Нет текста в клипе

source: Pasted trimmed text
de_at: Getrimmten Text eingefügt
ru_ru: Вставлен текст без концевых пробелов

source: Need selection
de_at: Brauche eine Auswahl

source: Text already trimmed
de_at: Text bereits getrimmt
ru_ru: Текст уже без концевых пробелов

source: Text trimmed
de_at: Text getrimmt
ru_ru: В тексте удалены концевые пробелы

source: Enter string to fill selection
de_at: String zum Ausfüllen der Auswahl eingeben

source: Changed %d selection(s)
de_at: %d Auswahl(en) geändert
ru_ru: Изменено(ы) %d выделение(й)

source: Need single-line selection(s)
de_at: Brauche einzeilige Auswahl(en)
ru_ru: Требуется однострочное выделение (или несколько таких)

source: Character hex code, optional 0x prefix:
de_at: Zeichencode hex, optional 0x Präfix:

source: Not valid hex code:
de_at: Kein gültiger Hex-Code:

source: Character inserted: U+
de_at: Zeichen eingefügt: U+

source: Name to save splitters layout
de_at: Name zum Speichern des Splitterfenster-Layouts
ru_ru: Имя для сохранения

source: Layout with name "{nm}" already exists. Replace?
de_at: Ein Layout namens "{nm}" gibt's bereits. Ersetzen?
ru_ru: Имя "{nm}" уже используется. Заменить?

source: No saved layout
de_at: Kein gespeichertes Layout
ru_ru: Нет сохраненных раскладок

source: Remove layout?
de_at: Layout entfernen?
ru_ru: Удалить раскладку?

source: Restore layout?
de_at: Layout wiederherstellen?
ru_ru: Восстановить раскладку?

source: Restored layout:
de_at: Wiederhergestelltes Layout:
ru_ru: Восстановлена раскладка:

source: Entered the same filename
de_at: Gleichen Dateinamen eingegeben

source: Directory separator char is not allowed
de_at: Verzeichnistrennzeichen ist nicht erlaubt

source: There is directory with name: {} Choose another name.
de_at: Es gibt bereits ein Verzeichnis namens: {} Bitte einen anderen Namen vergeben.
ru_ru: Уже существует папка: {} Укажите другое имя.

source: File {} already exists. Replace?
de_at: Datei {} ist bereits vorhanden. Ersetzen?
ru_ru: Файл {} уже существует. Заменить?

source: Rename file
de_at: Datei umbenennen
ru_ru: Переименовать файл

source: Enter n&ew file name:
de_at: N&euen Dateinamen eingeben:
ru_ru: Задайте н&овое имя файла:

source: Cancel
de_at: Abbrechen
ru_ru: Отмена

source: Could not save the file as: {}
de_at: Kann die Datei nicht unter diesem Namen speichern: {}

source: Save file first
de_at: Zuerst die Datei speichern
ru_ru: Сначала сохранить файл

source: No need to do anything
de_at: Keine Aktion erforderlich
ru_ru: Действия не требуются

source: Reopened in text editor
de_at: Neu geladen im Text-Editor
ru_ru: Открыть заново в текстовом редакторе

source: Reopened in hex viewer
de_at: Neu geladen in der Hex-Ansicht
ru_ru: Открыть заново в hex режиме

source: Warning: the command needs a named tab.
de_at: Warnung: Der Befehl braucht einen benannten Dateireiter.
ru_ru: Предупреждение: команда требует именованного таба.

source: sorted by time
de_at: sortiert nach Zeit

source: sorted by path
de_at: sortiert nach Pfad

source: sorted by last closed
de_at: sortiert nach Zuletzt geschlossen

source: sorted by name
de_at: sortiert nach Name

source: Recent files:
de_at: Zuletzt verwendete Dateien:

source: <Show "name (path)">
de_at: <"Namen (Pfad)" anzeigen>
ru_ru: <Показывать "имя (путь)">

source: <Show "path/name">
de_at: <"Pfad/Namen" anzeigen>
ru_ru: <Показывать "путь/имя">

source: <Sort by path>
de_at: <Nach Pfad sortieren>
ru_ru: <Сортировать по пути>

source: <Sort by name>
de_at: <Nach Name sortieren>
ru_ru: <Сортировать по имени>

source: <Sort by time>
de_at: <Nach Zeit sortieren>
ru_ru: <Сортировать по времени>

source: <Sort by last closed>
de_at: <Nach Zuletzt geschlossen sortieren>

source: Mask(s) for filename ("*" - all files; "*.txt *.bat" - two masks)
de_at: Mask(en) für Dateinamen ("*" - Alle Dateien; "*.txt *.bat" - 2 Masken)
ru_ru: Маска(и) для имен файлов ("*" - все файлы; "*.txt *.bat" - две маски)

source: Non-text files:
de_at: Nichttext-Dateien:

source: View in &text mode
de_at: Im &Textmodus betrachten

source: View in &binary mode
de_at: Im &Binärmodus betrachten

source: View in &hex mode
de_at: Im &Hex-Modus betrachten

source: View in &unicode mode
de_at: Im &Unicode-Modus betrachten

source: View in un&icode/hex mode
de_at: Im Un&icode-/Hex-Modus betrachten

source: Do &not open
de_at: &Nicht öffnen

source: Open {} file(s) from {} folder(s)?{}
de_at: {} Datei(en) aus {} Verzeichnis(sen) öffnen?{}
ru_ru: Открыть {} файл(ы) из {} папки(ок)?{}

source: No file to open.
de_at: Keine Datei zu öffnen.

source: Text is modified! Command will use file content from disk. Continue?
de_at: Der Text ist geändert! Der Befehl verwendet jetzt den Dateiinhalt vom Laufwerk. Weiter?
ru_ru: Текст изменен! Команда использует содержимое файла на диске. Продолжить?

source: Error:
de_at: Fehler:

source: Cannot save
de_at: Speichern nicht möglich

source: Saved:
de_at: Gespeichert:

source: Save editors to a single file
de_at: Dateireiter in eine einzelne Datei speichern

source: Save all tabs (including not visible)
de_at: Alle Dateireiter (auch unsichtbare) speichern

source: Save visible editors in all groups
de_at: Sichtbare Dateireiter aller Gruppen speichern

source: Separator line:
de_at: Trennlinie:

source: saved.txt
de_at: Gespeichert.txt

source: Saved:
de_at: Gespeichert:

source: Removed characters: {}
de_at: Gelöschte Zeichen: {}
ru_ru: Удалено символов: {}

source: Removed {} line(s)
de_at: {} Zeile(n) gelöscht

source: No lines with "{}" were found
de_at: Keine Zeilen mit "{}" gefunden

source: Remove lines containing text:
de_at: Zeilen löschen, die folgenden Text enthalten:

source: Remove lines containing RegEx:
de_at: Zeilen löschen, die folgenden RegEx-Treffer enthalten:

source: Incorrect RegEx:
de_at: Ungültiger RegEx:

source: No tags were found
de_at: Keine <tags> gefunden

source: Removed {} tag(s)
de_at: {} <tags> gelöscht

source: Removed {} comment(s), {} tag(s)
de_at: {} Kommentare, {} <tags> gelöscht

source: Folded {} range(s)
de_at: {} Bereich(e) gefaltet

source: Replace all in Lines
de_at: Alle in Zeilen ersetzen

source: (Enter in first field to find)
de_at: (Suchbegriff in erstes Feld eingeben)

source: • [Shift+]Enter in "Find" field to search [previous] next fragment. • Ctlr+Down/Up to copy pattern lower/upper. • Command "Restore initial selection" (Shift+Esc) tries to restore only first of initial carets. • RegExp engine from CudaText is used. Names of RegEx sub-groups are $1, $2...
de_at: • (Shift+)Enter ins Feld "Suchen nach", um nach (vorigem) nächstem Fragment zu suchen. • Strg+Ab/Auf, um das Muster hinunter/hinauf zu kopieren. • Der Befehl "Anfangsauswahl wiederherstellen" (Shift+Esc) versucht nur den ersten der anfänglichen Cursor wiederherzustellen. • Verwendet wird CudaTexts Regex-Engine. Regex-Capture-Gruppen werden mit "$1", "$2"... referenziert.

source: Regular expressionRegEx engine from CudaText is used
de_at: Regulärer Ausdruck CudaTexts Regex-Engine wird verwendet

source: Case sensitive
de_at: Groß-/Kleinschreibung beachten
ru_ru: Учитывать регистр

source: Whole words
de_at: Ganzes Wort
ru_ru: Целое слово

source: Kit of pairs to replaceAlt+Left/Right - load previous/next pairAlt+Shift+Left/Right - activate previous/next kit
de_at: Bausatz zu ersetzender Paare [Alt+Links/Rechts] - Voriges/nächstes Paar laden [Alt+Shift+Links/Rechts] - Vorigen/nächsten Bausatz aktivieren

source: Pattern to searchEnter - to find nextShift+Enter - to find previous
de_at: Suchmuster [Enter] - Weitersuchen [Shift+Enter] - Rückwärts suchen

source: Pattern to replaceRegExp sub-groups are $1, $2, ...
de_at: Ersetzungsmuster Verweise auf Regex-Capture-Gruppen sind "$1", "$2", ...

source: Replace all
de_at: Alle ersetzen

source: Replace all for all pairs from the kit
de_at: Alle ersetzen für alle Paare des Bausatzes

source: &Find
de_at: Suchen &nach

source: &Replace
de_at: E&rsetzen durch

source: &All
de_at: &Alle

source: &Kits
de_at: &Bausätze

source: A&LL
de_at: A&LLE

source: Activate kit "{}"
de_at: Bausatz "{}" aktivieren

source: Edit kits...
de_at: Bausätze bearbeiten...

source: &Import from Replace history...
de_at: &Importieren aus dem Ersetzungsverlauf...

source: Rem&ove kit
de_at: Bausatz entfernen

source: &Change kits order...
de_at: Reihenfolge der Bausätze ändern...

source: Replace A&LL for all pairs (#{}) of the kit...
de_at: A&LLE ersetzen für alle Paare (#{}) des Bausatzes...

source: Replace A&LL for all pairs of a selected kit...
de_at: A&LLE ersetzen für alle Paare eines ausgewählten Bausatzes...

source: Replace &all
de_at: &Alle ersetzen

source: Create &new kit...
de_at: &Neuen Bausatz erstellen...

source: &Save pattern pair to kit
de_at: Musterpaar speichern in Bausatz

source: &Edit kit...
de_at: Bausatz &bearbeiten...

source: Load previous kit pair
de_at: Voriges Bausatzpaar laden

source: Load next kit pair
de_at: Nächstes Bausatzpaar laden

source: Load previous kit
de_at: Vorigen Bausatz laden

source: Load next kit
de_at: Nächsten Bausatz laden

source: Hide dialog
de_at: Dialog ausblenden

source: Hide dialog and restore selection &=
de_at: Dialog ausblenden und Auswahl wiederherstellen &=

source: &Help...
de_at: &Hilfe...
ru_ru: &Справка...

source: Help - &show guide in browser
de_at: Hilfe - &Anleitung im Browser anzeigen

source: Find &previous
de_at: &Weitersuchen
ru_ru: Искать &предыдущий

source: F&ind next
de_at: Rückwärts suchen
ru_ru: Искать с&ледующий

source: Copy down: Find->Replace
de_at: Hinunter kopieren: Suchen->Ersetzen

source: Copy up: Replace->Find
de_at: Hinauf kopieren: Ersetzen->Suchen

source: Move to app Find dialog
de_at: Verschieben in den Suchen-Dialog der Anwendung

source: Move to app Replace dialog
de_at: Verschieben in den Ersetzen-Dialog der Anwendung

source: === Options ===
de_at: === Optionen ===
ru_ru: === Настройки. ===

source: Use &selection from document
de_at: Au&swahl aus dem Dokument verwenden
ru_ru: Использовать выделение в документе

source: Auto-fit Replace pattern on start and on Next pair
de_at: Ersetzungsmuster automatisch einsetzen beim Start und bei "Nächstes Paar"

source: Load next pair after "Replace all"
de_at: Nach "Alle ersetzen" das nächste Paar laden

source: Select kit to Replace ALL
de_at: Bausatz für "ALLE ersetzen" auswählen

source: Remove kit {}
de_at: Bausatz {} entfernen

source: Re-order kits
de_at: Bausätze neu anordnen

source: Save
de_at: Speichern

source: Skip new order - kit names were not saved
de_at: Neuanordnung überspringen - Bausatznamen wurden nicht gespeichert

source: Kits order was changed
de_at: Reihenfolge der Bausätze wurde geändert

source: Enter a non-empty Find pattern
de_at: Ein nichtleeres Suchmuster eingeben

source: The pair is already in the kit
de_at: Das Paar ist bereits im Bausatz enthalten

source: The pair was saved
de_at: Das Paar wurde gespeichert

source: Search options as a string (any order): . - RegExp c - Case sensitive w - Whole word
de_at: Suchoptionen als String (beliebige Reihenfolge): . - Regulärer Ausdruck c - Groß-/Kleinschreibung beachten w - Ganzes Wort

source: Set equal number of Find/Replace patterns
de_at: Gleiche Anzahl von Such-/Ersetzungs-Mustern festlegen

source: Enter all non-empty Find patterns
de_at: Alle nichtleeren Suchmuster eingeben

source: Set another name for kit
de_at: Anderen Namen für den Bausatz vergeben

source: New kit
de_at: Neuer Bausatz

source: Content of kit ({})
de_at: Inhalt von Bausatz ({})

source: &Find patterns:
de_at: &Suchmuster:

source: &Replace patterns:
de_at: &Ersetzungsmuster:

source: &Save
de_at: &Speichern

source: Use 1+3*n lines for each kit. First line for n:kit name. Three lines for each kit pair a:attributes - "." "c" "w" - in any order, f:pattern Find, r:pattern Replace.Format:- The order of lines with "n:", "a:", "f:", "r:" is fixed.- Feel free to use empty lines and some blanks before "n:", "a:", "f:", "r:".Rules:- Empty name is correct.- Names must not be repeated.- Pattern Find must not be empty.
de_at: Verwenden Sie 1+3*n Zeilen für jeden Bausatz. Erste Zeile für n:Bausatzname. Drei Zeilen für jedes Paar im Bausatz a:Attribute - '.' 'c' 'w' - in beliebiger Folge, f:Suchmuster, r:Ersetzungsmuster. Format: - Die Reihenfolge der Zeilen ist mit "n:", "a:", "f:", "r:" vorgegeben. - Leerzeilen und Leerzeichen sind vor "n:", "a:", "f:", "r:" erlaubt. Regeln: - Leere Namen sind gültig. - Namen dürfen nicht wiederholt werden. - Das Suchmuster darf nicht leer sein.

source: Error: order of lines - line
de_at: Fehler: Reihenfolge der Zeilen - Zeile

source: Error: kit name repeated -
de_at: Fehler: Wiederholter Bausatzname -

source: Error: empty Find pattern for kit -
de_at: Fehler: Leeres Suchmuster für Bausatz -

source: Error: no Replace pattern for kit -
de_at: Fehler: Kein Ersetzungsmuster für Bausatz -

source: Edit kits
de_at: Bausätze bearbeiten

source: Loaded pair {}/{}
de_at: Geladenes Paar {}/{}

source: No pairs in kit "{}"
de_at: Keine Paare in Bausatz "{}"

source: No fragments to replace with kit "{}"
de_at: Keine Fragmente zu ersetzen durch Bausatz "{}"

source: Replace ALL for kit ("{}")
de_at: ALLE ersetzen für Bausatz ("{}")

source: Yes
de_at: Ja

source: No
de_at: Nein

source: Results for kit ("{}")
de_at: Ergebnis für Bausatz ("{}")

source: Close
de_at: Schließen

source: Not found.
de_at: Nicht gefunden.

source: Not found
de_at: Nicht gefunden

source: Replaces made: {}.
de_at: Erfolgte Ersetzungen: {}.

source: Replaces made: {}
de_at: Erfolgte Ersetzungen: {}

source: Find in Lines
de_at: Suchen in Zeilen
ru_ru: Поиск по Строкам

source: • Search "in Lines" starts immediately (if focus in the left edit) or on Enter or Shift+Enter (if focus in the right edit). • A found fragment after first caret will be selected. • All found fragments are remembered and dialog can jump over them by [Shift+]Enter or by menu commands. • Ctlr+Right (or Alt+Right) copies text from the left edit to the right. • Ctlr+Left (or Alt+Left) copies text from the right edit to the left. • Option ".*" (regular expression) allows to use Python reg.ex. See "docs.python.org/3/library/re.html". • Option "w" (whole words) is ignored if entered string contains not a word. • If option "Instant search" (in menu) is tuned on, search result will be updated on start and after each change of pattern. • Command "Restore initial selection" (Shift+Esc) restores only first of initial carets. • Ctrl+F (or Ctrl+R) calls appication dialog Find (or Replace).
de_at: • "In Zeilen" suchen startet mit Enter oder Shift+Enter oder sofort (falls "Inkrementelle Suche" eingeschaltet ist). • Ein hinter dem ersten Cursor gefundener Treffer wird ausgewählt. • Alle Suchtreffer werden vorgemerkt und der Dialog kann sie anspringen per (Shift+)Enter oder via Menübefehle. • Option ".*" (Regulärer Ausdruck) erlaubt regex im Python-Format. Vgl. "docs.python.org/3/library/re.html". • Option "w" (Nur ganzes Wort) wird ignoriert, wenn der eingegebene String kein Wort enthält. • Bei eingeschalteter Option "Inkrementelle Suche" (im Menü) wird der Suchtreffer beim Start und mit jedem eingegebenen Zeichen genauer angesprungen. • Der Befehl "Anfangsauswahl wiederherstellen" (im Menü) stellt nur den ersten der anfänglichen Cursor wieder her. • Strg+F (oder Strg+R) ruft den Suchen-(/Ersetzen-)Dialog der Anwendung auf.
ru_ru: • Поиск "по Строкам" выполняется по Ввод или Shift+Ввод или сразу (если включена опция "Мгновенный поиск"). • Выделяется фрагмент, найденный ниже первой каретки. • Все найденные фрагменты запоминаются и по ним можно перемещаться с помощью [Shift+]Enter или командами меню. • Опция ".*" (регулярное выражение) позволяет применять специальный язык. См. "docs.python.org/3/library/re.html". • Опция "w" (целое слово) игнорируется, если задано не слово. • Если включена опция "Мгновенный поиск" (в меню), фрагменты ищутся при запуске диалога и после каждого изменения. • Команда "Восстановить исходное выделение" (Shift+Esc) восстанавливает только первую из кареток. • Ctrl+F (или Ctrl+R) вызывает стандартный диалог Find (или Replace).

source: Left input: at least {} chars. Right input: ENTER.
de_at: Eingabe links: min. {} Zeichen; rechts: [Enter].

source: Regular expression
de_at: Regulärer Ausdruck
ru_ru: Регулярное выражение

source: Instant search - minimal length
de_at: Inkrementelle Suche, min. Zeichen
ru_ru: Мгновенный поиск - минимальное число символов

source: &Minimal length of instant-search (left) field: {}...
de_at: &Mindestlänge des Schnellsuchfeldes (links): {}...

source: Hide dialog &=
de_at: Dialog ausblenden &=
ru_ru: Скрыть диалог &=

source: Hi&de dialog and restore selection
de_at: Dialog schließen und Auswahl wiederherstellen
ru_ru: Скр&ыть диалог и восстановить выделение

source: Move to app &Find dialog
de_at: Suchen-Dialog der Anwendung aufrufen
ru_ru: Перейти в стандартный По&иск

source: Move to app &Replace dialog
de_at: E&rsetzen-Dialog der Anwendung aufrufen
ru_ru: Перейти в стандартный З&амены

source: Work in non-modal mod&e (close dialog)
de_at: Arbeiten im Nicht-Modalmodus (Dialog schließen)

source: Dock to window &top (close dialog)
de_at: Andocken an Fensterrand &oben (Dialog schließen)
ru_ru: Прикрепить к верху (требуется перевызов)

source: Dock to window &bottom (close dialog)
de_at: Andocken an Fensterrand &unten (Dialog schließen)
ru_ru: Прикрепить к низу (требуется перевызов)

source: No selected text to replace
de_at: Keine Textauswahl zu ersetzen
ru_ru: Нет текста для замены

source: No clipped text to replace
de_at: Kein Schnipseltext zu ersetzen
ru_ru: Нет клипа для замены

source: Set carets aligned as column
de_at: Multi-Cursor ausgerichtet wie Spalte setzen

source: At &line:
de_at: Bei &Zeile:

source: At &column:
de_at: Bei &Spalte:

source: &Height in lines:
de_at: &Höhe in Zeilen:

source: &Width of selection:
de_at: &Breite der Auswahl:

source: &Keep existing caret(s)
de_at: &Vorhandene Cursor beibehalten

source: Added {} caret(s)
de_at: {} Cursor hinzugefügt

source: {} works with multiline selection
de_at: {} funktioniert mit mehrzeiliger Auswahl
ru_ru: {} работает с несколькими каретками

source: Converted to column block
de_at: Umgewandelt in Spaltenblock
ru_ru: Выполнен переход к вертикальному выделению

source: Make selection first
de_at: Bitte zuerst etwas auswählen
ru_ru: Сделайте выделение

source: Reversed 1 fragment
de_at: 1 Fragment umgekehrt
ru_ru: Реверсирован 1 фрагмент

source: Reversed {} fragments
de_at: {} Fragmente umgekehrt
ru_ru: Реверсировано фрагментов: {}

source: Enter separator string
de_at: Separator-String eingeben
ru_ru: Укажите строку для разделения

source: No separator '{}' in selected lines
de_at: Kein Separator '{}' in den ausgewählten Zeilen
ru_ru: Нет разделителя '{}' в выделенных строках

source: Text change not needed
de_at: Textänderung nicht nötig
ru_ru: Изменение не требуется

source: Need to update application
de_at: Anwendungs-Update erforderlich

source: To specify two/four/eight blanks enter these blanks or "2b"/"4b"/"8b" or ".."/"...."/"........" (dots). To specify TAB enter "t".
de_at: 2/4/8 Leerzeichen angeben durch Eingabe von diesen Leerzeichen oder "2b"/"4b"/"8b" oder ".."/"...."/"........" (Punkte). Tabulator angeben durch Eingabe von "t".
ru_ru: Для указания двух/четырех/восьми пробелов введите эти пробелы или "2b"/"4b"/"8b" или ".."/"...."/"........" (dots). Для указания TAB введите "t".

source: Fill "Old step".
de_at: Feld "Alter Einzugsschritt" ausfüllen.
ru_ru: Укажите "Прежний шаг".

source: Fill "New step".
de_at: Feld "Neuer Einzugsschritt" ausfüllen.
ru_ru: Укажите "Новый шаг".

source: Reindent selected lines ({})
de_at: Ausgewählte Zeilen ({}) neu einrücken
ru_ru: Заменены сдвиги в выделенных строках ({})

source: &Old indent step:
de_at: &Alter Einzugsschritt:
ru_ru: &Старый шаг сдвига:

source: &New indent step:
de_at: &Neuer Einzugsschritt:
ru_ru: &Новый шаг сдвига:

source: Reindent skipped
de_at: Neueinrücken übersprungen
ru_ru: Изменения пропущены

source: Need selected lines
de_at: Brauche ausgewählte Zeilen
ru_ru: Требуется выделение строк

source: Need more than one selected lines
de_at: Brauche mehr als eine ausgewählte Zeile
ru_ru: Требуется выделение из нескольких строк

source: Required normal selection(s)
de_at: Normale Auswahl(en) erforderlich
ru_ru: Требуется строковое выделение (или несколько)

source: Aligned selection for {} of {} caret(s)
de_at: Ausgerichtete Auswahl für {} von {} Cursor
ru_ru: Выравнено выделение для {} из {} кареток

source: Nothing to align
de_at: Nichts auszurichten
ru_ru: Не требуется выравнивание

source: Fail to use Tab to align
de_at: Ausrichten per Tabulator gescheitert
ru_ru: Сбой при выравнивании с помощью Tab
