Repository: CudaText-addons/CudaText-translations
Catalog: translation.*/langpy/*/LC_MESSAGES/cuda_find_*_files4.po
Languages: de_at, ru_ru

source: Some of the search parameters slightly decrease the search speed. Others reduce the speed dramatically. To perform optimal search, you better consider these notes. 1. The parameters .* {reex} aA {case} "w" {word} do not reduce the speed at all. 2. Using non-trivial setttings of "Sort collected files" or "Age of files" basically does not reduce the speed. 3. Appending context lines to Results ("-?+?") slightly decreases the speed. 4. Multi-line pattern ("+") noticeably decreases the speed. 5. Inappropriate "Encoding plan" can greatly reduce the speed if too many files need to be read. 6. The slowest search (the slowdown in dozens of times) occurs if - any of "Syntax elements" is turned on, - option "Show lexer path for all fragments" is turned on, - lexer path filter is included in the "{incl}" or "{excl}" fields, - styles are copied from source lines from disk files to Results (note: copying styles from tabs is also slowed down but not as much). 7. If engine option "copy_styles" is on and Results has a lot of lines then value of engine option "copy_styles_max_lines" is important. Extra time is directly proportional to the value of the option. So default value 100 (coloring only the first 100 lines) should be well enough. ———————————————————————————————————————————————————————————————————————————————————————————— Special cases. If pattern is regular expresion (".*" is checked) then it can be indirectly multi-line. So in this case, to avoid guessing, plugin checks for single-line or multi-line state to detect which search is needed. If pattern includes "|" or "&" (options "any_all_parts" is on) then plugin sees newline in pattern ("§" for single-line state) to detect which search is needed: no newline - search into each line separately, with newline - search in whole file text. Huge files can also be involved in the search. For optimal memory usage you need to: - Turn off the appending context lines ("-N+M"). - Turn off the multi-line pattern ("+") and remove newline character "§". - Turn off all "Syntax elements". - Turn off "Show lexer path for all fragments". - Ensure no lexer path filters are used. - Turn off engine option "copy_styles". Hint. Start "Fast search" (Shift+F2) to ignore all these options (except lexer path filters) without manually turning them off. Also see engine options - skip_file_size_more(Kb), - dont_show_file_size_more(Kb).
de_at: Einige der Suchoptionen verringern die Suchgeschwindigkeit nur geringfügig. Andere dagegen verringern die Geschwindigkeit drastisch. Für eine optimale Suchleistung beachten Sie bitte folgende Hinweise: 1. Die Optionen .* {reex} aA {case} "w" {word} verringern die Geschwindigkeit überhaupt nicht. 2. Nichttriviale Einstellungen "Gesammelte Dateien sortieren" oder "Alter der Dateien" verringern die Geschwindigkeit eigentlich nicht. 3. Zusätzliche Kontextzeilen in der Ergebnisanzeige ("-?+?") verringern die Geschwindigkeit nur geringfügig. 4. Mehrzeilige Suchmuster ("+") verringern die Geschwindigkeit deutlich. 5. Ein unzweckmäßiger "Kodierungsplan" kann die Geschwindigkeit stark verringern, falls zu viele Dateien gelesen werden müssen. 6. Die langsamste Suche (ein Vielfaches an Zeitverlust) erfolgt, wenn - eines der "Syntax-Elemente" eingeschaltet ist, - die Option "Lexerpfad für alle Fragmente anzeigen" eingeschaltet ist, - der Lexerpfadfilter in den Feldern "{incl}" oder "{excl}" inkludiert ist, - Stile aus Quelldateien vom Datenträger in die Ergebnisanzeige kopiert werden (Hinweis: Das Kopieren von Stilen aus Dateireitern wird ebenfalls verringert, aber nicht ganz so stark). 7. Wenn die Engine-Option "copy_styles" eingeschaltet ist und die Ergebnisanzeige viele Zeilen enthält, dann ist der Wert der Engine-Option "copy_styles_max_lines" entscheidend. Der Zeitverlust ist direkt proportional zum Wert der Option. Daher sollte der Standardwert 100 (Syntaxhervorhebung nur der ersten 100 Zeilen) ausreichen. ———————————————————————————————————————————————————————————————————————————————————————————— Spezialfälle. Wenn das Muster ein Regulärer Ausdruck ist (".*" ist angekreuzt), dann darf es indirekt mehrzeilig sein. In diesem Fall prüft das Plug-in, ohne raten zu müssen, auf Einzeilen- oder Mehrzeilenstatus, um zu ermitteln, welcher Suchmodus gebraucht wird. Wenn das Muster '|' oder '&' enthält (Option "any_all_parts" ist angekreuzt), dann prüft das Plug-in im Muster auf Zeilenschaltung ('§' für Einzeilenstatus), um zu ermitteln, welcher Suchmodus gebraucht wird: ohne Zeilenschaltung - in jeder Zeile separat suchen, mit Zeilenschaltung - im Text der ganzen Datei suchen. Riesige Dateien können die Suche ebenfalls beeinflussen. Tipps zur optimalen Speichernutzung: - Zusätzliche Kontextzeilen ("-N+M") ausschalten. - Mehrzeilige Suchmuster ("+") ausschalten und Zeilenschaltungszeichen '§' entfernen. - Alle "Syntax-Elemente" ausschalten. - Option "Lexerpfad für alle Fragmente anzeigen" ausschalten. - Sicherstellen, dass keine Lexerpfadfilter verwendet werden. - Engine-Option "copy_styles" ausschalten. Hinweis: Die "Schnellsuche" (Shift+F2) ignoriert all diese Optionen (außer Lexerpfadfilter), ohne sie manuell ausschalten zu müssen. Vgl. auch die Engine-Optionen - "skip_file_size_more(KB)", - "dont_show_file_size_more(KB)".

source: Shift+F2 starts the single search, which ignores slowing down options such as: "Extra context lines", "Syntax elements", "Show lexer path for all fragments", "copy_styles" (engine). ———————————————————————————————————————————————————————————————————————————————————————————— Hold Shift-key when clicking ".*" ("Regular Expression") to change the option and also escape/unescape all non-word characters in the pattern. It is guaranteed that the search results will not change because of that. ———————————————————————————————————————————————————————————————————————————————————————————— If field "{excl}" contains " /. " then the root folder(s) will be skipped. ———————————————————————————————————————————————————————————————————————————————————————————— The field "{fold}" can contain many folders to search. Folder names must be independent (no parent-child pairs). The field can also contain both folder mask(s) and {tabs}. ———————————————————————————————————————————————————————————————————————————————————————————— Use \§ to find the character §. Note. Multi-line control shows a pattern with extra newline (known bug). So if pattern ends with a newline, this newline will be stripped from actual search string. ———————————————————————————————————————————————————————————————————————————————————————————— Hotkeys Ctrl+1, ..., Ctrl+9 apply presets #1, ..., #9. Preset can store needed options values. So you can use presets to quickly turn on/off the selected option instead of using the menu. Example. Create preset #1 only with the check on [x]3 ' ' (No extra search options). Create preset #2 only with the check on [x]3 '?/**/?' ("Syntax elements/Outside of comments"). Use Ctrl+1 to quickly clear extra search options without changing others search settings. Use Ctrl+2 to quickly set only "Outside of comments". ———————————————————————————————————————————————————————————————————————————————————————————— You can use macro-vars in any editable fields. E.g. "~ {{t}}" will be auto-replaced to "~ {tabs}". To search the expression with brackets like "{{t}}", type in brackets with backslashes like "\{{t\}}" (or like "\{{t}}", if field doesn't have the outer bracket pair). Engine option "use_selection_on_start" uses selected text from document for the field "Find". Instead of this option, you can use macro-var {{ed:SelectedText}}. This way you can use selected text many times, not only at the start. The macro-var {{ed:CurrentWord}} provides the use of word from the document without selection at all. ———————————————————————————————————————————————————————————————————————————————————————————— How to avoid separate buttons (CudaText and FindInFiles) in the OS app switcher dialog? Set CudaText option ui_taskbar_mode to false.
de_at: Shift+F2 startet die Schnellsuche, die zeitintensive Optionen ignoriert, wie z.B.: "Extra-Kontextzeilen", "Syntax-Elemente", "Lexerpfad für alle Fragmente anzeigen", "copy_styles" (Engine). ———————————————————————————————————————————————————————————————————————————————————————————— [Shift]-Taste gedrückt halten + Klick auf ".*" ("Regulärer Ausdruck") wechselt die Option und escaped/unescaped auch alle Nicht-Wortzeichen im Muster. Das Suchergebnis wird davon garantiert nicht beeinflusst. ———————————————————————————————————————————————————————————————————————————————————————————— Wenn das Feld "{excl}" die Zeichenfolge " /. " enthält, dann werden die Stammverzeichnisse (root) übersprungen. ———————————————————————————————————————————————————————————————————————————————————————————— Das Feld "{fold}" darf mehrere zu durchsuchende Verzeichnisse enthalten. Die Verzeichnisnamen müssen voneinander unabhängig sein (keine Elter-Kind-Paare). Das Feld darf auch Verzeichnismasken und {tabs} enthalten. ———————————————————————————————————————————————————————————————————————————————————————————— Das Zeichen '§' findet man mit "\§". Hinweis: Das mehrzeilige Eingabefeld zeigt ein Muster mit einer Extra-Zeilenschaltung an (bekannter Fehler). Wenn also das Muster mit einer Zeilenschaltung endet, dann wird diese Zeilenschaltung aus dem tatsächlichen Such-String entfernt. ———————————————————————————————————————————————————————————————————————————————————————————— Die Tastenkürzel Strg+1, ..., Strg+9 wenden die Voreinstellungen #1, ..., #9 an. Eine Voreinstellung kann benötigte Optionswerte speichern. Somit kann die ausgewählte Option ohne Umweg über das Menü direkt ein-/ausgeschaltet werden. Beispiel: Erstellen Sie eine Voreinstellung #1 mit einem Häkchen nur bei [x]3 ' ' (Keine Extra-Suchoptionen). Erstellen Sie eine Voreinstellung #2 mit einem Häkchen nur bei [x]3 '?/**/?' ("Syntax-Elemente / Außerhalb von Kommentaren"). Strg+1 deaktiviert nun direkt die Extra-Suchoptionen und ignoriert andere Einstellungen. Strg+2 schaltet nun direkt bloß die Option "Außerhalb von Kommentaren" ein. ———————————————————————————————————————————————————————————————————————————————————————————— In allen Eingabefeldern sind Makrovariablen erlaubt. Z.B. wird "~ {{t}}" zu "~ {tabs}" erweitert. Werden im Ausdruck Klammern wie "{{t}}" verwendet, müssen sie mit Backslash geschützt werden, wie "\{{t\}}" (oder wie "\{{t}}", falls das Feld kein äußeres Klammerpaar aufweist). Die Engine-Option "use_selection_on_start" übernimmt den ausgewählten Text aus dem Dokument in das Feld "Suchen nach". Statt dieser Option steht auch folgende Makrovariable zur Verfügung: {{ed:SelectedText}}. Damit kann der ausgewählte Text mehrmals verwendet werden, statt bloß beim Start. Die Makrovariable {{ed:CurrentWord}} stellt das aktuelle Wort des Dokumentes ganz ohne vorherige Auswahl zur Verwendung bereit. ———————————————————————————————————————————————————————————————————————————————————————————— Wie vermeidet man separate Schaltflächen (CudaText und FindInFiles) im App-Wechseldialog des Betriebssystems? Indem man die CudaText-Option ui_taskbar_mode auf 'false' setzt.

source: Welcome to the plugin's GitHub page
de_at: Willkommen auf der GitHub-Seite des Plug-ins
ru_ru: Заходите на GitHub страницу плагина

source: folders and files picking
de_at: Verzeichnisse und Dateien einsammeln

source: Fail. Use only for python file.
de_at: Gescheitert. Nur für eine Python-Datei verwenden.

source: Apply the tunings to controls of all dialogs.
de_at: Die Justierungen auf Kontrollobjekte aller Dialoge anwenden.

source: &Save
de_at: &Speichern

source: Cancel
de_at: Abbrechen

source: Tuning text vertical alignment for control pairs
de_at: Senkrechte Textausrichtung für Kontrollobjekt-Paare justieren

source: Win only: Encode operand according to the ANSI codepage (CP_ACP)
de_at: Nur Win: Operand kodieren laut ANSI-Codepage (CP_ACP)

source: Russian
de_at: Russisch

source: Bulgarian, Belarusian, Macedonian, Russian, Serbian
de_at: Bulgarisch, Belarusisch, Makedonisch, Russisch, Serbisch

source: English
de_at: Englisch

source: Hebrew
de_at: Hebräisch

source: Western Europe
de_at: Westeuropäisch

source: Greek
de_at: Griechisch

source: Baltic languages
de_at: Baltische Sprachen

source: Central and Eastern Europe
de_at: Mittel- und Osteuropäisch

source: Turkish
de_at: Türkisch

source: Portuguese
de_at: Portugisisch

source: Icelandic
de_at: Isländisch

source: Canadian
de_at: Kanadisch

source: Danish, Norwegian
de_at: Dänisch, Norwegisch

source: Win only: Windows UTF-8 (CP_UTF8)
de_at: Nur Win: Windows-UTF-8 (CP_UTF8)

source: West Europe
de_at: Westeuropäisch

source: Esperanto, Maltese
de_at: Esperanto, Maltesisch

source: Nordic languages
de_at: Nordische Sprachen

source: Celtic languages
de_at: Keltische Sprachen

source: South-Eastern Europe
de_at: Südosteuropa

source: Ukrainian
de_at: Ukrainisch

source: Kazakh
de_at: Kasachisch

source: all languages
de_at: Alle Sprachen

source: "Find in Files 4" options
ru_ru: Опции "Find in Files 4"

source: Tricks
ru_ru: Трюки

source: "Find in Files 4" help
ru_ru: Справка "Поиск по Файлам 4"

source: h
ru_ru: ч

source: m
ru_ru: мес

source: w
ru_ru: нед

source: >Na&me:
ru_ru: >Имя:

source: Add le&xer path to the statusbar
ru_ru: Добавлять лексер-путь в статусбар

source: &Add embeded/project/custom var
ru_ru: Вставить макрос

source: Find in Files 4
ru_ru: Поиск по Файлам 4

source: Timing?
ru_ru: Длительность?

source: &Name:
ru_ru: Имя:

source: with
ru_ru: с

source: Option allows to save separate search settings (pattern, files mask, folders etc) per each mentioned session or project. Each item in the option is a pair (Prefix,RegEx). RegEx is compared with the full path of session (project). First matched item is used. Prefix is appended to keys. Example. If session path includes "cudatext" then value {"cuda":"cuda"} changes storing key "in_what" to "cuda:in_what"
ru_ru: Позволить раздельное сохранение параметров поиска (шаблона, маски файлов, папки и пр.) для каждой из перечисленных сессий/проектов. В перечислении указываются пары (Префикс, РегВыражение). РегВыражения применяются к полному пути к файлу сессии/проекта и используется первый подходящий. Его префикс приписывается при сохранении к ключам параметров. Пример. Если путь сессии содержит 'cudatext', то задание {"cuda":"cuda"} приводит к изменению ключа для хранения с "in_what" на "cuda:in_what"

source: separated_histories
ru_ru: Позволить раздельное сохранение параметров поиска (шаблона, маски файлов, папки и пр.) для каждой из перечисленных сессий/проектов. В перечислении указываются пары (Префикс, РегВыражение). РегВыражения применяются к полному пути к файлу сессии/проекта и используется первый подходящий. Его префикс приписывается при сохранении к ключам параметров. Пример. Если путь сессии содержит 'cudatext', то задание {"cuda":"cuda"} приводит к изменению ключа для хранения с "in_what" на "cuda:in_what"

source: file_picking_stage
ru_ru: Сначала собрать все файлы, потом искать в них.

source: re_verbose
ru_ru: Разрешить комментарии в многострочных рег. выражениях. Пробелы игнорируются вне классов и без предшествующего обратного слеша. Тест от первого "#" до конца строки игнорируется. Пример. Однострочное выражение "\d\w+$" совпадает с многострочным \d # Начальная цифра \w+ # Несколько букв $ # Конец строки

source: any_all_parts
ru_ru: Если опция Рег.выражение отключена, эта опция позволяет разбивать шаблон на части и искать все/любые из них: "|" - искать одну из частей, "&" - искать все части. Если шаблон содержит сразу "|" и "&", то "|" разбивает первой. Если опция выключена, символы "|" и "&" используются как обычные знаки.

source: List of source file lexers. For these lexers extra filters and info will work: Search by lexer tree path, Search inside/outside of comments and/or literal strings. Empty list - allow all lexers.
ru_ru: Список лексеров для исходников. Только для указанных лексеров будут выполняться: Поиски по лексер-пути, Поиски в/вне комментарием и/или литеральных строк. Пустой список: для всех лексеров.

source: lexers_to_filter
ru_ru: Список лексеров для исходников. Только для указанных лексеров будут выполняться: Поиски по лексер-пути, Поиски в/вне комментарием и/или литеральных строк. Пустой список: для всех лексеров.

source: mark_style
ru_ru: Стили для маркировки найденного фрагмента в Результатах. Полная форма: "mark_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Формат задания цвета: "" - пропустить, "#RRGGBB" - hex-цифры Значения для границ: "solid", "dash", "2px", "dotted", "rounded", "wave"

source: lex_path_style
ru_ru: Стили для маркировки лексер-пути в Результатах. Полная форма: "lex_path_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Формат задания цвета: "" - пропустить, "#RRGGBB" - hex-цифры Значения для границ: "solid", "dash", "2px", "dotted", "rounded", "wave"

source: copy_styles
ru_ru: Копировать стили (цвета и жирный/наклонный) для строк исходников в Результатах Внимание! Приводит к значительной задержке поиска.

source: copy_styles_max_lines
ru_ru: Максимальное число строк, для которых будет выполнено копирование стилей из исходника в Результаты. Внимание! Большое значение приводит к значительной задержке поиска.

source: show_progress_fragments
ru_ru: Максимальное число строк, для которых будет выполнено копирование стилей из исходника в Результаты. Внимание! Большое значение приводит к значительной задержке поиска.

source: If value>0, do not show all files, which sizes are bigger than this value (in Kb).
ru_ru: Если значение>0, то не показывать в Исходнике файлы большего размера (в Kb).

source: Dialog layout
ru_ru: Раскладка в диалоге

source: F3/{u}F3 - next/prev fragment, ^F3/^{u}F3 - next/prev file fragment, Enter - open.
ru_ru: F3/{u}F3 - след/пред фрагмент, ^F3/^{u}F3 - след/пред файл с фрагментом, ВВОД - открыть.

source: Start folder(s). Space-separated folders. Double-quote folder, which needs space char. "~" is user home folder. {} or {{t}} to search in tabs.
ru_ru: Начальная папка(и). Несколько папок через пробел. Используйте двойные кавычки, если папка содержит пробелы. "~" - домашняя папка пользователя. {} или {{t}} для поиска по табам.

source: How many folder levels to search. Use Ctrl+↑/↓ to change this option.
ru_ru: Сколько уровней дерева использовать при поиске. Ctrl+↑/↓ меняет опцию по циклу.

source: Ex&:
ru_ru: Кроме:
