Repository: CudaText-addons/CudaText-translations
Catalog: translation.*/langpy/*/LC_MESSAGES/cuda_find_*_files.po
Languages: de_at

source: +Search
de_at: +Suchen

source: +Replace
de_at: +Ersetzen

source: <Project Folders>
de_at: <Projektordner>

source: <Open Files>
de_at: <Offene Dateien>

source: <prior tab>
de_at: <vorherigen Dateireiter>

source: <new tab>
de_at: <neuen Dateireiter>

source: path(r):line
de_at: Pfad(r):Zeile

source: path(r:c:l):line
de_at: Pfad(r:m:l):Zeile

source: path/(r):line
de_at: Pfad/(r):Zeile

source: path/(r:c:l):line
de_at: Pfad/(r:m:l):Zeile

source: dir/file(r):line
de_at: Verz./Datei(r):Zeile

source: dir/file(r:c:l):line
de_at: Verz./Datei(r:m:l):Zeile

source: dir/file/(r):line
de_at: Verz./Datei/(r):Zeile

source: dir/file/(r:c:l):line
de_at: Verz./Datei/(r:m:l):Zeile

source: detect
de_at: ermitteln

source: Results
de_at: Ergebnis

source: {} for "{}" in "{}" from {} ({} matches in {}({}) files)
de_at: {} nach "{}" in "{}" von {} ({} Treffer in {}({}) Dateien)

source: {} "{}" to "{}" in "{}" from {} ({} changes in {}({}) files)
de_at: {} "{}" nach "{}" in "{}" von {} ({} Änderungen in {}({}) Dateien)

source: [ESC?] Report: {}%
de_at: [Esc?] Bericht: {}%

source: (Report stopped on {}%)
de_at: (Bericht gestoppt bei {}%)

source: No tab for navigation
de_at: Kein Dateireiter für die Navigation

source: No file for navigation
de_at: Keine Datei für die Navigation

source: Line {} has bad data for navigation
de_at: Zeile {} enthält beschädigte Daten für die Navigation

source: Undefined report to jump. Fill new report or navigate with old one.
de_at: Undefinierter Bericht zum Anspringen. Neuen Bericht ausfüllen oder mit altem navigieren.

source: Command doesn't work with multi-carets
de_at: Der Befehl funktioniert nicht mit Multi-Cursor

source: Line "{}":{} has no data for navigation
de_at: Zeile "{}":{} enthält keine Daten für die Navigation

source: No data to jump
de_at: Keine Daten zum Anspringen

source: Line {} has no data for navigation
de_at: Zeile {} enthält keine Daten für die Navigation

source: [ESC?] Search: {}% [found {} matches in {}({}) files]
de_at: [Esc?] Suche: {}% [{} Treffer in {}({}) Dateien gefunden]

source: (Search stopped on {}%)
de_at: (Suche gestoppt bei {}%)

source: Cannot read "{}" (encoding={}/{}): {}
de_at: Kann "{}" nicht lesen (Kodierung={}/{}): {}

source: tab:
de_at: Dateireiter:

source: [ESC?][Found {} file(s) in {} dir(s)] Picking in: {}
de_at: [Esc?][{} Datei(en) in {} Ordner(n)] Einsammeln in: {}

source: (Picking stopped)
de_at: (Einsammeln gestoppt)

source: Stop?
de_at: Stoppen?

source: +All
de_at: +Alle Unterverzeichnisse

source: Only
de_at: Nur Startverzeichnis

source: +1 level
de_at: +1 Ebene

source: +2 levels
de_at: +2 Ebenen

source: +3 levels
de_at: +3 Ebenen

source: +4 levels
de_at: +4 Ebenen

source: +5 levels
de_at: +5 Ebenen

source: Don't skip
de_at: Nicht überspringen

source: -Hidden
de_at: -Versteckt

source: -Binary
de_at: -Binär

source: -Hidden, -Binary
de_at: -Versteckt, -Binär

source: Don't sort
de_at: Nicht sortieren

source: By date, from newest
de_at: Nach Datum absteigend

source: By date, from oldest
de_at: Nach Datum aufsteigend

source: Must update the application
de_at: Programm-Update erforderlich

source: The command works only with reports of FindInFiles plugin
de_at: Der Befehl funktioniert nur mit Berichten des FindInFiles-PlugIns

source: No info to repeat search
de_at: Keine Info für die Suchwiederholung

source: Option allows to save separate search settings (search text, source folder, files mask etc) per each mentioned session or project. Each item in the option is RegEx, which is compared with the full path of session (project). First matched item is used.
de_at: Die Option erlaubt das Speichern separater Sucheinstellungen (Suchmuster, Dateimasken, Verzeichnisse etc.) pro angegebener Sitzung oder Projekt. Jeder Eintrag besteht aus einem Regex, der mit dem vollständigen Pfad der Sitzung (Projekt) verglichen wird. Der erste passende Eintrag wird verwendet.

source: History
de_at: Verlaufsinfo

source: Copy options [.*], [aA], ["w"] from CudaText dialog to plugin's dialog.
de_at: Optionen [.*], [aA], ["w"] vom CudaText-Dialog in den PlugIn-Dialog kopieren.

source: Start
de_at: Starten

source: Use selection text from current file when dialog opens.
de_at: Bei Dialogstart die Textauswahl aus aktueller Datei verwenden.

source: Store Results between dialog call if setting is "[ ]Send".
de_at: Bei Option "[ ]Senden" die Ergebnisse zwischen Dialogaufrufen speichern.

source: List of lexer names to use for report file. First available lexer is used.
de_at: Liste der Lexernamen für die Berichtsdatei. Verwendet wird der 1. verfügbare Lexer.

source: Report
de_at: Bericht

source: Auto-write 'tab_size' to report's lexer-specific config, if no such setting. Use 0 to skip.
de_at: 'tab_size' automatisch in lexerspezifische Konfig des Berichts schreiben, falls diese Einstellung fehlt. Mit '0' überspringen.

source: Allows Esc key to stop all stages of current search. If false, Esc stops only the current stage.
de_at: [Esc]-Taste darf alle Stadien der aktuellen Suche stoppen. Wenn ausgeschaltet, stoppt [Esc] nur das aktuelle Stadium.

source: Searching
de_at: Suche läuft

source: Show report even if nothing found.
de_at: Bericht auch nach erfolgloser Suche anzeigen.

source: [x]Append: Need to fold previous results.
de_at: [x]Anhängen: Muss frühere Ergebnisse falten.

source: Close dialog if search has found matches.
de_at: Dialog nach Suchtreffern schließen.

source: Length of substring (from field "Find"), which appears in the report document title.
de_at: Länge des Teil-Strings (aus Feld "Suchen"), der im Titel des Berichtsdokuments aufscheint.

source: If report document has a filename, save report after filling it.
de_at: Ist das Berichtsdokument benannt, dann nach dem Ausfüllen speichern.

source: Activate document with report after filling it.
de_at: Berichtsdokument nach dem Ausfüllen aktivieren.

source: Save search details ("Find", "In folder", …) in the first line of report. The info will be used in command "Repeat search for this report-tab".
de_at: Suchdetails ("Suchen", "In Verzeichnis", …) in der 1. Zeile des Berichts speichern. Diese Info verwendet der Befehl "Suche wiederholen für diesen Berichts-Dateireiter".

source: Append specified string to the field 'Not in files'.
de_at: Angegebenen String ans Feld "Nicht in Dateien" anhängen.

source: Size of buffer (at file start) to detect binary files.
de_at: Puffergröße (bei Dateistart) zum Erkennen von Binärdateien.

source: If value>0, skip all files, which sizes are bigger than this value (in Kb).
de_at: Wenn Wert>0, dann alle Dateien größer als dieser Wert (KB) überspringen.

source: Default encoding to read files. If value is empty, then the following is used: cp1252 for Linux, preferred encoding from locale for others (Win, macOS, …).
de_at: Standardzeichensatz fürs Lesen von Dateien. Ist der Wert leer, wird Folgendes verwendet: cp1252 für Linux, bevorzugter Zeichensatz vom Gebietsschema für andere (Win, macOS, …).

source: Style to mark found fragment in report. Full form: "fif_mark_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Color values: "" - skip, "#RRGGBB" - hex-digits Values for border sides: "solid", "dash", "2px", "dotted", "rounded", "wave"
de_at: Stil zum Hervorheben gefundener Fragmente im Bericht. Vollständiges Formular: "fif_mark_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Werte für Farben: "" - leer, "#RRGGBB" - Hex-Ziffern Werte für Umrandungsseiten: "solid", "dash", "2px", "dotted", "rounded", "wave"

source: Style to mark replaced fragment in report (unique in line). Full form: "fif_mark_true_replace_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Color values: "" - skip, "#RRGGBB" - hex-digits Values for border sides: "solid", "dash", "2px", "dotted", "rounded", "wave"
de_at: Stil zum Hervorheben ersetzter Fragmente im Bericht (einzig in der Zeile). Vollständiges Formular: "fif_mark_true_replace_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Werte für Farben: "" - leer, "#RRGGBB" - Hex-Ziffern Werte für Umrandungsseiten: "solid", "dash", "2px", "dotted", "rounded", "wave"

source: Style to mark replaced fragment in report (not unique in line). Full form: "fif_mark_false_replace_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Color values: "" - skip, "#RRGGBB" - hex-digits Values for border sides: "solid", "dash", "2px", "dotted", "rounded", "wave"
de_at: Stil zum Hervorheben ersetzter Fragmente im Bericht (nicht einzig in Zeile). Vollständiges Formular: "fif_mark_false_replace_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Werte für Farben: "" - leer, "#RRGGBB" - Hex-Ziffern Werte für Umrandungsseiten: "solid", "dash", "2px", "dotted", "rounded", "wave"

source: To view/edit options install plugin "Options Editor"
de_at: Fürs Bearbeiten der Optionen bitte das Plug-in "Options Editor" installieren

source: "Find in Files" options
de_at: "Find in Files"-Optionen

source: No
de_at: Nein

source: Yes
de_at: Ja

source: No preset to config
de_at: Keine Voreinstellung zu konfigurieren

source: Options is restored from preset
de_at: Optionen importiert aus Voreinstellung

source: &Presets:
de_at: &Voreinstellungen:

source: Move &up
de_at: Hina&uf schieben

source: Move &down
de_at: &Hinunter schieben

source: Clon&e
de_at: Klon&en

source: Dele&te
de_at: &Löschen

source: &What to restore:
de_at: &Was wiederherstellen:

source: With values:
de_at: Mit Werten:

source: Apply
de_at: Anwenden

source: Cancel
de_at: Abbrechen

source: Presets
de_at: Voreinstellungen

source: Save preset
de_at: Voreinstellung speichern

source: &What to save:
de_at: &Was speichern:

source: Options is saved to preset:
de_at: Optionen gespeichert in Voreinstellung:

source: Options is restored from preset:
de_at: Optionen wiederhergestellt aus Voreinstellung:

source: If report will be sent to tab [x] Send then option "Tree type" in dialog "{morp}" allows to set: {shtp}
de_at: Wenn der Bericht in einen Dateireiter gesendet werden soll [x] Senden, dann erlaubt die Option "Baumtyp" im Dialog "{morp}" die Einstellung: {shtp}

source: ┌────────────────────────────┬──────────────┬────────────────────────────┬───────────────────────────────────────────┐ │ Command │ Hotkey │ Trick │ Comment │ ╞════════════════════════════╪══════════════╪════════════════════════════╪═══════════════════════════════════════════╡ │ Find │ Enter │ │ If focus not in Results/Source │ │ Count matches │ Alt+T │ │ │ │ Find filenames │ Ctrl+T │ │ │ ├────────────────────────────┼──────────────┼────────────────────────────┼───────────────────────────────────────────┤ │ Focus to Results │ Ctrl+Enter │ │ If focus not in Results/Source │ │ Open found fragment │ Enter │ │ If focus in Results. Selects the fragment │ │ Close and go to found │ Ctrl+Enter │ │ If focus in Results. Selects the fragment │ │ Close and go to found │ Ctrl+Enter │ │ If focus in Source. Restores selection │ │ Fold Results branch │ Ctrl+= │ │ If focus in Results │ ├────────────────────────────┼──────────────┼────────────────────────────┼───────────────────────────────────────────┤ │ In current file │ Ctrl+Shift+C │ Shift+Сlick "Current" │ │ │ In all tabs │ │ Ctrl +Сlick "Current" │ │ │ In current tab │ │ Ctrl+Shift+Сlick "Current" │ │ │ Choose file │ Ctrl+B │ Shift+Сlick "Browse" │ │ │ Depth "Only" │ Alt+Y │ Ctrl+Num0 │ │ │ Depth "+1 level" │ Alt+! │ Ctrl+Num1 │ │ │ Depth "All" │ Alt+L │ Ctrl+Num9 │ │ ├────────────────────────────┼──────────────┼────────────────────────────┼───────────────────────────────────────────┤ │ Save values as preset │ Ctrl+S │ │ │ │ Presets dialog │ Ctrl+Alt+S │ │ │ │ Use Preset #1(..#5) │ Ctrl+1(..5) │ │ Others from menu/dialog │ │ Use Layout #1(..#5) │ Alt+1(..5) │ │ Others from menu │ ├────────────────────────────┼──────────────┼────────────────────────────┼───────────────────────────────────────────┤ │ ±"Not in"/±"Replace" │ Alt+V │ │ 4-states loop to show/hide │ │ Engine options │ Ctrl+E │ │ │ │ Configure vert. alignments │ │ Ctrl+Сlick "=" │ │ ├────────────────────────────┼──────────────┼────────────────────────────┼───────────────────────────────────────────┤ │ Call CudaText's "Find" │ Ctrl+F │ │ With transfer patern/.*/aA/"w" │ │ Call CudaText's "Replace" │ Ctrl+R │ │ With transfer paterns/.*/aA/"w" │ │ Dialog "Help" │ Alt+H │ │ │ └────────────────────────────┴──────────────┴────────────────────────────┴───────────────────────────────────────────┘
de_at: ┌────────────────────────────┬──────────────┬────────────────────────────┬───────────────────────────────────────────┐ │ Befehl │ Tastenkürzel │ Trick │ Kommentar │ ╞════════════════════════════╪══════════════╪════════════════════════════╪═══════════════════════════════════════════╡ │ Suchen │ Enter │ │ Wenn Fokus nicht im Ergebnis-/Quellepaneel│ │ Treffer zählen │ Alt+T │ │ │ │ Dateinamen suchen │ Strg+T │ │ │ ├────────────────────────────┼──────────────┼────────────────────────────┼───────────────────────────────────────────┤ │ Fokus auf Ergebnis │ Strg+Enter │ │ Wenn Fokus nicht im Ergebnis-/Quellepaneel│ │ Suchtreffer öffnen │ Enter │ │ Fokus in Ergebnis. Wählt den Treffer aus │ │ Schließen und zum Treffer │ Strg+Enter │ │ Fokus in Ergebnis. Wählt den Treffer aus │ │ Schließen und zum Treffer │ Strg+Enter │ │ Fokus in Quelle. Schaltet Auswahl aus │ │ Ergebniszweig falten │ Strg+= │ │ Wenn Fokus im Ergebnispaneel │ ├────────────────────────────┼──────────────┼────────────────────────────┼───────────────────────────────────────────┤ │ In aktueller Datei │ Strg+Shift+C │ Shift+Klick "Aktuell" │ │ │ In allen Dateireitern │ │ Strg +Klick "Aktuell" │ │ │ Im aktuellen Dateireiter │ │ Strg+Shift+Klick "Aktuell" │ │ │ Datei auswählen │ Strg+B │ Shift+Klick "Browse" │ │ │ Tiefe "Nur Startordner" │ Alt+Y │ Strg+Num0 │ │ │ Tiefe "+1 Ebene" │ Alt+! │ Strg+Num1 │ │ │ Tiefe "+Alle Unterordner" │ Alt+L │ Strg+Num9 │ │ ├────────────────────────────┼──────────────┼────────────────────────────┼───────────────────────────────────────────┤ │ Werte als Voreinstellung │ Strg+S │ │ │ │ Voreinstellungsdialog │ Strg+Alt+S │ │ │ │ Voreinst. #1(..#5) anwenden│ Strg+1(..5) │ │ Weitere aus dem Menü/Dialog │ │ Layout #1(..#5) anwenden │ Alt+1(..5) │ │ Weitere aus dem Menü │ ├────────────────────────────┼──────────────┼────────────────────────────┼───────────────────────────────────────────┤ │ ±"Nicht in"/±"Ersetzen" │ Alt+V │ │ 4-Status-Schleife fürs Ein-/Ausblenden │ │ Engine-Optionen │ Strg+E │ │ │ │ Vertik. Ausrichtung konfig.│ │ Strg+Klick "=" │ │ ├────────────────────────────┼──────────────┼────────────────────────────┼───────────────────────────────────────────┤ │ CudaTexts "Suchen" starten │ Strg+F │ │ Mit übertragenem Muster/.*/aA/"w" │ │ CudaTexts "Replace" starten│ Strg+R │ │ Mit übertragenen Mustern/.*/aA/"w" │ │ Dialog "Hilfe" │ Alt+H │ │ │ └────────────────────────────┴──────────────┴────────────────────────────┴───────────────────────────────────────────┘

source: • ".*" - Option "Regular Expression". It allows to use in field "Find what" special symbols: . any character \d digit character (0..9) \w word-like character (digits, letters, "_") In field "Replace with": \1 to insert first found group, \2 to insert second found group, ... See full documentation on page docs.python.org/3/library/re.html • "w" - {word} —————————————————————————————————————————————— • Values in fields "{incl}" and "{excl}" can contain ? for any single char, * for any substring (may be empty), [seq] any character in seq, [!seq] any character not in seq. Note: * matches all names, *.* doesn't match all. • Values in fields "{incl}" and "{excl}" can filter subfolder names if they start with "/". Example. {incl:12}: /a* *.txt {excl:12}: /ab* {fold:12}: c:/root Depth : All Search will consider all *.txt files in folder c:/root and in all subfolders a* except ab*. • Set special value "{tags}" (in short <t> or <Tabs>) for field "{fold}" to search in opened documents. Fields "{incl}" and "{excl}" will be used to filter tab titles, in this case. To search in all tabs, use mask "*" in field "{incl}". See also: menu items under button "=", "Scope". • Set special value "{proj}" (in short <p>) for field "{fold}" to search in project files. See also: menu items under button "=", "Scope". —————————————————————————————————————————————— • "Age" (advanced search options). {olde} • "First" (advanced search options). {frst} —————————————————————————————————————————————— • Long-term searches can be interrupted by ESC. Search has three stages: picking files, finding fragments, reporting. ESC stops any stage. When picking and finding, ESC stops only this stage, so next stage begins. —————————————————————————————————————————————— • Use right click or Context keyboard button to see context menu over these elements "Find", "Replace", "Current", "Browse", Depth combobox —————————————————————————————————————————————— You are welcome to plugin forum. See bottom link.
de_at: • ".*" - Option "Regulärer Ausdruck". Erlaubt spezielle Symbole im Feld "Suchen nach": . ein beliebiges Zeichen \d eine Ziffer (0..9) \w ein Wortzeichen (Ziffer, Buchstabe, '_') Im Feld "Ersetzen durch": \1 um 1. gefundene Gruppe einzufügen, \2 um 2. gefundene Gruppe einzufügen, ... Vgl. komplette Dokumentation auf der Seite docs.python.org/3/library/re.html • "w" - {word} —————————————————————————————————————————————— • Werte in den Feldern "{incl}" und "{excl}" dürfen enthalten: ? für ein einzelnes Zeichen, * für einen Teil-String (kann leer sein), [seq] ein Zeichen aus der Zeichenklasse seq, [!seq] ein Zeichen außerhalb der Zeichenklasse seq. Hinweis: * findet alle Namen, *.* findet nicht alle. • Werte in den Feldern "{incl}" und "{excl}" dürfen Unterverzeichnisnamen filtern, wenn sie mit Slash "/" beginnen. Beispiel: {incl:12}: /a* *.txt {excl:12}: /ab* {fold:12}: c:/root Tiefe : Alle Gesucht werden alle *.txt Dateien im Verzeichnis c:/root und in allen Unterverzeichnissen a* außer in ab*. • Spezialwert "{tags}" (kurz <t> oder <Tabs>) für Feld "{fold}" für die Suche in offenen Dokumenten einstellen. Felder "{incl}" und "{excl}" dienen zum Filtern von Dateireitertiteln. Für die Suche in allen Dateireitern die Maske "*" ins Feld "{incl}" eingeben. Siehe: Befehle im Menü / Bereich. • Spezialwert "{proj}" (kurz <p>) für Feld "{fold}" für die Suche in Projektdateien einstellen. Siehe: Befehle im Menü / Bereich. —————————————————————————————————————————————— • "Alter" (erweiterte Suchoptionen). {olde} • "Die ersten" (erweiterte Suchoptionen). {frst} —————————————————————————————————————————————— • Langandauernde Suchvorgänge können mit [Esc] unterbrochen werden. Die Suche erfolgt in 3 Stadien: Dateien einsammeln, Fragmente (Übereinstimmungen) suchen, Bericht erstellen. [Esc] stoppt jedes Stadium. Beim Einsammeln und Suchen stoppt [Esc] nur dieses Stadium, dann beginnt das nächste. —————————————————————————————————————————————— • Mit Rechtsklick oder Kontext-Taste wird das Kontextmenü der folgenden Kontrollobjekte eingeblendet "Suchen", "Ersetzen", "Aktuell", "...", Tiefe-Combobox —————————————————————————————————————————————— Sie sind im PlugIn-Forum herzlich willkommen. Siehe Hyperlink unten.

source: "Find in Files" help
de_at: "Find in Files"-Hilfe

source: Hotkeys+Tricks
de_at: Tastenkürzel+Tricks

source: Hints
de_at: Hinweise

source: Tree types
de_at: Baumtypen

source: See "mouse_goto_definition" in default.json and user.json
de_at: Vgl. "mouse_goto_definition" in default.json und user.json

source: <no action>
de_at: <keine Aktion>

source: Navigate to same group
de_at: Selbe Gruppe ansteuern

source: Navigate to next group
de_at: Nächste Gruppe ansteuern

source: Navigate to prev group
de_at: Vorige Gruppe ansteuern

source: Navigate to next group, activate
de_at: Nächste Gruppe ansteuern, aktivieren

source: Navigate to prev group, activate
de_at: Vorige Gruppe ansteuern, aktivieren

source: Configure found result navigation by double-click
de_at: Ansteuern des gefundenen Ergebnisses per Doppelklick konfigurieren

source: >[double-click]:
de_at: >[Doppelklick]:

source: >Shift+[double-click]:
de_at: >Shift+[Doppelklick]:

source: >Ctrl+[double-click]:
de_at: >Strg+[Doppelklick]:

source: >Shift+Ctrl+[double-click]:
de_at: >Shift+Strg+[Doppelklick]:

source: >Alt+[double-click]:
de_at: >Alt+[Doppelklick]:

source: >Shift+Alt+[double-click]:
de_at: >Shift+Alt+[Doppelklick]:

source: >Alt+Ctrl+[double-click]:
de_at: >Alt+Strg+[Doppelklick]:

source: >Shift+Ctrl+Alt+[double-click]:
de_at: >Shift+Strg+Alt+[Doppelklick]:

source: Space-separated file or folder masks. Folder mask starts with "/". Double-quote mask, which needs space-char. Use ? for any character and * for any fragment. Note: "*" matchs all names, "*.*" doesnt match all.
de_at: Datei- oder Verzeichnismasken (leerzeichengetrennt). Verzeichnismasken beginnen mit Slash "/". Maske mit Leerzeichen unter "-Anführungszeichen stellen. "?" für jedes Zeichen, "*" für jedes Fragment. Hinweis: "*" findet alle Namen, "*.*" findet nicht alle.

source: Always excluded: {} See option "fif_always_not_in_files" to change.
de_at: Immer ausgeschlossen: {} Vgl. zum Wechseln die Option "fif_always_not_in_files".

source: Regular expression Format for found groups in Replace: \1
de_at: Regulärer Ausdruck Rückbezug auf gefundene Gruppen im Ersetzen-Feld: \1

source: Case sensitive
de_at: Exakte Schreibung beachten

source: Option "Whole words". It is ignored when: Regular expression (".*") is turned on, "Find what" contains not only letters, digits and "_".
de_at: Option "Ganzes Wort". Wird ignoriert, wenn: Regulärer Ausdruck (".*") eingeschaltet ist, "Suchen nach" nur Buchstaben, Ziffern und '_' enthält.

source: Choose folder. Shift+Click or Ctrl+B - Choose file to find in it.
de_at: Verzeichnis auswählen. Shift+Klick oder Strg+B - Datei zum Durchsuchen auswählen.

source: Start folder(s). Space-separated folders. Double-quote folder, which needs space-char. ~ is user Home folder. $VAR or ${{VAR}} is environment variable. {} to search in tabs (in short <Tabs> or <t>). {} to search in project folders (in short <p>).
de_at: Startverzeichnis(se). Leerzeichengetrennte Verzeichnisse. Verzeichnis mit Leerzeichen unter "-Anführungszeichen stellen. ~ ist das 'Home'-Verzeichnis des Benutzers. $VAR oder ${{VAR}} ist Environment-Variable. {} für die Suche in Dateireitern (kurz <Tabs> oder <t>). {} für die Suche in Projektordnern (kurz <p>).

source: Which subfolders will be searched. Alt+Y or Ctrl+Num0 - Apply "Only". Alt+! or Ctrl+Num1 - Apply "+1 level". Alt+L or Ctrl+Num9 - Apply "+All" subfolders.
de_at: Welche Unterverzeichnisse durchsucht werden. Alt+Y oder Strg+Num0 - Angewendet wird "Nur Startverzeichnis". Alt+! oder Strg+Num1 - Angewendet wird "+1 Ebene". Alt+L oder Strg+Num9 - Angewendet wird "+Alle Unterverzeichnisse".
