Repository: CudaText-addons/CudaText-translations
Catalog: translation.*/langpy/*/LC_MESSAGES/cuda_find_*_files4.po
Languages: de_at, ru_ru

source: ┌───────────────────────────────────────┬────────────────────┬───────────────────────────────────┐ │ Command │ Hotkey │ Comment │ ╞═══════════════════════════════════════╪════════════════════╪═══════════════════════════════════╡ │ Find │ Alt+D │ │ │ Find │ Enter │ Except focus in multi-line "Find" │ │ │ │ or in Results or in Source │ │ Find │ F2 │ │ │ Find as fast as posible │ Shift+F2 │ Ignoring the slowing options │ ├───────────────────────────────────────┼────────────────────┼───────────────────────────────────┤ │ Go to next found fragment │ F3 │ │ │ Go to prev found fragment │ Shift+F3 │ │ │ Go to next file(tab) found fragment │ Ctrl+F3 │ │ │ Go to prev file(tab) found fragment │ Ctrl+Shift+F3 │ │ │ Open found fragment in tab │ Enter │ If focus in Results/Source │ │ Open found fragment and close dialog │ Shift+Enter │ If focus in Results/Source │ ├───────────────────────────────────────┼────────────────────┼───────────────────────────────────┤ │ Put focus to Results │ Ctrl+Enter │ Except focus in Results/Source │ │ Move focus: Results >> Source >> Find │ Tab │ │ │ Move focus: Results << Source << Find │ Shift+Tab │ │ ├───────────────────────────────────────┼────────────────────┼───────────────────────────────────┤ │ Show history of search patterns │ Alt+↓ │ If focus in "Find" │ │ Loop over all Depth values │ Ctrl+↓/↑ │ │ ├───────────────────────────────────────┼────────────────────┼───────────────────────────────────┤ │ Choose folder │ Ctrl+B │ │ │ Choose file │ Ctrl+Shift+B │ │ │ Use folder of the current file │ Ctrl+U │ │ │ To search in the current tab │ Ctrl+Shift+U │ │ │ To search in the current Source │ F11 │ │ │ To search in the current Source and │ │ │ │ current lexer path │ Shift+F11 │ │ │ Append newline char "§" to "Find" │ Shift+Enter │ If focus in sigle-line "Find" │ ├───────────────────────────────────────┼────────────────────┼───────────────────────────────────┤ │ Fold/Unfold the caret branch │ Ctrl+= │ If focus in Results │ │ Fold/Unfold all branches │ Ctrl+Shift+= │ By state of the caret branch │ ├───────────────────────────────────────┼────────────────────┼───────────────────────────────────┤ │ Load preset #1/#2/../#9 │ Ctrl+1/2/../9 │ All presets via menu │ │ Create new preset │ Ctrl+S │ │ │ Choose preset to apply │ Alt+S │ │ │ Restore prev/next executed parameters │ Alt+←/→ │ │ ├───────────────────────────────────────┼────────────────────┼───────────────────────────────────┤ │ Append macro var to current field │ Ctrl+A │ If focus in editable field │ │ Show fields after macros substitution │ Ctrl+Shift+A │ │ ├───────────────────────────────────────┼────────────────────┼───────────────────────────────────┤ │ Expand/Shrink Results height │ Ctrl+Alt+↓/↑ │ │ │ Expand/Shrink dialog height │ Shift+Alt+↓/↑ │ │ │ Expand/Shrink dialog width │ Shift+Alt+→/← │ │ │ Expand/Shrink height of │ │ │ │ multi-line "Find" │ Shift+Ctrl+Alt+↓/↑ │ If multi-line "Find" is visible │ ├───────────────────────────────────────┼────────────────────┼───────────────────────────────────┤ │ Show engine options │ Ctrl+E │ │ │ Show dialog "Help" │ Ctrl+H │ │ ├───────────────────────────────────────┼────────────────────┼───────────────────────────────────┤ │ Call CudaText's "Find" dialog │ Ctrl+F │ And copy pattern and │ │ Call CudaText's "Replace" dialog │ Ctrl+R │ search options │ └───────────────────────────────────────┴────────────────────┴───────────────────────────────────┘
ru_ru: ┌────────────────────────────────────────┬──────────────────────┬──────────────────────────────────────┐ │ Команда │ Хоткей │ Комментарий │ ╞════════════════════════════════════════╪══════════════════════╪══════════════════════════════════════╡ │ Поиск │ Alt+D │ │ │ Поиск │ ВВОД │ Кроме фокуса в многострочном поле │ │ │ │ или в Результатах/Исходнике │ │ Поиск │ F2 │ │ │ Быстрый поиск │ Shift+F2 │ Игнорируя замедляющие параметры │ ├────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ К следующему найденному фрагменту │ F3 │ │ │ К предыдущему найденному фрагменту │ Shift+F3 │ │ │ К следующему файлу/табу с фрагментом │ Ctrl+F3 │ │ │ К предыдущему файлу/табу с фрагментом │ Ctrl+Shift+F3 │ │ │ Открыть найденный фрагмент в табе │ ВВОД │ If focus in Results/Source │ │ Открыть найденный фрагмент в табе и │ Shift+ВВОД │ If focus in Results/Source │ │ закрыть диалог │ │ │ ├────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ Фокус в Результаты │ Ctrl+ВВОД │ Кроме фокуса в Результатах/Исходнике │ │ Фокус: Результаты > Исходник > Шаблон │ ТАБ │ │ │ Фокус: Результаты < Исходник < Шаблон │ Shift+ТАБ │ │ ├────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ Показать историю шаблонов │ Alt+↓ │ Если фокус в шаблоне │ │ Циклически менять глубину поиска │ Ctrl+↓/↑ │ │ ├────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ Выбрать папку │ Ctrl+B │ │ │ Выбрать файл │ Ctrl+Shift+B │ │ │ Использовать папку текущего файла │ Ctrl+U │ │ │ Подготовить поиск в текущем табе │ Ctrl+Shift+U │ │ │ Подготовить поиск в текущем Исходнике │ F11 │ │ │ Подготовить поиск в текущем Исходнике │ │ │ │ и текущем лексер-пути │ Shift+F11 │ │ │ Добавить "§" в конец шаблона │ Shift+ВВОД │ Если фокус в однострочном шаблоне │ ├────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ Свернуть/развернуть ветку Результатов │ Ctrl+= │ Если фокус в Результатах │ │ Свернуть/развернуть все ветки │ Ctrl+Shift+= │ По состоянию текущей ветки │ ├────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ Примененить пресет #1/#2/../#9 │ Ctrl+1/2/../9 │ Эти и остальные пресеты есть в меню │ │ Создать пресет │ Ctrl+S │ │ │ Выбрать пресет для применения │ Alt+S │ │ │ Восстановить параметры предыд. поиска │ Alt+←/→ │ │ ├────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ Добавить макрос в текущее поле │ Ctrl+A │ Если фокус в редактируемом поле │ │ Подставить все макросы │ Ctrl+Shift+A │ │ ├────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ Увеличить/уменьшить высоту Результатов │ Ctrl+Alt+↓/↑ │ │ │ Увеличить/уменьшить высоту диалога │ Shift+Alt+↓/↑ │ │ │ Увеличить/уменьшить ширину диалога │ Shift+Alt+→/← │ │ │ Увеличить/уменьшить высоту │ │ │ │ многострочного поля для шаблона │ Shift+Ctrl+Alt+↓/↑ │ Если отображается многострочное поле │ ├────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ Показать Глубокие настройки │ Ctrl+E │ │ │ Показать Справку │ Ctrl+H │ │ ├────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ Перейти в "Поиск" CudaText │ Ctrl+F │ С переносом шаблона и части │ │ Перейти в "Замены" CudaText │ Ctrl+R │ параметров поиска │ └────────────────────────────────────────┴──────────────────────┴──────────────────────────────────────┘

source: DLG_HELP_KEYS
ru_ru: ┌────────────────────────────────────────┬──────────────────────┬──────────────────────────────────────┐ │ Команда │ Хоткей │ Комментарий │ ╞════════════════════════════════════════╪══════════════════════╪══════════════════════════════════════╡ │ Поиск │ Alt+D │ │ │ Поиск │ ВВОД │ Кроме фокуса в многострочном поле │ │ │ │ или в Результатах/Исходнике │ │ Поиск │ F2 │ │ │ Быстрый поиск │ Shift+F2 │ Игнорируя замедляющие параметры │ ├────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ К следующему найденному фрагменту │ F3 │ │ │ К предыдущему найденному фрагменту │ Shift+F3 │ │ │ К следующему файлу/табу с фрагментом │ Ctrl+F3 │ │ │ К предыдущему файлу/табу с фрагментом │ Ctrl+Shift+F3 │ │ │ Открыть найденный фрагмент в табе │ ВВОД │ If focus in Results/Source │ │ Открыть найденный фрагмент в табе и │ Shift+ВВОД │ If focus in Results/Source │ │ закрыть диалог │ │ │ ├────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ Фокус в Результаты │ Ctrl+ВВОД │ Кроме фокуса в Результатах/Исходнике │ │ Фокус: Результаты > Исходник > Шаблон │ ТАБ │ │ │ Фокус: Результаты < Исходник < Шаблон │ Shift+ТАБ │ │ ├────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ Показать историю шаблонов │ Alt+↓ │ Если фокус в шаблоне │ │ Циклически менять глубину поиска │ Ctrl+↓/↑ │ │ ├────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ Выбрать папку │ Ctrl+B │ │ │ Выбрать файл │ Ctrl+Shift+B │ │ │ Использовать папку текущего файла │ Ctrl+U │ │ │ Подготовить поиск в текущем табе │ Ctrl+Shift+U │ │ │ Подготовить поиск в текущем Исходнике │ F11 │ │ │ Подготовить поиск в текущем Исходнике │ │ │ │ и текущем лексер-пути │ Shift+F11 │ │ │ Добавить "§" в конец шаблона │ Shift+ВВОД │ Если фокус в однострочном шаблоне │ ├────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ Свернуть/развернуть ветку Результатов │ Ctrl+= │ Если фокус в Результатах │ │ Свернуть/развернуть все ветки │ Ctrl+Shift+= │ По состоянию текущей ветки │ ├────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ Примененить пресет #1/#2/../#9 │ Ctrl+1/2/../9 │ Эти и остальные пресеты есть в меню │ │ Создать пресет │ Ctrl+S │ │ │ Выбрать пресет для применения │ Alt+S │ │ │ Восстановить параметры предыд. поиска │ Alt+←/→ │ │ ├────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ Добавить макрос в текущее поле │ Ctrl+A │ Если фокус в редактируемом поле │ │ Подставить все макросы │ Ctrl+Shift+A │ │ ├────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ Увеличить/уменьшить высоту Результатов │ Ctrl+Alt+↓/↑ │ │ │ Увеличить/уменьшить высоту диалога │ Shift+Alt+↓/↑ │ │ │ Увеличить/уменьшить ширину диалога │ Shift+Alt+→/← │ │ │ Увеличить/уменьшить высоту │ │ │ │ многострочного поля для шаблона │ Shift+Ctrl+Alt+↓/↑ │ Если отображается многострочное поле │ ├────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ Показать Глубокие настройки │ Ctrl+E │ │ │ Показать Справку │ Ctrl+H │ │ ├────────────────────────────────────────┼──────────────────────┼──────────────────────────────────────┤ │ Перейти в "Поиск" CudaText │ Ctrl+F │ С переносом шаблона и части │ │ Перейти в "Замены" CudaText │ Ctrl+R │ параметров поиска │ └────────────────────────────────────────┴──────────────────────┴──────────────────────────────────────┘

source: DLG_HELP_FIND
ru_ru: Строка для поиска (шаблон) может быть многострочной. Кнопка "+" переключает поле для шаблона из однострочного в многострочный и обратно. В однострочном поле разрывы строк отображаются как §. ———————————————————————————————————————————————————————————————————————————————————————————— Некоторые опции поиска доступны через меню. · Сортировка файлов по дате модификации. · Пропуск старых файлов. · Пропуск скрытых/двоичных файлы. · Фильтры по "Синтаксическим элементам" (комментарии или литеральные строки). · План применения кодировок Внимание! Нужна осторожность при настройке фильтров "Синтаксические элементы". Эти фильтры значительно замедляют поиск. Текущие нетривиальные настройки поиска отображаются в инфобаре (левее кнопки "Поиск"). ↓↓ Искать, начиная с новейших файлов. ↑↑ Искать, начиная с старейших файлов. <4д Пропускать файлы старше 4 дней. <3нед Пропускать файлы старше 3 недель. <2мес Пропускать файлы старше 2 месяцев. <1г Пропускать файлы старше 1 года. -h Пропускать скрытые файлы. -b Пропускать двоичные файлы. /*?*/ Искать только в комментариях. ?/**/? Искать только вне комментариев. "?" Искать только в литеральных строках. ?""? Искать только вне литеральных строк. /*?*/ "?" Искать только в комментариях ИЛИ в литеральных строках. ?/**/? ?""? Искать только вне комментариев И вне литеральных строк. Кроме того инфобар показывает другие настройки: <>> Добавлять лексер-пути для всех найденных фрагментов. (2:cp866) Какие кодировки заданы масками файлов. utf8 Кодировка первого шага из "Плана кодировок". Клик ПКМ на инфобаре показывает локальное меню "{OTH4FND}". Двойной клик на инфобаре сбрасывает настройки поиска. ———————————————————————————————————————————————————————————————————————————————————————————— Строка "{tabs}" в поле "{fold}" позволяет искать по табам (открытым документам). В этом случае в полях "{incl}" и "{excl}" задаются фильтры на имена табов. Для поиска по всем табам в поле "{incl}" задайте "*". См. также: Команды из подменю "Место поиска". Хоткей Ctrl+Shift+U. ———————————————————————————————————————————————————————————————————————————————————————————— В полях "{incl}" и "{excl}" могут применяться следующие специальные строки ? для обозначения любого символа, * для обозначения любой подстроки (может быть даже пустой), [seq] любой символ из перечисленных в seq, [!seq] любой символ, кроме перечисленных в seq. Двойные кавычки позволяют задать значение, содержащее пробел(ы). Замечание: * задает все имена файлов, *.* задает не все имена файлов (только с точкой внутри). Еще в этих полях могут указываться имена подпапок. Для этого имя должно начинаться с "/". Пример. {incl:12}: /a* *.txt {excl:12}: /ab* {fold:12}: c:/root Глубина : Все подпапки Поиск будет идти в файлах "*.txt" из папки c:/root во всех ее подпапках a* кроме ab*. Еще в этих полях могут быть фильтры на лексер-пути. Каждый такой фильтр окружен "[:" и ":]". Тело фильтра - это строка похожая на путь. Элементы фильтра: > разделитель узлов пути. Пример: "a>b>c" - узел "c" лежит в "b", "b" лежит в "a". >> глубокое вхождение. Пример: "a>>c" - узел "c" лежит в ветке "a". word имя узла. *word частичное имя узла. word* частичное имя узла. Пробелы вокруг ">" игнорируются. Поэтому "a>>b>c" и "a > > b > c" действуют одинаково. Лексер-путь очередного фрагмента подходит для фильтра, если его начальные сегменты совпадают со всеми сегментами фильтра. Например, путь "aa>bb>cc>dd" подходит для фильтров "aa" "*a" "*>b*" ">>cc" ">>cc>*d" и не подходит для фильтров "bb" "*>b" ">>c>dd" Пример. {incl:12}: *.py [:def main:] {excl:12}: [:def main>>class*:] {fold:12}: <tabs> Поиск будет идти в открытых файлах "*.py" и будет искать только внутри глобальной функции "main", но не в классах, определенных внутри нее. Внимание! Нужна осторожность при использовании фильтров по лексер-путям. Эти фильтры значительно замедляют поиск. ———————————————————————————————————————————————————————————————————————————————————————————— ".*" - опция "Регулярное выражение". Она позволяет применять в поле "{find}" специальные символы. В частности, такие: . любой символ \d цифра (0..9) \w символ слова (цифра, буква, "_") См. глубокая опция "re_verbose" для работы со сложными рег. выражениями. См. полную документацию о применяемой версии рег. выражений (по-английски) docs.python.org/3/library/re.html Если опция ".*" выключена, шаблон может содержать следующие специальные символы: | деление шаблона на части для поиска одной из них & деление шаблона на части для поиска их всех См. глубокую опцию "any_all_parts", которая позволяет включить это поведение. Символы "|" применяются первыми, а "&" - вторыми. Чтобы искать сами спец. символы, дополните их обратными слешами: "\|", "\&". Пример. Искать: abc|xyz Найдутся: "abc cba", "zyx xyz", "_abc_xyz_" Искать: abc&xyz Найдутся: "abc xyz", "_xyz_abc_" Замечание. Опция "w" (полное слово) относится к каждой из частей, на которые "|" и "&" поделят шаблон. Если одна из этих частей будет содержать символы, не встречающиеся в словах, то опция "w" будет игнорироваться целиком. ———————————————————————————————————————————————————————————————————————————————————————————— Долгий поиск можно прервать с помощью ESC.
