Repository: CudaText-addons/CudaText-translations
Catalog: translation.*/langpy/*/LC_MESSAGES/cuda_find_*_files4.po
Languages: de_at, ru_ru

source: To view/edit options install plugin "Options Editor"
de_at: Fürs Anzeigen/Bearbeiten der Optionen bitte das Plug-in "Options Editor" installieren
ru_ru: Для просмотра/редактирования опций установите плагин "Options Editor"

source: [{}] Options
de_at: [{}]-Optionen

source: Hotkeys
de_at: Tastenkürzel
ru_ru: Хоткеи

source: Search
de_at: Suchen
ru_ru: Поиск

source: Replace
de_at: Ersetzen

source: Results
de_at: Ergebnis
ru_ru: Результаты

source: Speed
de_at: Geschwindigkeit
ru_ru: Время

source: History
de_at: Versionsinfo
ru_ru: История

source: [{}] Help
de_at: [{}]-Hilfe

source: No presets to run
de_at: Keine Voreinstellungen auszuführen

source: Choose preset to run
de_at: Voreinstellung zum Ausführen auswählen

source: detect
de_at: ermitteln

source: A&ge of files
de_at: Alter der &Dateien
ru_ru: Возраст файлов

source: d
de_at: t
ru_ru: д

source: y
de_at: j
ru_ru: г

source: hour(s)
de_at: Stunde(n)
ru_ru: час(а)

source: day(s)
de_at: Tag(e)
ru_ru: день/дней

source: week(s)
de_at: Woche(n)
ru_ru: неделя(и)

source: month(s)
de_at: Monat(e)
ru_ru: месяц(а)

source: year(s)
de_at: Jahr(e)
ru_ru: год(а)

source: +All subfolders
de_at: +Alle Unterverzeichnisse
ru_ru: +Все подпапки

source: Only start dir
de_at: Nur Startverzeichnis
ru_ru: Начальная папка

source: +1 level
de_at: +1 Ebene
ru_ru: +1 уровень

source: +2 levels
de_at: +2 Ebenen
ru_ru: +2 уровня

source: +3 levels
de_at: +3 Ebenen
ru_ru: +3 уровня

source: +4 levels
de_at: +4 Ebenen
ru_ru: +4 уровня

source: +5 levels
de_at: +5 Ebenen
ru_ru: +5 уровней

source: S&ort collected files
de_at: Gesammelte Dateien s&ortieren
ru_ru: Сортировать найденные файлы

source: Don'&t sort
de_at: Nich&t sortieren
ru_ru: Без сортировки

source: S&ort, newest first
de_at: Nach Datum absteigend s&ortieren
ru_ru: Сортировать, начиная с новых

source: Sort, o&ldest first
de_at: Nach Datum a&ufsteigend sortieren
ru_ru: Сортировать, начиная со старых

source: Skip &hidden/binary files
de_at: Versteckte/&binäre Dateien überspringen
ru_ru: Пропускать скрытые/двоичные файлы

source: Don'&t skip
de_at: Nich&t überspringen
ru_ru: Не пропускать

source: Skip &hidden
de_at: &Versteckte Dateien überspringen
ru_ru: Пропускать скрытые

source: Skip &binary
de_at: &Binärdateien überspringen
ru_ru: Пропускать двоичные

source: Skip hidden &and binary
de_at: Versteckte &und Binärdateien überspringen
ru_ru: Пропускать скрытые и двоичные

source: S&yntax elements (slowdown)
de_at: S&yntax-Elemente (zeitintensiv)
ru_ru: Синтаксические элементы (долго)

source: Inside &comment
de_at: Innerhalb von &Kommentaren
ru_ru: В комментариях

source: Outside of c&omment
de_at: Außerhalb von K&ommentaren
ru_ru: Вне комментариев

source: Inside literal &string
de_at: Innerhalb von literalen &Strings
ru_ru: В литеральных строках

source: Outside of literal s&tring
de_at: Außerhalb von literalen S&trings
ru_ru: Вне литеральных строк

source: Create
de_at: Erstellen
ru_ru: Создать

source: Save
de_at: Speichern
ru_ru: Сохранить

source: Create new preset
de_at: Neue Voreinstellung erstellen
ru_ru: Создать новый пресет

source: View preset
de_at: Voreinstellung anzeigen
ru_ru: Просмотреть пресет

source: Form position
de_at: Formularposition
ru_ru: Положение формы

source: Form sizes and Results height
de_at: Formularmaße und Ergebnishöhe
ru_ru: Размеры формы и высота Результатов

source: Age:
de_at: Alter:
ru_ru: Возраст:

source: &All ages
de_at: &Jedes Alter

source: Search in files with the age (0 - in all)
de_at: Suchen in Dateien des Alters (0 - in allen)
ru_ru: Искать в файлах (0 - во всех)

source: Encoding for files
de_at: Zeichensatz für Dateien
ru_ru: Кодировка файлов

source: Remove all and save?
de_at: Alle entfernen und speichern?
ru_ru: Удалить все и сохранить?

source: &Add
de_at: &Hinzufügen

source: &Remove
de_at: &Entfernen

source: File mask and encodings
de_at: Dateimaske und Zeichensätze
ru_ru: Кодировки по маскам файлов

source: (analyze file content)
de_at: (Dateiinhalt analysieren)
ru_ru: (анализ содержимого файла)

source: Source encoding for step
de_at: Quellzeichensatz für Schritt
ru_ru: Кодировка исходника для шага

source: &Before:
de_at: &Darüber:
ru_ru: Перед:

source: A&fter:
de_at: Dar&unter:
ru_ru: После:

source: Extra context lines
de_at: Extra-Kontextzeilen
ru_ru: Добавлять строки

source: No yet executed searches
de_at: Noch keine ausgeführten Suchaktionen
ru_ru: Нет выполненных поисков

source: No more executed searches
de_at: Keine weiteren ausgeführten Suchaktionen
ru_ru: Нет других выполненных поисков

source: Executed parameters ({}/{}) is restored
de_at: Ausgeführte Parameter ({}/{}) sind wiederhergestellt
ru_ru: Восстановлены параметры поиска ({}/{})

source: Preset to apply
de_at: Anzuwendende Voreinstellung

source: Preset is saved:
de_at: Voreinstellung ist gespeichert:
ru_ru: Пресет сохранен:

source: No preset
de_at: Keine Voreinstellung
ru_ru: Нет пресетов

source: Remove preset
de_at: Voreinstellung entfernen
ru_ru: Удалить пресет

source: Preset is removed:
de_at: Voreinstellung ist entfernt:
ru_ru: Удален пресет:

source: Preset is loaded:
de_at: Voreinstellung ist geladen:
ru_ru: Применен пресет:

source: Choose file to find in it
de_at: Datei zum Durchsuchen auswählen
ru_ru: Укажите файл для поиска

source: Initial search folder
de_at: Startsuchverzeichnis
ru_ru: Начальная папка для поиска

source: "Replace" is only for single-line Find pattern
de_at: "Ersetzen" gilt nur für einzeiliges "Suchen"-Muster

source: "Replace" is only for "-?+?" mode
de_at: "Ersetzen" gilt nur für Modus "-?+?"

source: "Replace" is for "Syntax elements" turned off
de_at: "Ersetzen" gilt nur für ausgeschaltete Option "Syntax-Elemente"

source: "Replace" is for "Lexer path for all fragments" turned off
de_at: "Ersetzen" gilt nur für ausgeschaltete Option "Lexerpfad für alle Fragmente"

source: Replace all in files/tabs?
de_at: Alle ersetzen in Dateien/Dateireitern?

source: With
de_at: Durch

source: Pattern to replace with.To substitute found RegEx groups: \1, \2, ...To substitute the entire match: \g<0> or \0
de_at: Ersetzungsmuster. Um gefundene Regex-Gruppen zu ersetzen: \1, \2, ... Um den ganzen Suchtreffer zu ersetzen: \g<0> or \0

source: Click or F4 - Start replacementsShift+Click or Shift+F4 - Start emulation: show report of replacements and do not make changes.
de_at: Klick oder F4 - Ersetzungen starten Shift+Klick oder Shift+F4 - Simulation starten: Ersetzungsbericht anzeigen, ohne Änderungen vorzunehmen.

source: Click or Shift+F4 - Start emulation: show report of replacements and do not make changes.
de_at: Klick oder Shift+F4 - Simulation starten: Ersetzungsbericht anzeigen, ohne Änderungen vorzunehmen.

source: R&eplace
de_at: &Ersetzen

source: &Emulate
de_at: &Simulieren

source: With:
de_at: Durch:

source: Replace (EMULATION)
de_at: Ersetzen (SIMULATION)

source: Fill the field "{}"
de_at: Feld "{}" ausfüllen
ru_ru: Заполните поле "{}"

source: masks
de_at: Masken
ru_ru: маски

source: Reset a&ll
de_at: A&lle zurücksetzen
ru_ru: Сбросить все

source: En&codings plan:
de_at: &Kodierungsplan:
ru_ru: План кодировок:

source: Set masks
de_at: Masken definieren
ru_ru: Задать маски

source: Step &1: {}
de_at: Schritt &1: {}
ru_ru: Шаг &1: {}

source: Step &2: {}
de_at: Schritt &2: {}
ru_ru: Шаг &2: {}

source: Step &3: {}
de_at: Schritt &3: {}
ru_ru: Шаг &3: {}

source: Use &default steps: {}
de_at: Stan&dardschritte verwenden: {}
ru_ru: Стандартные шаги: {}

source: Show relati&ve paths
de_at: Relati&ve Pfade anzeigen
ru_ru: Показывать относительные пути

source: Show &modification time
de_at: Änderungsdatu&m anzeigen
ru_ru: Показывать время модификации

source: Results &tree:
de_at: Ergebnis&baum:
ru_ru: Дерево Результатов:

source: Show le&xer path for all fragments (slowdown)
de_at: Le&xerpfad für alle Fragmente anzeigen (zeitintensiv)
ru_ru: Показывать лексер-пути для всех фрагментов (долго)

source: Add le&xer path to file path in the statusbar
de_at: Le&xerpfad zum Dateipfad in der Statusleiste hinzufügen

source: Go to next found fragment
de_at: Geh zum nächsten gefundenen Fragment
ru_ru: К следующему найденному фрагменту

source: Go to prev found fragment
de_at: Geh zum vorigen gefundenen Fragment
ru_ru: К предыдущему найденному фрагменту

source: Go to next tab/file found fragment
de_at: Geh zum nächsten gefundenen Dateireiter-/Datei-Fragment
ru_ru: К следующему файлу/табу с фрагментом

source: Go to prev tab/file found fragment
de_at: Geh zum vorigen gefundenen Dateireiter-/Datei-Fragment
ru_ru: К предыдущему файлу/табу с фрагментом

source: Open found fragment in tab
de_at: Gefundenes Fragment im Dateireiter öffnen
ru_ru: Открыть найденный фрагмент в табе

source: Prepare to search in the So&urce
de_at: Vorbereiten auf die Suche in der &Quelldatei
ru_ru: Подготовить поиск в этом Исходнике

source: Prepare to search in the Sou&rce and the lexer path
de_at: Vorbereiten auf die Suche in der Q&uelldatei und im Lexerpfad
ru_ru: Подготовить поиск в этом Исходнике и в этом лексер-пути

source: Copy Results to new tab
de_at: Ergebnis in einen neuen Dateireiter kopieren
ru_ru: Перенести Результаты в новый таб

source: Choose start &folder
de_at: Start&verzeichnis auswählen
ru_ru: Укажите папку для поиска

source: Choose fil&e to find in it
de_at: Dat&ei zum Durchsuchen auswählen
ru_ru: Укажите файл для поиска

source: C&ut last folder segment
de_at: Letztes Verzeichnissegment ausschneiden

source: Use folder of the &current file
de_at: Verzei&chnis der aktuellen Datei verwenden
ru_ru: Использовать папку текущего файла

source: Prepare a search in the current f&ile (on disk)
de_at: Eine Suche in der aktuellen Date&i (auf Disk) vorbereiten
ru_ru: Подготовить поиск в текущем файла (с диска)

source: Prepare a search in the current ta&b (in memory)
de_at: Eine Suche im aktuellen Dateireiter (im RAM) vor&bereiten
ru_ru: Подготовить поиск в текущем файла (в памяти)

source: Prepare a search in &all tabs (in memory)
de_at: Eine Suche in &allen Dateireitern (im RAM) vorbereiten
ru_ru: Подготовить поиск по всем табам (в памяти)

source: swaps with
de_at: tauscht mit

source: Restore prev ({}/{}) executed parameters
de_at: Die vorher ({}/{}) ausgeführten Parameter wiederherstellen
ru_ru: Восстановить предыдущие ({}/{}) параметры поиска

source: Restore next ({}/{}) executed parameters
de_at: Die nächsten ({}/{}) ausgeführten Parameter wiederherstellen
ru_ru: Восстановить следующие ({}/{}) параметры поиска

source: &Create new preset
de_at: &Neue Voreinstellung erstellen
ru_ru: Создать пресет

source: &Remove preset
de_at: Voreinstellung entfe&rnen
ru_ru: Удалить пресет

source: &View preset
de_at: &Voreinstellung anzeigen
ru_ru: Просмотреть пресет

source: Change preset &position
de_at: &Position der Voreinstellung wechseln

source: Choo&se preset
de_at: Voreinstellung au&swählen
ru_ru: Выбрать пресет

source: &Append macro var
de_at: Makrovariable &anhängen

source: Define n&ew custom var
de_at: N&eue eigene Variable definieren
ru_ru: Создать новый макрос

source: Chan&ge/remove custom var
de_at: Ei&gene Variable ändern/entfernen
ru_ru: Изменить/удалить макрос

source: E&xpand all vars
de_at: Alle Variablen er&weitern
ru_ru: Подставить значения всех макросов

source: Help
de_at: Hilfe
ru_ru: Справка

source: Sco&pe
de_at: &Bereich
ru_ru: Место поиска

source: Pre&sets
de_at: Vorein&stellungen
ru_ru: Пресеты

source: Macro v&ars
de_at: Makrov&ariablen
ru_ru: Макросы

source: Engine options.&..
de_at: Engine-Optionen.&..
ru_ru: Глубокие настройки...

source: Replace with...
de_at: Ersetzen durch...

source: Emulate Replace with...
de_at: Ersetzen durch... simulieren

source: Fast search (ignore some options)
de_at: Schnellsuche (ignoriert einige Optionen)
ru_ru: Быстрый поиск (без замедляющих параметров)

source: Menu
de_at: Menü
ru_ru: Меню

source: Fragments?
de_at: Fragmente?
ru_ru: Фрагментов?

source: [Filtered /] Found fragments
de_at: (Gefilterte/)Gefundene Fragmente
ru_ru: [Отфильтрованных /] Найденных фрагментов

source: Files?
de_at: Dateien?
ru_ru: Файлов?

source: Reported / Parsed [/ Stacked] files
de_at: Berichtete/Durchsuchte(/Gesammelte) Dateien
ru_ru: Выданных / Просмотренных [/ Найденных] файлов

source: Dirs?
de_at: Verzeichnisse?
ru_ru: Папок?

source: Reported [/ Stacked] dirs
de_at: Berichtete(/Gesammelte) Verzeichnisse
ru_ru: Выданных [/ Найденных] папок

source: Last act duration
de_at: Dauer der letzten Aktion
ru_ru: Длительность последнего действия

source: Name "{}" is already used
de_at: Name "{}" ist bereits vergeben
ru_ru: Имя "{}" уже используется

source: Val&ue:
de_at: &Wert:
ru_ru: Значение:

source: Add &var
de_at: &Variable hinzufügen
ru_ru: Вставить макрос

source: Add &path
de_at: &Pfad hinzufügen
ru_ru: Вставить путь

source: Remove
de_at: Entfernen
ru_ru: Удалить

source: Remove?
de_at: Entfernen?
ru_ru: Удалить?

source: Append macro vars
de_at: Makrovariablen anhängen
ru_ru: Вставить макрос

source: Stop {self.observer.step_name[-1]}?
de_at: {self.observer.step_name[-1]} stoppen?

source: Stop?
de_at: Stoppen?
ru_ru: Остановить?

source: Fix quotes in the field "{}"
de_at: Anführungszeichen im Feld "{}" reparieren
ru_ru: Исправьте кавычки в поле "{}"

source: Fix EOL in the field "{}"
de_at: Zeilenschaltungszeichen im Feld "{}" reparieren

source: Set correct "{}" reg.ex. Error: {}
de_at: Korrekten "{}"-Regex definieren. Fehler: {}
ru_ru: Исправьте рег.выражение "{}" Ошибка: {}

source: Set not included folders
de_at: Nicht-inkludierte Verzeichnisse festlegen
ru_ru: Используйте папки не вложенные друг в друга

source: Emulation terminated
de_at: Simulation abgebrochen

source: Emulation completed
de_at: Simulation abgeschlossen

source: Replacements terminated
de_at: Ersetzungen abgebrochen

source: Replacements completed
de_at: Ersetzungen abgeschlossen

source: Search terminated
de_at: Suche abgebrochen

source: Search completed
de_at: Suche abgeschlossen

source: Skip "{}" item: {}
de_at: "{}"-Eintrag überspringen: {}
ru_ru: Пропущен элемент "{}" из: {}

source: styles
de_at: Stilen
ru_ru: стили

source: +EMULATION: Replace
de_at: +SIMULATION: Ersetzen

source: +Replace
de_at: +Ersetzen

source: +Search
de_at: +Suche
ru_ru: +Поиск

source: when
de_at: wenn

source: . Report with
de_at: . Bericht mit
ru_ru: . Результаты с

source: NOTE: Skipping option "skip hidden files/dirs". Pass the warning to app author.
de_at: HINWEIS: Option "skip hidden files/dirs" wird übersprungen. Schicken Sie die Warnung an den Programmautor.

source: The option allows to save separate search settings (pattern, files mask, folders etc) per each mentioned session or project. Each item in the option is a pair (Prefix,RegEx). RegEx is compared with the full path of session (project) file. First matched item is used. Prefix is appended to keys. Example. If session path includes "cudatext" then value {"cuda":"cuda"} changes storing key "in_what" to "cuda:in_what"
de_at: Die Option erlaubt das Speichern separater Sucheinstellungen (Suchmuster, Dateimasken, Verzeichnisse etc.) pro angegebener Sitzung oder angegebenem Projekt. Jeder Eintrag besteht aus einem Paar (Präfix,Regex). Der Regex wird mit dem vollständigen Pfad der Sitzungs-/Projektdatei verglichen. Der erste passende Eintrag wird verwendet. Das Präfix wird an die Schlüsselwörter angehängt. Beispiel: Enthält der Sitzungspfad "cudatext", dann ändert der Wert {"cuda":"cuda"} den Speicherungsschlüssel "in_what" zu "cuda:in_what"

source: Use selected text from document for the field "Find".
de_at: Textauswahl aus dem Dokument für das Feld "Suchen nach" verwenden.
ru_ru: Использовать выделенный в документе текст для начального заполнения поля "Искать".

source: Start
de_at: Starten
ru_ru: Начало

source: Append specified string to the field "Ex".
de_at: Angegebenen String ans Feld "Exkl." anhängen.
ru_ru: Добавлять к содержимому поля "Кроме".

source: Separate search stage, which collects all suitable files first.
de_at: Separates Suchstadium, das alle passenden Dateien zuerst einsammelt.
ru_ru: Сначала собрать все файлы, потом искать в них.

source: Start file picking from the deepest folders.
de_at: Dateisuche auf der untersten Verzeichnisebene beginnen.
ru_ru: Начинать поиск с самых дальних от исходной папки папок.

source: Allow comments in multi-line reg-exp. Whitespaces are ignored, except when in a character class or when preceded by an unescaped backslash. All characters from the leftmost "#" through the end of the line are ignored. Example. Single-line "\d\w+$" is same as multi-line reg-exp \d # Start digit \w+ # Some letters $ # End of source
de_at: In mehrzeiligen Regulären Ausdrücken sind Kommentare erlaubt. Leerzeichen werden ignoriert, außer in einer Zeichenklasse oder 'escaped' (geschützt mit vorangestellem Backslash). Alle Zeichen ab ganz linker Raute "#" bis zum Zeilenende werden ignoriert. Beispiel: Der einzeilige Regex "\d\w+$" entspricht dem mehrzeiligen \d # eine Ziffer \w+ # gefolgt von Wortzeichen $ # am Zeilenende
ru_ru: Разрешить комментарии в многострочных рег. выражениях. Пробелы игнорируются вне классов и без предшествующего обратного слеша. Тест от первого "#" до конца строки игнорируется. Пример. Однострочное выражение "\d\w+$" совпадает с многострочным \d # Начальная цифра \w+ # Несколько букв $ # Конец строки

source: When reg-exp is off, option allows to separate pattern text into "parts" and search any/all of them: "|" - find any of right/left parts, "&" - find all of right/left parts. If pattern text has both symbols "|" and "&", "|" separates first. If the option is off, symbols "|" and "&" don't have special meaning.
de_at: Wenn Regex ausgeschaltet ist, erlaubt die Option, Mustertext in "parts" aufzuteilen und nach einem Teil oder allen Teilen zu suchen: "|" - Sucht einen der rechten/linken Teile, "&" - Sucht alle rechten/linken Teile. Kommen beide Symbole "|" und "&" im Suchmuster vor, hat "|" Priorität. Bei ausgeschalteter Option haben die Symbole "|" und "&" keine spezielle Bedeutung.
ru_ru: Если опция Рег.выражение отключена, эта опция позволяет разбивать шаблон на части и искать все/любые из них: "|" - искать одну из частей, "&" - искать все части. Если шаблон содержит сразу "|" и "&", то "|" разбивает первой. Если опция выключена, символы "|" и "&" используются как обычные знаки.

source: Size of buffer (at file start) to detect binary files.
de_at: Puffergröße (bei Dateistart) zum Erkennen von Binärdateien.
ru_ru: Размер начальной части файла, по которой выводится его двоичность.

source: If value>0, skip all files, which sizes are bigger than this value (in Kb).
de_at: Wenn Wert>0, dann alle Dateien größer als dieser Wert (KB) überspringen.
ru_ru: Если значение>0, то пропускать все файлы, размер которых превосходит это значение (в Kb).

source: Default encoding to read files. If value is empty, then the following is used: cp1252 for Linux, preferred encoding from locale for others (Win, macOS, …).
de_at: Standardzeichensatz fürs Lesen von Dateien. Ist der Wert leer, wird Folgendes verwendet: cp1252 für Linux, bevorzugter Zeichensatz aus dem Gebietsschema für andere (Win, macOS, …).
ru_ru: Стандартная кодировка для чтения файлов. При пустом значении будут использоваться: cp1252 для Linux, предпочтительная кодировка локали для остальных (Win, macOS, …).

source: List of source file lexers. For these lexers extra filters and info will work as: Search by lexer tree path, Search inside/outside of comments and/or literal strings. Empty list - allow all lexers.
de_at: Lexerliste der Quelldateien. Für diese Lexer funktionieren Extrafilter und -info wie folgt: Suche per Lexerbaumpfad, Suche inner-/außerhalb von Kommentaren und/oder literalen Strings. Leere Liste - alle Lexer sind erlaubt.

source: List of lexers for Results. First available lexer is used.
de_at: Lexerliste für die Ergebnisanzeige. Verwendet wird der 1. verfügbare Lexer.
ru_ru: Список лексеров для расцветки Результатов. Будет применяться первый доступный из этого списка.

source: Style to mark found fragment in the Results panel. Full form: "mark_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Color values: "" - skip, "#RRGGBB" - hex-digits Values for border sides: "solid", "dash", "2px", "dotted", "rounded", "wave"
de_at: Stil zum Hervorheben gefundener Fragmente im Ergebnispaneel. Vollständiges Formular: "mark_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Werte für Farben: "" - keine Farbe, "#RRGGBB" - Hex-Ziffern Werte für Rahmenseiten: "solid", "dash", "2px", "dotted", "rounded", "wave"
ru_ru: Стили для маркировки найденного фрагмента в Результатах. Полная форма: "mark_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Формат задания цвета: "" - пропустить, "#RRGGBB" - hex-цифры Значения для границ: "solid", "dash", "2px", "dotted", "rounded", "wave"

source: Style to mark found-to-replace fragment in the Results panel. Full form: "mark_fnd2rpl_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "font_strikeout":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Color values: "" - skip, "#RRGGBB" - hex-digits Values for border sides: "solid", "dash", "2px", "dotted", "rounded", "wave"
de_at: Stil zum Hervorheben zu ersetzender Fragmente im Ergebnispaneel. Vollständiges Formular: "mark_fnd2rpl_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "font_strikeout":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Werte für Farben: "" - keine Farbe, "#RRGGBB" - Hex-Ziffern Werte für Rahmenseiten: "solid", "dash", "2px", "dotted", "rounded", "wave"

source: Style to mark replaced fragment in the Results panel. Full form: "mark_replaced_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Color values: "" - skip, "#RRGGBB" - hex-digits Values for border sides: "solid", "dash", "2px", "dotted", "rounded", "wave"
de_at: Stil zum Hervorheben ersetzter Fragmente im Ergebnispaneel. Vollständiges Formular: "mark_replaced_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "font_strikeout":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Werte für Farben: "" - keine Farbe, "#RRGGBB" - Hex-Ziffern Werte für Rahmenseiten: "solid", "dash", "2px", "dotted", "rounded", "wave"

source: Style to mark lexer path. Full form: "lex_path_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Color values: "" - skip, "#RRGGBB" - hex-digits Values for border sides: "solid", "dash", "2px", "dotted", "rounded", "wave"
de_at: Stil zum Hervorheben des Lexerpfades. Vollständiges Formular: "lex_path_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Werte für Farben: "" - keine Farbe, "#RRGGBB" - Hex-Ziffern Werte für Rahmenseiten: "solid", "dash", "2px", "dotted", "rounded", "wave"
ru_ru: Стили для маркировки лексер-пути в Результатах. Полная форма: "lex_path_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Формат задания цвета: "" - пропустить, "#RRGGBB" - hex-цифры Значения для границ: "solid", "dash", "2px", "dotted", "rounded", "wave"
