Repository: CudaText-addons/CudaText-translations
Catalog: translation.*/langpy/*/LC_MESSAGES/cuda_find_*_files4.po
Languages: de_at, ru_ru

source: Plugin provides 3 CudaText commands to display its dialog: "Find in files": just show dialog. "Find in current tab": show dialog and start the search, if text pattern is auto set (using the engine option "use_selection_on_start"). "Find by preset": ask for a preset, then show dialog, filled from the chosen preset, and start the search. Those presets are allowed, which have stored: - pattern (or "use_selection_on_start" is on and selection is not empty), - mask of files, - start folder or/and tabs. ———————————————————————————————————————————————————————————————————————————————————————————— String to find (pattern) can be multi-line. Button "+" sets single-line or multi-line control. In single-line control the newlines are shown as §. ———————————————————————————————————————————————————————————————————————————————————————————— Some search options can be changed only via menu. · Sort collected files before reading text. · Age of files. · Skip hidden/binary files. · Filter by "Syntax elements" (comments or literal strings). · Encoding plan Warning! Be careful with filtering "Syntax elements" in long search. The filters significantly slow down the search. There is infobar to the left of "Find" button. The infobar shows not trivial values of "{OTH4FND}". ↓↓ Start with the newest file. ↑↑ Start with the oldest file. <5h Skip file older than 5 hours. <4d Skip file older than 4 days. <3w Skip file older than 3 weeks. <2m Skip file older than 2 months. <1y Skip file older than 1 year. -h Skip hidden files. -b Skip binary files. /*?*/ Search only inside comments. ?/**/? Search only outside of comments. "?" Search only inside literal strings. ?""? Search only outside of literal strings. /*?*/ "?" Search only inside comments OR literal strings. ?/**/? ?""? Search only outside of comments AND literal strings. Also infobar shows other settings: <>> Show lexer path for all fragments. (2:cp866) Encodings masks. utf8 First step encoding from "Encoding plan". Right-click on the infobar shows local menu with "{OTH4FND}". Double-click on the infobar clears all values except encoding. ———————————————————————————————————————————————————————————————————————————————————————————— Set special value "{tabs}" for field "{fold}" to search in tabs (opened documents). Fields "{incl}" and "{excl}" will be used to filter tab titles, in this type of search. To search in all tabs fill "{incl}" with "*". See also: Items of submenu "Scope". Hotkey Ctrl+Shift+U. ———————————————————————————————————————————————————————————————————————————————————————————— Values in fields "{incl}" and "{excl}" can contain ? for any single char, * for any substring (may be empty), [seq] any character in seq, [!seq] any character not in seq. Double-quote value, which needs space char. Note: * matches all names, *.* doesn't match all. Also the values can filter subfolder names if they start with "/". Example. {incl:12}: /a* *.txt {excl:12}: /ab* {fold:12}: c:/root Depth : All Search will consider all *.txt files in folder c:/root and in all subfolders a* except ab*. Also the values can filter lexer path if they are embraced with "[:" and ":]". The filter is path-like string with elements > path separator. E.g. "a>b>c" - node "c" is subnode of "b" and "b" is subnode of "a". >> recursive descent. E.g. "a>>c" - node "c" appears in branch "a". word name of a node. *word partial name of a node. word* partial name of a node. Blanks around all "<" are not important. So "a>>b>c" and "a > > b > c" are the same. Lexer path is matched with a filter if some start segments of path are compatible with all segments of the filter. Path "aa>bb>cc>dd" is matched with filters: "aa" "*a" "*>b*" ">>cc" ">>cc>*d" and is not matched with: "bb" "*>b" ">>c>dd" Example. {incl:12}: *.py [:def main:] {excl:12}: [:def main>>class*:] {fold:12}: <tabs> Search will consider all "*.py" open files and will search in module function "main" except searching in all classes defined inside the function. Warning! Be careful with filtering lexer path in long search. The filters significantly slow down the search. ———————————————————————————————————————————————————————————————————————————————————————————— ".*" - Option "Regular Expression". It allows to use in the field "{find}" such special symbols: . any character \d digit character (0..9) \w word-like character (digits, letters, "_") See engine option "re_verbose" to use complex reg-exp. See full documentation on the page docs.python.org/3/library/re.html If "Regular Expression" option is off, pattern still can supports some special symbols: | to separate the pattern to parts to find any of them & to separate the pattern to parts to find all of them See engine option "any_all_parts", how to turn those special symbols on/off. Symbols "|" are applied first, and "&" symbols are applied next (to make more parts between "|" symbols, if "|" is present). To include symbols as is, escape them with a backslash: "\|", "\&". Example. Find: abc|xyz Found: "abc cba", "zyx xyz", "_abc_xyz_" Find: abc&xyz Found: "abc xyz", "_xyz_abc_" Note. Option "w" (whole word) applies to all parts, after splitting by "|" and "&". If any of final part has a non-word character, "w" option is ignored. ———————————————————————————————————————————————————————————————————————————————————————————— Long-term searches can be interrupted by ESC.
de_at: Das Plug-in stellt 3 CudaText-Befehle bereit, um den Dialog anzuzeigen: "Suchen in Dateien": Zeigt nur den Dialog an. "Suchen im aktuellen Dateireiter": Zeigt den Dialog an und startet die Suche, falls die Textauswahl automatisch erfolgt (durch die Engine-Option "use_selection_on_start"). "Suchen per Voreinstellung": Erfragt eine Voreinstellung, zeigt dann den von ihr ausgefüllten Dialog an und startet die Suche. Zugelassen sind Voreinstellungen, die Folgendes enthalten: - Suchmuster (oder "use_selection_on_start" ist eingeschaltet und die Textauswahl ist nicht leer), - Dateimasken, - Startverzeichnis oder/und Dateireiter. ———————————————————————————————————————————————————————————————————————————————————————————— Der Such-String (Muster) darf mehrzeilig sein. Der Schalter "+" zeigt das Eingabfeld ein- oder mehrzeilig an. Im Einzeilenmodus werden die Zeilenschaltungen als '§' angezeigt. ———————————————————————————————————————————————————————————————————————————————————————————— Einige Suchoptionen können nur via Menü geändert werden. · Gesammelte Dateien vor dem Durchlesen sortieren. · Alter der Dateien. · Versteckte/binäre Dateien überspringen. · Filtern durch "Syntax-Elemente" (Kommentare oder literale Strings). · Kodierungsplan Warnung! Vorsicht beim Filtern der "Syntax-Elemente" in großen Dateien. Diese Filter verlangsamen die Suche erheblich. Links neben dem [Suchen]-Schalter wird eine Infoleiste angezeigt. Sie zeigt nichttriviale Werte von "{OTH4FND}" an. ↓↓ Beginnt mit der neuesten Datei. ↑↑ Beginnt mit der ältesten Datei. <5h Überspringt Dateien älter als 5 Stunden. <4d Überspringt Dateien älter als 4 Tage. <3w Überspringt Dateien älter als 3 Wochen. <2m Überspringt Dateien älter als 2 Monate. <1y Überspringt Dateien älter als 1 Jahr. -h Überspringt versteckte Dateien. -b Überspringt Binärdateien. /*?*/ Sucht nur innerhalb von Kommentaren. ?/**/? Sucht nur außerhalb von Kommentaren. "?" Sucht nur innerhalb von literalen Strings. ?""? Sucht nur außerhalb von literalen Strings. /*?*/ "?" Sucht nur innerhalb von Kommentaren ODER literalen Strings. ?/**/? ?""? Sucht nur außerhalb von Kommentaren UND literalen Strings. Die Infoleiste zeigt auch andere Einstellungen an: <>> Zeigt den Lexerpfad für alle Fragmente an. (2:cp866) Kodierungsmasken. utf8 Erster Schritt aus dem "Kodierungsplan". Rechtsklick auf die Infoleiste blendet ein Kontextmenü mit "{OTH4FND}" ein. Doppelklick auf die Infoleiste löscht alle Werte außer der Kodierung. ———————————————————————————————————————————————————————————————————————————————————————————— Der Spezialwert "{tabs}" im Feld "{fold}" ermöglicht die Suche in Dateireitern (offenen Dateien). Dieser Suchtyp verwendet die Felder "{incl}" und "{excl}" zum Filtern von Dateireitertiteln. Für die Suche in allen Dateireitern muss das Feld "{incl}" mit "*" ausgefüllt werden. Vgl. auch: Einträge des Untermenüs "Bereich". Tastenkürzel Strg+Shift+U. ———————————————————————————————————————————————————————————————————————————————————————————— Werte in den Feldern "{incl}" und "{excl}" dürfen enthalten: ? steht für ein einzelnes Zeichen, * steht für einen Teil-String (kann auch leer sein), [seq] steht für ein Zeichen aus der Zeichenklasse seq, [!seq] steht für ein Zeichen außerhalb der Zeichenklasse seq. Werte mit Leerzeichen müssen unter doppelte Anführungszeichen gestellt werden. Hinweis: * findet alle Namen, *.* findet nicht alle. Werte mit vorangestelltem Slash '/' können auch Unterverzeichnisnamen filtern. Beispiel: {incl:12}: /a* *.txt {excl:12}: /ab* {fold:12}: c:/root Tiefe : All Gesucht werden alle *.txt Dateien im Ordner c:/root und in allen Unterordnern a* außer ab*. Werte, die mit "[:" und ":]" eingefasst sind, können auch Lexerpfade filtern. Der Filter ist ein pfadähnlicher String mit folgenden Elementen: > Pfadtrenner. Z.B.: "a>b>c" - Knoten "c" ist Unterknoten von "b" und "b" ist Unterknoten von "a". >> Rekursiv absteigend. Z.B.: "a>>c" - Knoten "c" kommt vor in Zweig "a". word Name eines Knotens. *word Namensteil eines Knotens. word* Namensteil eines Knotens. Leerzeichen um alle "<" sind unwichtig. D.h. "a>>b>c" und "a > > b > c" sind gleichbedeutend. Der Lexerpfad wird gegen einen Filter geprüft, wenn einige Startsegmente des Pfads kompatibel mit allen Segmenten des Filters sind. Pfad "aa>bb>cc>dd" trifft zu auf die Filter: "aa" "*a" "*>b*" ">>cc" ">>cc>*d" und trifft nicht zu auf: "bb" "*>b" ">>c>dd" Beispiel: {incl:12}: *.py [:def main:] {excl:12}: [:def main>>class*:] {fold:12}: <tabs> Gesucht wird in allen offenen "*.py" Dateien in der Modulfunktion "main", außer in allen innerhalb "main" definierten Klassen. Warnung! Vorsicht beim Filtern der Lexerpfade in großen Dateien. Diese Filter verlangsamen die Suche erheblich. ———————————————————————————————————————————————————————————————————————————————————————————— ".*" - Option "Regulärer Ausdruck". Sie ermöglicht im Feld "{find}" folgende Metazeichen: . steht für ein beliebiges Zeichen \d steht für eine Ziffer (0..9) \w steht für ein Wortzeichen (Ziffer, Buchstabe, Unterstrich '_') Vgl. die Engine-Option "re_verbose", um komplexe Regex-Muster zu verwenden. Vgl. die vollständige Dokumentation auf der Internet-Seite docs.python.org/3/library/re.html Ist die Option "Regulärer Ausdruck" ausgeschaltet, unterstützt das Suchmuster trotzdem einige Spezialzeichen: | trennt das Suchmuster in Teile, um einen davon zu finden & trennt das Suchmuster in Teile, um alle davon zu finden Vgl. die Engine-Option "any_all_parts", wie man diese Spezialzeichen ein-/ausschaltet. Die Spezialzeichen '|' werden zuerst angewendet, dann erst die Spezialzeichen '&' (um mehr Teile zwischen '|'-Zeichen zu erzielen, falls '|' vorkommt). Um Spezialzeichen literal zu verwenden, müssen sie mit Backslash geschützt werden: "\|", "\&". Beispiel: Suchen nach: abc|xyz Gefunden wird: "abc cba", "zyx xyz", "_abc_xyz_" Suchen nach: abc&xyz Gefunden wird: "abc xyz", "_xyz_abc_" Hinweis: Die Option "w" (Ganzes Wort) wird nach der Teilung durch '|' und '&' auf alle Teile angewendet. Die Option "w" wird ignoriert, wenn einer der endgültigen Teile ein Nicht-Wortzeichen enthält. ———————————————————————————————————————————————————————————————————————————————————————————— Lang andauernde Suchvorgänge können mit der [Esc]-Taste unterbrochen werden.

source: Plugin provides ... ———————————————————————————————————————————————————————————————————————————————————————————— String to replace (pattern) can include macro variable. Use Ctrl+A to view all variables, select and append one. In single-line control the newlines are shown as §. ———————————————————————————————————————————————————————————————————————————————————————————— Long-term replacements can be interrupted by ESC.
de_at: Das Plug-in stellt bereit... ———————————————————————————————————————————————————————————————————————————————————————————— Der Ersetzungs-String (Muster) darf Makrovariablen enthalten. Strg+A zeigt alle Variablen an, wovon eine ausgewählt und angehängt werden kann. Im einzeiligen Suchfeld werden Zeilenschaltungen als '§' angezeigt. ———————————————————————————————————————————————————————————————————————————————————————————— Lang andauernde Suchvorgänge können mit der [Esc]-Taste unterbrochen werden.

source: Only the options "-N+M" (with lines above/below) "Show lexer path for all fragments" need to be set before the start of search. All other options immediately change Results view. Options to view Results: ┌────────────────────────────────────┬───────────────────────────────────────────────────┐ │ Option │ Comment │ ╞════════════════════════════════════╪═══════════════════════════════════════════════════╡ │ "-N/+M" (with lines above/below) │ See check-button "-N+M" above the search pattern. │ │ │ Turn option off and on to show dialog │ │ │ to set N and M. │ ├────────────────────────────────────┼───────────────────────────────────────────────────┤ │ Show relative paths │ The option immediately changes between │ │ │ <c:/dir1/search-root/dir2>: #NN │ │ │ <c:/dir1/search-root/dir2/filename.ext>: #NN │ │ │ and │ │ │ <dir2>: #NN │ │ │ <dir2/filename.ext>: #NN │ ├────────────────────────────────────┼───────────────────────────────────────────────────┤ │ Show modification time │ If files are shown on separate lines │ │ │ (tree format is not "<path:r>:line") │ │ │ the option immediately changes between │ │ │ <...filename.ext>: #NN │ │ │ and │ │ │ <...filename.ext (1999.12.31 23:59)>: #NN │ ├────────────────────────────────────┼───────────────────────────────────────────────────┤ │ Format for Result tree │ Full info about each fragment in one line. │ │ <path:r>:line │ Example │ │ │ <dir1/dir2/filename1.ext:12>: fragment line │ │ │ <dir1/dir3/filename2.ext:21>: fragment line │ ├────────────────────────────────────┼───────────────────────────────────────────────────┤ │ Format for Result tree │ Separate line per each file. │ │ <path>#N/<r>:line │ Example │ │ │ <dir1/dir2/filename1.ext>: #1 │ │ │ <12>: fragment line │ │ │ <dir1/dir3/filename2.ext>: #1 │ │ │ <21>: fragment line │ ├────────────────────────────────────┼───────────────────────────────────────────────────┤ │ Format for Result tree │ Separate line per each folder with files. │ │ <dir>#N/<file:r>:line │ Example │ │ │ <dir1/dir2>: #1 │ │ │ <filename1.ext:12>: fragment line │ │ │ <dir1/dir3>: #1 │ │ │ <filename2.ext:21>: fragment line │ ├────────────────────────────────────┼───────────────────────────────────────────────────┤ │ Show lexer path for all fragments │ Results include lines with lexer path. │ │ │ Example │ │ │ <filename.ext>: #1 │ │ │ < >: path > to > fragment │ │ │ <12>: fragment line │ ├────────────────────────────────────┼───────────────────────────────────────────────────┤ │ Add lexer path to the statusbar │ When you move caret in Results, or use commands │ │ │ "Go to next/prev found fragment", statusbar │ │ │ shows the path to current fragment's file. │ │ │ If the option is on, then statusbar also shows │ │ │ the path to the current fragment in the document. │ └────────────────────────────────────┴───────────────────────────────────────────────────┘ To set the mark style of found fragmets use the engine options dialog (Ctrl+E). See "mark_style" in section "Results". How Results are shown when files were sorted? Found fragments are always shown by the selected method. If tree format is "<path:r>: line" - no problem. For other formats content of "folder lines" and "file lines" adapts (via folder merging) to show correct data. In extreme cases format automatically sets to "<path:r>: line".
de_at: Nur die Optionen "-N+M" (mit Zeilen darüber/darunter) "Lexerpfad für alle Fragmente anzeigen" müssen vor dem Start der Suche eingestellt sein. Alle anderen Optionen wirken unmittelbar auf die Ergebnisanzeige. Optionen für die Ergebnisanzeige: ┌────────────────────────────────────────┬─────────────────────────────────────────────────────────────┐ │ Option │ Kommentar │ ╞════════════════════════════════════════╪═════════════════════════════════════════════════════════════╡ │ "-N/+M" (mit Zeilen darüber/darunter) │ Beachte den Schalter "-N+M" über dem Suchmuster. │ │ │ Option aus- und einschalten, um den Dialog zum Einstellen │ │ │ N und M einzublenden. │ ├────────────────────────────────────────┼─────────────────────────────────────────────────────────────┤ │ Relative Pfade anzeigen │ Die Option wechselt sofort zwischen │ │ │ <c:/dir1/search-root/dir2>: #NN │ │ │ <c:/dir1/search-root/dir2/filename.ext>: #NN │ │ │ und │ │ │ <dir2>: #NN │ │ │ <dir2/filename.ext>: #NN │ ├────────────────────────────────────────┼─────────────────────────────────────────────────────────────┤ │ Änderungsdatum anzeigen │ Wenn Dateien pro Zeile angezeigt werden │ │ │ (das Baumformat ist nicht "<path:r>:line"), │ │ │ dann wechselt die Option sofort zwischen │ │ │ <...filename.ext>: #NN │ │ │ und │ │ │ <...filename.ext (1999.12.31 23:59)>: #NN │ ├────────────────────────────────────────┼─────────────────────────────────────────────────────────────┤ │ Format für den Ergebnisbaum │ Volle Info über jedes Fragment in einer Zeile. │ │ <path:r>:line │ Beispiel: │ │ │ <dir1/dir2/filename1.ext:12>: Fragmentzeile │ │ │ <dir1/dir3/filename2.ext:21>: Fragmentzeile │ ├────────────────────────────────────────┼─────────────────────────────────────────────────────────────┤ │ Format für den Ergebnisbaum │ Eigene Zeile für jede Datei. │ │ <path>#N/<r>:line │ Beispiel: │ │ │ <dir1/dir2/filename1.ext>: #1 │ │ │ <12>: Fragmentzeile │ │ │ <dir1/dir3/filename2.ext>: #1 │ │ │ <21>: Fragmentzeile │ ├────────────────────────────────────────┼─────────────────────────────────────────────────────────────┤ │ Format für den Ergebnisbaum │ Eigene Zeile für jedes Verzeichnis mit Dateien. │ │ <dir>#N/<file:r>:line │ Beispiel: │ │ │ <dir1/dir2>: #1 │ │ │ <filename1.ext:12>: Fragmentzeile │ │ │ <dir1/dir3>: #1 │ │ │ <filename2.ext:21>: Fragmentzeile │ ├────────────────────────────────────────┼─────────────────────────────────────────────────────────────┤ │ Lexerpfad für alle Fragmente anzeigen │ Das Ergebnis bezieht Zeilen mit dem Lexerpfad mit ein. │ │ │ Beispiel: │ │ │ <filename.ext>: #1 │ │ │ < >: Pfad > zum > Fragment │ │ │ <12>: Fragmentzeile │ ├────────────────────────────────────────┼─────────────────────────────────────────────────────────────┤ │ Lexerpfad zur Statuszeile hinzufügen │ Wenn man im Ergebnis den Cursor bewegt oder die Befehle │ │ │ "Geh zum nächsten/vorigen gefundenen Fragment" ausführt, │ │ │ dann zeigt die Statusleiste den Pfad zum aktuellen │ │ │ Fragment an. Ist die Option eingeschaltet, dann zeigt die │ │ │ Statusleiste auch den Pfad im Dokument an. │ └────────────────────────────────────────┴─────────────────────────────────────────────────────────────┘ Der Markierungsstil gefundener Fragmente kann mit dem Dialog "Engine-Optionen" (Strg+E) eingestellt werden. Vgl. "mark_style" in der Sektion "Ergebnis". Wie wird das Ergebnis dargestellt, wenn Dateien sortiert worden sind? Gefundene Fragmente werden immer nach der ausgewählten Methode angezeigt. Mit dem Baumformat "<path:r>:line" gibt's keine Probleme. Bei anderen Formaten wird der Inhalt von "folder lines" und "file lines" für die korrekte Darstellung aufbereitet (per Ordnerzusammenführung). Im Extremfall wird das Format automatisch auf "<path:r>:line" eingestellt.
